[
    "FTC sues Amazon for tricking customers into signing up for Prime",
    "Amazon duped millions of consumers into enrolling in Prime, US FTC says",
    "FTC Sues Amazon for Making It Difficult to Cancel Prime",
    "F.T.C. Sues Amazon for Inducing Users to Subscribe to Prime",
    "FTC: Amazon Tricked Millions Into Signing Up For Prime Subscriptions",
    "FTC: Amazon trapped millions into hard-to-cancel Prime memberships",
    "FTC sues Amazon, alleging it duped consumers into buying hard-to-cancel Prime subscriptions",
    "FTC Amazon Prime Suit Points to Larger Issues on Subscription Cancellations",
    "FTC Sues Amazon for ‘Tricking’ Customers Into Prime Memberships",
    "It Takes 6 Clicks To Cancel Amazon Prime and the FTC's New Lawsuit Says That's Too Many",
    "Amazon.com sued for enrolling millions of consumers into paid subscription ‘without consent’",
    "FTC Sues Amazon For “Trapping” Users Into Recurring Prime Subscriptions",
    "Amazon duped millions into enrolling in Prime, US regulator says in lawsuit",
    "Amazon Allegedly Tricked Users Into Prime Subscriptions and Sabotaged Their Attempts to Cancel",
    "Amazon Prime too easy to join, too hard to quit, says FTC lawsuit",
    "FTC sues Amazon for ‘tricking and trapping’ people in Prime subscriptions",
    "FTC sues Amazon, alleging users are being tricked into signing up for Prime",
    "Amazon duped consumers into buying Amazon Prime, FTC claims",
    "FTC Sues Amazon Over ‘Manipulative’ Tactics to Enroll Users in Premium Service",
    "FTC files a lawsuit against Amazon for allegedly signing people to Prime without consent",
    "FTC Sues Amazon Over Tricking Users Into Signing Up for Prime",
    "Amazon ‘tricked and trapped’ customers with Prime service, FTC claims",
    "Lawsuit Accuses Amazon Of Decieving Customers Into Buying Prime",
    "Amazon's “Cancellation Trickery” for Prime Subscriptions Prompts FTC Suit",
    "FTC Sues Amazon For ‘Manipulative’ Prime Signup Process",
    "FTC sues Amazon for “tricking and trapping” Prime customers",
    "FTC accuses Amazon of deceiving customers with Prime subscription sign-up, cancellation",
    "Amazon Faces FTC Lawsuit Over ‘Deceptive’ Prime Sign-up Process",
    "Amazon Prime is too damn hard to cancel, says FTC lawsuit",
    "Amazon Sued by FTC for Allegedly Tricking Customers into Signing Up for Prime",
    "FTC sues Amazon for allegedly tricking customers into Prime subscriptions",
    "FTC Sues Amazon, Alleging Deceptive Practices Tied to Prime Subscriptions",
    "FTC sues Amazon for using ‘deceptive’ tactics to sign up customers for Prime",
    "FTC Sues Amazon Over Shady Prime Practices",
    "Amazon ‘tricked’ customers into paying for Prime, new FTC suit alleges",
    "Amazon sued by FTC over ‘deceptive’ practices used to sign up customers for Prime",
    "FTC claims Amazon tricked millions into Prime subscriptions",
    "AMAZON SHARES FALL MORE THAN 1% ON FTC LAWSUIT",
    "FTC sues Amazon over ‘deceptive’ Prime sign-up and cancellation process",
    "Xbox Series X Gets a Price Hike, But Not In The US (For Now Anyways)",
    "Xbox Series X and Game Pass prices will increase in July",
    "Xbox Series X to get a new price tag",
    "Microsoft Hikes Prices of Xbox Series X, Game Pass Worldwide",
    "Microsoft is raising Xbox Series X and Game Pass prices in most countries",
    "Microsoft is Raising Prices for Game Pass and Xbox Series X",
    "Microsoft hikes Xbox Series X pricing 2.5 years after launch in select countries",
    "Xbox Series X console price increases to £480 in UK - Game Pass Ultimate up to £13",
    "Xbox Series X Console Price Increase Confirmed for Some Gamers",
    "Xbox Series X and Game Pass Are About to Get A Little More Expensive",
    "Microsoft is raising the price of the Xbox Series X, Game Pass in Canada",
    "Microsoft increases Xbox Game Pass price ahead of Activision merger",
    "Xbox Series X prices are going up in most markets, Xbox Game Pass prices are going up too",
    "Xbox Game Pass Gets a Price Hike, Xbox Series X Also Gets More Expensive Outside the U.S.",
    "Microsoft Is Increasing Xbox Series X & Game Pass Prices",
    "Microsoft raising prices for Xbox Series X, Game Pass in coming months",
    "Xbox Series X Consoles And Xbox Game Pass Subscriptions Are Getting A Price Increase",
    "Xbox Game Pass price hike is coming in July",
    "Xbox Game Pass and Xbox Series X price increases coming soon",
    "Microsoft is raising Xbox Game Pass prices for console and Ultimate",
    "Xbox Series X And Game Pass Are Raising Prices To Match PS5",
    "Microsoft Announces Price Increases For Xbox Series X And Xbox Game Pass",
    "Microsoft is raising Xbox Series X and Game Pass prices",
    "Microsoft to raise Xbox Series X, Game Pass prices",
    "Microsoft is hiking the price of Xbox Series X and Xbox Game Pass",
    "[Xbox] Microsoft is hiking the price of Xbox Series X Consoles and Xbox Game Pass",
    "The Verge: Microsoft is hiking the price of Xbox Series X and Xbox Game Pass",
    "Introducing Dropbox Dash, AI-powered universal search, and Dropbox AI",
    "Dropbox Launches Two AI-Powered Productivity Features",
    "Dropbox's new tools reimagine the cloud service as your AI sidekick",
    "Dropbox rolls out new AI features for search and summarization",
    "Dropbox introduces generative AI-powered products to ease knowledge work",
    "Dropbox launches its new AI-powered search engine for files",
    "Dropbox Launches Dropbox AI, Dropbox Dash AI-Powered Tools",
    "Dropbox Launches AI Initiatives And New AI-Powered Features",
    "Dropbox unveils two AI-based products, launches $50M AI venture fund",
    "Dropbox Now Has Its Own AI, And Universal Search Is Its Thing",
    "Dropbox launches $50M AI-focused venture fund, intros AI features",
    "Schumer outlines plan for how Senate will regulate AI",
    "Schumer launches ‘all hands on deck’ push to regulate AI",
    "Schumer tees up Senate plan for AI regulation",
    "Chuck Schumer calls on Congress to pick up the pace on AI regulation",
    "Schumer launches new phase in push for AI bill",
    "Sen. Schumer introduces AI policy framework, calls for ‘comprehensive legislation’",
    "Chuck Schumer Urges Swift Action on AI Regulations",
    "Chuck Schumer Joins Crowd Clamoring for AI Regulations",
    "US Senator Chuck Schumer calls for ‘comprehensive’ AI legislation",
    "Congress must join the AI revolution.",
    "San Francisco Business Journal",
    "The White House on YouTube",
    "The EU AI Act is near.  US AI regulation is coming.  Here's what you need to know |  The AI Beat",
    "Europe, US urged to investigate the type of AI that powers systems like ChatGPT",
    "Biden meets with tech company critics on AI",
    "Biden, Modi to take media questions on Thursday, says White House",
    "Biden meets with AI experts on managing risks",
    "What President Biden said about artificial intelligence during his Bay Area visit",
    "Consumer group calls on EU to urgently investigate ‘the risks of generative AI’",
    "EU consumer protection groups urge governments to investigate AI",
    "EU consumer group calls for ‘urgent investigations’ of generative AI risks",
    "EU watchdogs demand Action: investigating the risks of AI chatbot algorithms",
    "The Hill's Morning Report — Trump: Double standard in Hunter Biden plea deal",
    "President Biden's Vision for AI: Seizing Opportunities and Managing Risks",
    "Biden staff are meeting regularly to develop AI strategy, White House says",
    "In San Francisco, Biden says AI has 'enormous promise but comes with risks",
    "Biden says there is need to address security, economic risks posed by AI",
    "President Biden wraps up Bay Area visit",
    "President Biden Participates in a Meeting on Artificial Intelligence with Civil Society Leaders",
    "Biden to meet with A.I. experts in San Francisco",
    "This is so important. I hope we get a strong readout of the discussion. https://twitter.com/...",
    "Honored to meet with President Biden. https://thehill.com/...",
    "Important person for Biden to meet on AI issues. https://twitter.com/...",
    "Secret Invasion Pushes the Boundaries of an Unreliable Narrator",
    "Artists are upset that ‘Secret Invasion’ used AI Art for opening credits",
    "Marvel criticized for using AI to make ‘Secret Invasion’ opening credits",
    "‘Secret Invasion’ AI-Generated Opening Credits Sequence Draws Backlash",
    "‘Secret Invasion’ Opening Credits Generated By AI, Prompting Backlash From Audiences",
    "What to watch before Secret Invasion",
    "4 questions we have after Secret Invasion episode 1",
    "Marvel's ‘Secret Invasion’ Show Uses Generative AI—And Fans and Creators Are Livid",
    "Marvel Secret Invasion's AI Credits Are A Soulless Insult To Artists",
    "'Secret Invasion's AI credits aren't clever — they're downright scary",
    "Secret Invasion: “Gross” AI opening credits divide MCU fans",
    "Why Marvel's Secret Invasion Has An AI-Made opening",
    "Artists Are Mad About Marvel's ‘Secret Invasion’ AI-Generated Opening Credits",
    "Marvel's Secret Invasion is here, and it brought AI-generated grotesquery with it.",
    "FFS  —  Tone deaf and disrespectful.  —  https://www.polygon.com/...",
    "Pay artists to do this you cheap fucks. Shame on you Marvel. https://twitter.com/...",
    "Marvel uses AI generated art for the opening credits of their show.  Anti-AI people are furious.",
    "Yes, Secret Invasion's opening credits scene is AI-made — here's why (via: Polygon)",
    "Yes, Secret Invasion's opening credits scene is AI-made — here's why",
    "Secret Invasion's Opening Credits Scene is AI-Made",
    "A.I.'s exploitation of human workers could come back to bite it",
    "Life in the trenches labeling AI data. https://www.theverge.com/...",
    "@alastairmrushworth@fosstodon.org",
    "A big round of applause to the king @joshdzieza for this one https://nymag.com/...",
    "this story should sit at the foundation of every conversation about ai https://twitter.com/...",
    "Pay no attention to the underpaid human human workers behind the curtain. https://twitter.com/...",
    "Really good piece on where the HF part of RLHF comes from https://nymag.com/...",
    "Amazon Prime Day is back July 11-12! Here are 5 shopping tips to help you prepare.",
    "Amazon Prime Day Comes Back on July 11-12",
    "Amazon Announces the Dates for Its Annual Prime Day Event",
    "The Best Amazon Prime Day TV Deals 2023: Shop Early Sales on Samsung, Sony, and Amazon Fire TVs",
    "Amazon Prime Day 2023 Deals Event: When And What To Expect",
    "Amazon Prime Day 2023 Taking Place July 11 And 12, Early Deals Available Now",
    "Amazon Prime Day 2023 Will Run July 11-12",
    "Best Early Amazon Prime Day Deals",
    "Amazon Prime Day 2023 officially kicks off on July 11-12",
    "Prime Day 2023 is going to be different than its predecessors",
    "Amazon Prime Day is official: July 11-12 for major sales on tech and more",
    "Amazon Prime Day is set to return on July 11",
    "Will iPhones be cheaper on Prime Day 2023? Our prediction",
    "Amazon Prime Day is officially coming July 11-12, but the deals actually start right now",
    "First look: Amazon's official Prime Day 2023 deals list & best early sales",
    "The Morning After: Amazon Prime Day kicks off July 11th",
    "Amazon Prime Day 2023 is happening on July 11th and 12th",
    "Amazon says Prime Day will run July 11 and 12, introduces invite-only deals",
    "Amazon officially announces Prime Day 2023 for July 11 and 12",
    "Amazon's 2023 Prime Day event will kick off July 11",
    "Amazon Announces Prime Day 2023 Sale Will Take Place July 11 - 12",
    "Amazon Prime Day dates are confirmed — but the deals have already started",
    "Amazon Prime Day 2023 Announced: 48-Hour Sale Kicks Off July 11",
    "Amazon Prime Day is July 11 & 12 — with new invitation deals",
    "Amazon Prime Day 2023 starts July 11 — here's what to expect",
    "When is Amazon Prime Day in 2023?  —  Amazon has announced the dates for Prime Day 2023 …",
    "Amazon Prime Day 2023 Dates Officially Announced",
    "Amazon will hold its Prime Day shopping event on July 11-12",
    "Prime Day 2023 start date is July 11 — here are the first confirmed deals",
    "Amazon Prime Day 2023 will take place on July 11th and 12th",
    "Amazon Prime Day 2023 kicks off July 11th this year",
    "Amazon kicks off Prime Day 2023 on July 11 and 12",
    "Amazon's Prime Day Returns July 11 & 12",
    "Elon Musk triples down on making Twitter terrible for trans people",
    "Elon Musk says terms like ‘cisgender’ and ‘cis’ are now considered ‘slurs’ on Twitter",
    "Elon Musk Declares ‘Cisgender’ a Slur on Free Speech Twitter",
    "Elon Musk bans the word “cis” on twitter",
    "Elon Musk Says ‘Cisgender’ Now Considered A Slur On Twitter",
    "How it started, how it's going https://twitter.com/... [image]",
    "As a cis person, I hereby give all trans people the cis-word pass https://twitter.com/...",
    "@mysteriouskat Call yourself anything you want",
    "MODS MODS MODS BAN HIM [image]",
    "I'm sure Dave will take huge issue with this clear violation of free speech any time now.",
    "Best way to watch Oppenheimer: IMAX & PLF explained",
    "Christopher Nolan, With ‘Oppenheimer,’ Aims To Capture “The Most Dramatic Moment In History”",
    "How Christopher Nolan Learned to Stop Worrying and Love AI",
    "Christopher Nolan Says AI Dangers Have Been ‘Apparent For Years’",
    "Server Subscriptions Just Got Super Powered: Introducing Media Channels, Tier Templates and more!",
    "Discord Launches Media Channels, Tier Templates for Server Subscriptions",
    "Discord adds ‘Media Channels’ and tests ‘Server Shop’ feature",
    "Discord expanding monetisation options with Media Channels",
    "Discord just ramped up monetization again with new subscription tiers",
    "Discord plans to let creators sell downloadable products",
    "Intel Agrees to Sell Minority Stake in IMS Nanofabrication Business to Bain Capital",
    "Intel to Sell Minority Stake in Austrian Chip Firm",
    "Intel to sell 20% stake in IMS to Bain at $4.3 billion valuation",
    "Intel parts with 20% slice of semiconductor biz crucial to chip production future",
    "Intel to sell 20% stake in Austrian chip company",
    "Twitter resumes paying Google Cloud - Bloomberg News",
    "SoftBank's Son Goes Back on Offense to Cement His Tech Legacy",
    "Masayoshi Son is back and it's beautiful",
    "SoftBank Shifting Back To ‘Offense’ When It Comes to Investing — Thanks To AI",
    "SoftBank's Vision Fund to Start Job Cuts as Soon as This Week",
    "SoftBank's Masayoshi Son Shifts to ‘Offense’ in A.I. Race",
    "ChatGPT Told Softbank's Masayoshi Son His Ideas Are Great.  Now He's Investing Big in AI.",
    "SoftBank CEO had a crisis of confidence that left him in tears for days: ‘I felt a real emptiness’",
    "SoftBank Group and CEO Masayoshi Son are back and on the offensive",
    "SoftBank to shift from ‘defense mode’ to ‘offense mode,’ says CEO Masayoshi Son",
    "Masayoshi Son launches ‘offensive’ on tech startups, boosts AI focus",
    "Oh my. How much of Nvda msft do they buy https://twitter.com/...",
    "Looking forward to the accompanying SoftBank slides https://twitter.com/... [image]",
    "SoftBank after their last $32B loss: https://twitter.com/... [image]",
    "We're weeping we're laughing we're a little worried about this Al character https://www.ft.com/...",
    "Now just need Cathie Comeback magazine cover and All Clear Echo is a wrap. https://twitter.com/...",
    "A nuanced and well-researched piece on AI x-risk: https://www.technologyreview.com/ ...",
    "Amazon vs. Walmart: Reporter and author Jason Del Rey on the ‘defining business clash’ of our era",
    "Patreon adds e-commerce tools, free fan membership",
    "Netflix's new show ranking system doesn't change much",
    "Action-thriller series Bloodhounds gains explosive popularity on Netflix",
    "Black Mirror season 6 is a hit on Netflix, but it's not the breakout TV show of the week",
    "The 10 most-watched movies of all time on Netflix",
    "Netflix Updates Top 10 Charts to Include Estimated Viewers in Addition to Hours Viewed",
    "Reddit removes moderators from top subreddits amid protests",
    "Thousands of Reddit Communities Stay Dark as App Policy Protest Continues",
    "Reddit Strike One Week On: A Third Of Subreddits Still Down",
    "Reddit Moderators Are Protesting By Changing Their Communities to NSFW",
    "Reddit Experiments With Removing Mods, Blocking Attempts To Switch Subs To NSFW",
    "Reddit removes mods as subreddits continue protesting unpopular API changes",
    "Reddit Goes Nuclear, Removes Moderators of Subreddits That Continued To Protest",
    "Reddit Is Removing Mods Over NSFW Protests",
    "The moderator Code of Conduct",
    "Reddit API backlash continues, with moderators demonetizing subreddits",
    "What the Reddit Revolt Means for Social Media in an AI Era",
    "Reddit's API controversy sees subreddits go NSFW",
    "Popular subreddits welcomed porn content to protest Reddit's API changes",
    "Reddit to remove mods who changed Subreddit to NSFW.",
    "Reddit removed moderators behind the latest protests before restoring a few of them",
    "Reddit is bringing in scabs to replace mods",
    "VOTE: Help decide on the future of r/MildlyInteresting",
    "Uhhhh, What the fuck is happening at /mildlyinteresting???",
    "Reddit starts removing moderators behind the latest protests",
    "Removed from /r/searchandrescue, which was public, in retaliation for other subs being private.",
    "Reddit communities adopt alternative forms of protest as the company threats action on moderators",
    "Empowering our Creative Leaders to Drive Growth",
    "Electronic Arts Restructures, Names New Head of Entertainment",
    "EA restructure divides business into EA Entertainment and EA Sports",
    "EA announces major restructure, splits EA Entertainment and EA Sports",
    "EA Sports and EA Games Are Splitting Up",
    "Electronic Arts restructures studios into EA Entertainment and EA Sports",
    "EA Games breaks into two companies",
    "EA Restructuring Will Spin Off EA Sports Into A Separate Division",
    "EA is splitting into two companies - EA Entertainment and EA Sports",
    "EA Dividing Itself - Will Operate as EA Entertainment and EA SPORTS",
    "Electronic Arts is restructuring its studios into two organisations",
    "EA Games to Become EA Entertainment in Major Corporate Reshuffle",
    "Electronic Arts Restructures Its Studios Into Two Organisations",
    "EA Is Splitting Into Two Separate Organisations",
    "EA Games Changes Name After Massive Restructuring",
    "Electronic Arts is realigning studios into EA Sports and EA Entertainment",
    "EA Games And EA Sports Are Splitting In Two To “Empower” Creative Teams",
    "Electronic Arts is Splitting into EA Entertainment and EA Sports",
    "EA Games becomes EA Entertainment, splits from EA Sports in restructuring",
    "EA Games splits with EA Sports and becomes EA Entertainment",
    "EA undergoes C-suite and division restructure",
    "EA Implements Reorganization, Divides into EA Entertainment and EA Sports",
    "EA realigns into EA Sports and EA Entertainment divisions",
    "EA splits into EA Entertainment and EA Sports",
    "Electronic Arts Is Changing Its Game Studio Structure Into EA Entertainment And EA Sports",
    "Electronic Arts Shake-Up: New CFO and Studio Reorganization",
    "EA splits Sports and Games in major organization shakeup",
    "Im going to guess this is why we havent gotten any news/updates; trouble at EA Sports and EA Games",
    "EA Sports and EA Games Splitting Apart in Internal Shakeup",
    "EA Sports and EA Games Splitting Apart in Internal Shakeup - IGN",
    "Google accuses Microsoft of anticompetitive cloud practices - The Information",
    "Google Accuses Microsoft Of Tricking Customers Into Cloud Service Contracts",
    "Google accuses Microsoft of unfair practices in Azure cloud unit",
    "Instagram finally lets users download Reels",
    "You Can Finally Download Instagram Reels on Mobile",
    "How to download Instagram reels without third-party apps easily",
    "Instagram enables download of public Reels in the US",
    "Instagram allows downloading Reels now but you may not be able to use it",
    "Instagram now lets some users download Reels, here is how",
    "Instagram finally allows users to download public Reels",
    "Download Reels From Instagram App Natively, Here's How",
    "Instagram now lets you download Reels from public accounts",
    "You can download Instagram Reels now",
    "Instagram Reels download is finally possible on mobile",
    "Instagram reels can now be downloaded on your device, says IG head",
    "Now you can officially download Reels from the Instagram app",
    "Instagram now lets users download Reels, but Indian users can not download it yet!",
    "Instagram Now Allows Users To Download Public Reels",
    "Instagram Will Now Allow Users to Download Publicly Posted Reels Content",
    "Alibaba's Jack Ma and Joe Tsai show up at offices in Hangzhou amid restructuring",
    "Alibaba co-founder Joseph Tsai back as chair",
    "Alibaba's crypto-friendly transition: Joseph Tsai takes the helm as chairman",
    "Alibaba names new chairman and CEO in major shakeup",
    "Free compensation benchmarking data from 3,000 startups",
    "Google introduces AI-powered money laundering detection service",
    "Google Cloud launches AI-powered anti-money laundering tool",
    "Google Cloud Launches Anti Money Laundering AI for Financial Institutions",
    "Here's How Much LOTR Rights Sold For",
    "Embracer Group Paid $396M For ‘Lord Of The Rings’ Rights",
    "Embracer Group Paid $395 million for ‘Lord of the Rings’ Rights",
    "Personalized wealth management, built for tech people",
    "Data-driven customer experience on a unified platform",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Replit: From idea to software, fast.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "Discord: Building something you actually use.",
    "Clear Street: Today's financial infrastructure.",
    "Techmeme: You might have heard of us...",
    "Jun 19-23Cannes LionsCannes",
    "Jun 20-22HPE DiscoverLas Vegas",
    "Jun 21-22HYBRID: ConfigSan Francisco",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "DexCare Raises $75M in Series C Funding",
    "DexCare Raises $75M to Accelerate Care Access Platform",
    "Coinbase Takes Preemptive Legal Measures to Navigate Regulatory Storm",
    "Volt Raises $60 Million to Expand to Australia and US",
    "UK fintech sector gets a boost with Volt's $60m Series B round led by Silicon Valley investor IVP",
    "Volt raises $60m Series B round led by Silicon Valley investor IVP",
    "Payments Fintech Volt Raiss $60 Million Series B",
    "Coinbase, Klarna investor IVP backs London-based Volt in €54M round: Know more",
    "Real-time payments infrastructure provider Volt recharges with another $60 million",
    "Payments provider Volt scores £47m Series B round",
    "International Business Times",
    "Bernie Sanders Opens Investigation Into ‘Dangerous and Illegal’ Amazon Warehouse Conditions",
    "Bernie Sanders Opens Investigation Into Amazon's ‘Uniquely Dangerous’ Warehouses",
    "Germany to offer aid only to strategic sectors after Intel subsidy -minister",
    "The federal government has a new cyber player",
    "Drip drip... https://twitter.com/...",
    "TikTok Expands Online Retail Offerings to Compete With Shein and Amazon",
    "TikTok Begins Selling Its Own Products in the U.K.",
    "American Companies Are Hostage to the Whims of TikTok",
    "Crib raises seed round from founders of Paytm, CRED, Mamaearth, and others",
    "Insight cutting its fundraising target isn't reason to panic",
    "Bill Gates-Backed KoBold Metals Raises $1 Billion for AI Mining of Rare Earth Metals",
    "A mining tech unicorn: KoBold's $195M round",
    "Bill Gates-backed Berkeley metal mining startup KoBold doubles funding",
    "The top of AI hysteria can't be far away if this is happening https://twitter.com/...",
    "YouTube to launch its first official shopping channel in South Korea, Yonhap reports",
    "How to Become a YouTuber in 2023: A Comprehensive Guide",
    "YouTube to launch first official shopping channel",
    "YouTube to debut live shopping channel in South Korea",
    "YouTube To Launch Its First Official Shopping Channel In South Korea 1",
    "Ant Group confirms it is working on own AI large language model",
    "Ant Group Confirms Reports about Its Own AI Large-Language Model",
    "Ant Group to develop AI model for ChatGPT-like services",
    "Ant Developing Large Language Model Technology",
    "Musk refused to pay annual bonuses promised to Twitter employees, lawsuit says",
    "Daily Digest: Visa names new CFO; Twitter faces potential class-action suit over payouts",
    "Musk Sued Over Refusal to Pay Twitter Employee Bonuses",
    "Twitter Employees Sue The Company Over Bonuses - Say They Weren't Paid Despite Promises",
    "Twitter workers sue over unpaid bonuses they were promised",
    "Easily replaceable phone batteries might be back, and I'm here for it",
    "iPhone battery replacement legislation raises a huge number of questions",
    "Easily Replaceable Smartphone Batteries Could Make A Comeback",
    "EU could force Apple to make iPhone batteries replaceable — what you need to know",
    "Apple braces for change as EU demands easy battery replacement for smartphones",
    "EU wants “readily removable” batteries in devices soon—but what does that mean?",
    "Quotient Technology Gets Buyout Offer From Neptune Retail Solutions",
    "Quotient to Combine with Neptune Retail Solutions",
    "Introducing Content Classification Labels",
    "Twitch cleaning up operations with content classification labels",
    "New Twitch labels hope to better classify mature content",
    "Twitch replaces its mature content mode with more granular ‘labels’",
    "Twitch introduces new labels to classify mature content",
    "Twitch introduces new content classification labels",
    "Twitch introduces content classification labels",
    "Twitch adds new labels for streams with mature content",
    "Content Classification Labels"
]