[
    "FTX Begins Talks on Reboot as Managers Uncover Past Misconduct",
    "FTX Stops Sale of $500 Million Stake in AI Firm Anthropic: Report",
    "FTX begins talks to relaunch international cryptocurrency exchange - WSJ",
    "FTX hits brakes on sale of $500 million stake in AI firm: Bloomberg",
    "FTX Halts Sale of $500 Million Stake in AI Startup Anthropic",
    "FTX's $500m stake sale in AI startup delayed, hampering $2b deficit recovery",
    "FTX Freezes Sale of $500 Million Stake in AI Startup Anthropic",
    "FTX pauses sale of stake in AI firm Anthropic, once purchased for $500m",
    "FTX Holds Off On Selling Its Stake In AI Startup Anthropic",
    "FTX suspends $500M sale of stake in AI firm Anthropic: Report",
    "FTX Pauses Sale of $500M Stake in AI Firm Anthropic: Bloomberg",
    "Kroll Restructuring Administration",
    "FTX Sues Former Compliance Chief Who Allegedly Silenced Whistleblowers",
    "Senior Attorney Helped FTX Founder Misuse Customer Funds, Report Says",
    "FTX management details new allegations on misuse of customer funds",
    "FTX Senior Attorney Helped Cover Up Misuse of Funds",
    "FTX sues Dan Friedberg alleging he used ‘hush money’ to silence whistleblowers",
    "@joshsternberg.bsky.social",
    "Did Google mislead advertisers about TrueView skippable in-stream ads for the past three years?",
    "Google Is Placing Ads for Top Brands on Spammy, Chatbot-Generated Blogs",
    "Google may have misled dozens of advertisers and violated its own guidelines - report",
    "Google lied about ad metrics: report",
    "Transparency and brand safety on Google Video Partners",
    "Google fires back after study claims “80%” of video ads violate its own terms of service",
    "Google In Hot Water: Billions At Stake As YouTube Ads Found To Violate Terms Of Service",
    "Google Misled Advertisers About Video Ads, Study Says",
    "This is amazing contextual advertising.  —  https://www.wsj.com/...  [image]",
    "omg this is such a good read if you have ever been an ad or media nerd https://adalytics.io/...",
    "holy fudge I did NOT KNOW YouTube does audience extension campaigns https://www.wsj.com/...",
    "This report if confirmed impacts the entire media industry. https://www.wsj.com/...",
    "WSJ News Exclusive |  Google Violated Its Standards in Ad Deals, Research Finds",
    "China's AI firms might further lose chip access in new US ban",
    "These Stocks Are Moving the Most Today: Nvidia, AMD, AeroVironment, Micron, and More",
    "US weighs tougher restrictions on AI chip exports to China",
    "US considering new restrictions on AI chip exports to China: report",
    "U.S. considers curbs on AI chip exports to China",
    "Chinese A.I. stocks fall as U.S. reportedly weighs curbs on chip exports",
    "Biden may restrict AI chip exports to China, impact Nvidia",
    "European Markets Expected to Open Higher After Tentatively Breaking Losing Streak",
    "Asia Markets Mixed as Australia Inflation Slows and China Industrial Profits Sink",
    "Nvidia Drops on Report US Plans More AI Chip Curbs for China",
    "U.S. Mulls New Restrictions on AI Chip Exports to China",
    "US to impose new regulations limiting AI chip exports to China: report",
    "Yellen Plans July China Trip While US Preps Investment Curbs",
    "This is obviously why we need to build Skynet first. https://twitter.com/...",
    "@konstantin@digitalcourage …",
    "Why are Apple and WhatsApp unhappy with the UK's online safety bill?",
    "An encryption exodus looms over UK's Online Safety Bill",
    "Apple opposes UK's Online Safety Bill, citing risks to privacy and security",
    "Apple Warns the UK's Online Safety Bill Threatens Citizens' Privacy and Security",
    "Apple opposes UK bill that could mandate backdoor scanning in iMessage",
    "Apple says proposed UK law ‘poses a serious threat’ to end-to-end encryption",
    "Apple speaks out against bill that could mandate CSAM scanning in iMessage",
    "Apple Joins Opposition Against Message Scanning in Online Safety Bill",
    "Apple urges UK to rethink anti-encryption Online Safety Bill",
    "Apple officially opposes proposed UK law that would weaken iMessage encryption",
    "Apple Joins Opposition to U.K. ‘Online Safety Bill’",
    "@konstantin@digitalcourage.social",
    "Apple joins opposition to encrypted message app scanning",
    "Apple Joins Opposition in UK To Encrypted Message App Scanning",
    "@craigmaloney@octodon.social",
    "Microsoft wants to bring Windows 11 to the cloud for ALL users, including you",
    "Is Microsoft shoving Windows 11 cloud PC down our throats?",
    "Windows could soon live in the cloud, if Microsoft gets its way",
    "Windows 11 Cloud PC subscription is coming to consumers",
    "Microsoft Sees Cloud-Based Windows 11 as a Long-Term Goal",
    "Microsoft's Long-Term Vision: Windows Transition to Cloud-based Experience",
    "Microsoft Plots Cloud-Based Windows 11",
    "Microsoft wants to put Windows PCs fully in the cloud - but what will that mean for you?",
    "I wouldn't mind streaming Windows 11 from the cloud to my Vision Pro",
    "Microsoft is working on a full cloud-based Windows OS",
    "Microsoft Wants to Shoot Windows 11 Into the Cloud",
    "Windows 11's Potential Subscription-Based Cloud Future Revealed by FTC",
    "Microsoft's looking into offering a version of cloud-based Windows 365 for consumers",
    "Microsoft is planning to put Windows in the cloud for consumers",
    "Report: Microsoft Wants to Bring Windows 365 Cloud PCs to Consumers",
    "Microsoft Plans to Turn Windows into Cloud-Streamed Operating System",
    "Microsoft wants to move Windows fully to the cloud",
    "ChatGPT on iOS now comes with Bing built-in",
    "ChatGPT iOS app gets Bing integration to access data beyond its cutoff date",
    "ChatGPT iOS app now supports “Browse with Bing” feature",
    "ChatGPT on iOS adds support for Bing, but locks it behind a subscription",
    "OpenAI's ChatGPT iOS app can now browse the web",
    "OpenAI rolls out Browsing feature for ChatGPT app: Check who can use it",
    "Chat-GPT Could Be Changing The Way You Think, And You Might Not Even Realize It",
    "ChatGPT's iPhone app now has Bing built-in",
    "ChatGPT for iOS now lets paid subscribers use Bing right from the app",
    "China's Baidu Ernie Chatbot Update Outperforms OpenAI's ChatGPT on Key AI Tests",
    "Google DeepMind CEO takes aim at ChatGPT with next version of AI",
    "Google is no longer building its own augmented reality glasses",
    "Google killed its AR glasses to work on AR devices from Samsung, others",
    "Google shuts down its AR headset Project Iris: Here's what it plans to do next",
    "Report: Google killed Iris smart glasses, going all-in on Android OEM model for XR",
    "Google's next-gen AR glasses join the Google graveyard",
    "Report: Google canceled its AR Glasses hardware early this year",
    "Google kills off the latest iteration of its AR glasses",
    "Google has reportedly killed its Project Iris augmented reality glasses",
    "Google building Android XR software, killed Iris AR glasses: Report",
    "Looks like Google might have canceled its new AR glasses",
    "Google reportedly killed its AR glasses project",
    "[Rumor] Google Reportedly Killed Its AR Glasses Project",
    "Supreme Court of the United States",
    "Supreme Court Raises Bar on Prosecuting Online Stalkers",
    "US Supreme Court sides with man who sent female musician barrage of unwanted messages",
    "Miscreants leak texts and info siphoned by Android stalkerware app LetMeSpy",
    "Supreme Court says a conviction for online threats violated 1st Amendment",
    "The Supreme Court Made It Harder — Again — For Women to Get Justice",
    "Supreme Court Puts First Amendment Limits on Laws Banning Online Threats",
    "Supreme Court rules for online stalker convicted of making ‘true threats’",
    "Supreme Court makes it more difficult to convict someone of making a threat",
    "U.S. Supreme Court rejects Colorado's standard for criminal threats",
    "Influencers Gas Up Shein After Sketchy Factory Tour: No Slave Labor Here!",
    "Shein sent American influencers to China. Social media users are furious",
    "Shein invites influencers to China to showcase its ESG efforts, but backfires",
    "How Shein's influencer trip to a Chinese factory backfired",
    "Shein Leverages U.S. Influencer Culture To Shape Narrative About Fast Fashion—and China",
    "Shein exploited marginalized women for their influencer trip. It worked.",
    "What Are Social Media Influencers (and Why Does Everyone Want to Become One)",
    "They only invited people with zero critical thinking, eating this propaganda up! [video]",
    "You come to me, the day of my daughter's Shein influencer trip",
    "@tetherpoint@mastodon.social",
    "Has Apple Overshot the Market with the New Mac Pro?",
    "Mac Pro market even smaller than expected, as high-end pros choose 16-inch MBP",
    "Did Apple accidentally make Mac Pro unnecessary?",
    "M2 Ultra Mac Pro review shows Apple's powerhouse hasn't left the worst of the Intel era",
    "@macstories@mastodon.macstories.net",
    "Has Apple Overshot the Market with the New Mac Pro? https://www.macstories.net/...",
    "The Mac Pro's biggest problem is the MacBook",
    "Two major energy corporations added to growing MOVEit victim list",
    "Extortion Group Clop's MOVEit Attacks Hit Over 130 Victims",
    "Siemens Energy confirms data breach after MOVEit data-theft attack",
    "Schneider Electric Probing MOVEit Claim By Cybercrime Group",
    "Extortion Group Clop's MOVEit Attacks Hit 108 Victims",
    "UCLA, Siemens Energy latest MOVEit victims to confirm breaches",
    "UCLA, Siemens Among Latest Victims of Relentless MOVEit Attacks",
    "Casualties keep growing in this month's mass exploitation of MOVEit 0-day",
    "TikTok updates: Creative Challenge, Youth Council, Montana lawsuit...",
    "TikTok Is Funding Its Users' Suit Against Montana Ban",
    "TikTok Is Funding Montana Users' Lawsuit After Ban: Report",
    "After Montana banned TikTok, users sued.  TikTok is footing their bill",
    "EU a step closer to Data Act that will take on Big Tech",
    "EU reach data rule deal targeting Big Tech",
    "EU's Controversial Smart Contract Kill-Switch Rules Finalized by Negotiators",
    "Crypto: EU Moves Ahead With Disputed Smart Contract Kill-Switch",
    "EU countries agree on new ‘data bill’ to curb power of Big Tech companies",
    "Data act: Council and Parliament strike a deal on fair access to and use of data",
    "International Business Times",
    "Giving Teens and Parents More Ways to Manage Their Time on Our Apps",
    "Instagram tests feature to block explicit images in direct message requests",
    "Meta rolls out expansive new parental controls for Instagram and Messenger",
    "Instagram and Messenger get more parental supervision tools",
    "Facebook Lets Parents See Who Their Kids Are Talking to on Messenger",
    "Meta adds parental supervision tools to Facebook, Instagram",
    "New Supervision Tools  —  We want to make sure our apps are as supportive as possible for teens …",
    "Both TikTok and Meta introduce new parental controls",
    "Meta Rolls Out New Parental Supervision Tools Across Instagram, Facebook And Messenger",
    "Meta Announces New Features for Parental Control on Facebook, Instagram, Messenger",
    "Meta Announces New Teen Safety Tools, Including Updated Parental Oversight and Messaging Controls",
    "Meta is making it easier to manage your kids' Instagram and Messenger addictions",
    "Facebook Messenger launches “parental control” mode",
    "Messenger and Instagram get new tools for parental control",
    "Meta Introduces Parental Supervision Tools for Messenger",
    "What to Know About Meta's New Parental Supervision Tools for Instagram",
    "Meta beefs up protections for teens on Messenger and Instagram, as new laws loom",
    "Vital new parental controls are rolling out on Facebook, Instagram, and Messenger",
    "Meta Adds Parental Control Tools to Instagram and Facebook Messenger",
    "Meta Launches New Parental Controls on Messenger and Instagram",
    "Parents Gaining More Control Over How Teens Use Messenger and Instagram",
    "Meta announces several new privacy features, supervision tools for teens and parents",
    "Parents can now see more of what their kids are up to on Messenger and Instagram",
    "Meta rolls-out new parental controls for Facebook, Instagram",
    "Meta introduces new parental control across Instagram, Facebook, Messenger",
    "Facebook and Instagram with new parental tools to enhance teen safety",
    "Meta guardrails: More safeguards, monitoring tools for teens launch across social platforms",
    "Facebook Messenger parental controls expanded to teens; new TikTok half-measure",
    "Facebook adds parental control tools to Messenger",
    "Meta launches parental controls for Messenger. Here's how to use them.",
    "Personalized wealth management, built for tech people",
    "@overcastfm@mastodon.social",
    "@numbercrow@techhub.social",
    "So Long, Stitcher: SiriusXM to Shut Down Podcast App, Website",
    "Stitcher podcast app is shutting down in August after 15 years",
    "STITCHER FAREWELL … Need more help?",
    "Bad news for all Stitcher followers: the podcast app is shutting down",
    "SiriusXM to Shut Down Stitcher App in Revamp of Its Podcast Business",
    "SiriusXM is shutting down its Stitcher podcast app to emphasize its flagship app",
    "SiriusXM to Shut Down Stitcher Podcast App",
    "Popular podcast app Stitcher is shutting down August 29th",
    "Why Brad Pitt's Plan B is looking to do audio as others pull out",
    "Podcast app Stitcher is shutting down in August",
    "One of the biggest podcast apps is shutting down in August",
    "Patriarchy Hurts All Of Us — Including Men",
    "@Techmeme Say it with me: enshittification.",
    "AI could help pick Major League Baseball's next big star",
    "Vote now: Google kills off its AR glasses (again). Is this the right decision?",
    "Augmedics gets $82.5 million in funding round for AR spinal surgery tool",
    "Augmedics Raises $82.5 Million to Boost Adoption of Augmented Reality Spine Surgery",
    "Google Kills Augmented Reality Glasses Project",
    "Augmedics closes $82.5M Series D, marks 4,000 U.S. patients treated with Xvision",
    "Augmedics raises $82.5 million to accelerate adoption of augmented reality spine surgery",
    "Augmedics Raises $82.5M for Augmented Reality Spine Surgery Platform",
    "Augmedics Raises $82.5M in Series D Funding",
    "Augmedics raises $82.5 million amid Series D decline",
    "Free compensation benchmarking data from 3,000 startups",
    "5 common data and analytics pitfalls businesses should avoid",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "Replit: From idea to software, fast.",
    "Character.AI: Build something smarter than you.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Lightmatter: Next-gen computing built for AI.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/27 - What If OpenAI Did Its Own Copilot?",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Companies with the most PoS agents in Nigeria - Report",
    "Roblox Trying To Describe Adult Poop Is Very Funny",
    "What Roblox wants to build next with CEO David Baszucki | Decoder",
    "Announcing our $58M funding to Build Generative Models and Advance AI Research",
    "Singaporean ex-Googler's startup raises $58m for enterprise AI endeavor",
    "Generative AI startup Reka emerges from stealth with $58 million in its pocket",
    "AI model startup Reka raises $50 million led by DST Global Partners",
    "@ravirockks@infosec.exchange",
    "Anzu completes $48 million Series B for in-game advertising solution",
    "Anzu Completes $48 Million Series B Funding Round Led by Emmis to Accelerate In-Game Advertising",
    "Deal of the day: SanDisk 64GB Extreme PRO CFexpress Type B memory card now only $60",
    "In-game Ads solution Anzu raises $48M in Series B funding",
    "More Ways for Creators to Collaborate with Brands: TikTok Creative Challenge",
    "TikTok connects brands to user-generated ads with new feature",
    "TikTok's new feature asks creators to make branded videos for a chance at ad money",
    "TikTok Launches ‘Creative Challenge’ to Provide More Income Opportunities for Creators",
    "TikTok rolled out a new way for creators to make money - but there's a catch",
    "TikTok's new ‘Creative Challenge’ ad program is good for brands but terrible for creators",
    "Personal Data About Paid U.S. TikTok Creators Is Probably Stored in China",
    "Introducing Unity Muse and Unity Sentis, AI-powered creativity",
    "Gaming industry puts generative AI to the test",
    "Unity Announces Big ‘AI’ Plans, Developers Have Concerns",
    "Unity Launches New AI Marketplace as Premier Destination for AI Solutions",
    "Unity releases deeply upsetting trailer for its new AI development tools",
    "Why Unity is using its new AI platforms to become more accessible to brands and agencies",
    "Announcing Our $20M Series-A Funding",
    "Faros AI raises $20M to make software engineering teams smarter",
    "Faros AI raises $20M to bring AI insights to software engineering",
    "Betr Raises $35M in Series A2 Funding At $300M Pre Money Valuation",
    "BETR RAISES $35M IN SERIES A2 AT $300M PRE-MONEY VALUATION",
    "To improve the sports-betting experience, Betr lands a $35m Series A2",
    "Jake Paul's Betr Raises $35M at $300M Value Led by Roger Ehrenberg",
    "Three Arrows Capital Liquidators Seek $1.3B From Bankrupt Hedge Fund's Founders: Bloomberg",
    "Bankrupt Three Arrows' liquidators seek $1.3 billion from fund's founders",
    "3AC liquidators seek $1.3 billion from Zhu, Davies: Bloomberg",
    "Bankrupt Crypto Hedge Fund Three Arrows Capital Pursued by Liquidators for $1,300,000,000: Report",
    "Three Arrows Capital Founders In Legal Battle Over $1.3 Billion In Funds",
    "Three Arrows Capital Liquidators Seek a Staggering $1.3B from Founders of Insolvent Hedge Fund",
    "3AC liquidators look to recoup $1.3B from founders",
    "@SloanStudio@mastodon.social",
    "@danielfgom@social.vivaldi.net",
    "What is the Difference Between VR, AR, MR and XR?",
    "Creating fully immersive experiences in your app",
    "The integration of virtual reality technology in online crypto casinos",
    "Vision Pro may stop working entirely when moving too fast",
    "Why the Meta Quest 2 Is Better Than the Apple Vision Pro for Fitness",
    "Multiple new Vision Pro headsets are already being developed at Apple",
    "Meta launches Quest+ subscription for its VR headsets as Apple Vision Pro debut nears",
    "Apple Vision Pro Cinema Environments revealed — here's what we know",
    "So much for any New Yorkers having sufficient space in their apartment to use one [embedded post]",
    "@SloanStudio Pretty wild limitation considering the Oculus Quest is $400 and supports 50x50 ft.",
    "@SloanStudio I would suspect it is not a hardware limitation.  Then again, why do it otherwise?",
    "Possibly to limit the potential for Vision Pro fail videos ... https://twitter.com/...",
    "Vision Pro safe area limited to 10x10 feet for VR experiences",
    "EncroChat dismantling led to 6,558 arrests and the seizure of $979M in criminal funds",
    "EncroChat takedown led to 6,500 arrests and $979 million seized",
    "EncroChat Bust Leads to 6500 Arrests in Three Years",
    "Three years on, EncroChat cryptophone hack nets 6,500 arrests and seizures of €900m",
    "Cops' total pwnage of ‘secure’ EncroChat nets 6,500+ arrests, €740m in funds - so far",
    "EncroChat Disruption Leads to Arrest of Over 6,000 Suspects",
    "Encrypted phone service ‘Encrochat’ shutdown leads to 6,500 arrests - Europol",
    "Investigation Into Encrypted Phone Network Leads to 6,500 Arrests",
    "Seizure of EncroChat Enables Police Access to 115 Million Conversations",
    "EncroChat Bust Leads to 6,558 Criminals' Arrests and €900 Million Seizure",
    "EncroChat dismantling lead to 6500 arrests, EUR 900 million seized",
    "3-Year Probe Into Encrypted Phones Led To Seizure of Hundreds of Tons of Drugs, Prosecutors Say",
    "AI-focused data security firm Cyera bags £100m in Series B funding",
    "Data security startup Cyera lands a $100M investment",
    "With $160 million invested, Cyera is on track to become the enterprise data security platform",
    "Cyera Raises $100M to Bring Data Protection to Hybrid Cloud",
    "Our Continued Investment in Cyera: Filling the Data Gap in Today's Modern Security Stack",
    "Cyera Nabs $100M To Protect Data",
    "Cyera bags $100M to improve cloud data security with large language models",
    "Data Security Firm Cyera Attracts $100M Investment",
    "Cyera Raises $100M in Series B Funding",
    "Israeli data security co Cyera raises $100m",
    "@cawhitworth@mastodon.online",
    "Silicon Valley Is On Drugs",
    "Musk v. Zuckerberg and Silicon Valley's Dangerous Road",
    "Elon Musk reportedly microdoses ketamine to treat depression",
    "Elon Musk Touts Ketamine For Depression Following Report On His Use Of Drug",
    "Drugs have never seemed less cool.Do you want to party like a tech executive?",
    "FDA creates path for psychedelic drug trials",
    "Silicon Valley Is on Drugs",
    "Magic Mushrooms.  LSD.  Ketamine.  The Drugs That Power Silicon Valley."
]