[
    "Elon Musk Vs. Mark Zuckerberg In MMA Fight - How Will This Shake The Crypto, Metaverse Arena?",
    "Why in the world are Elon and Zuck planning to punch each other?",
    "Elon Musk vs. Mark Zuckerberg Cage Match Prompts Hypothetical Odds",
    "No Joke: Musk and Zuckerberg Really Want to Fight, Says UFC Boss",
    "Here's the real reason behind Elon Musk, Mark Zuckerberg cage fight",
    "@ianbetteridge@writing.exchange",
    "It's working, he's cool now https://twitter.com/...",
    "Truly, we live in the stupidest possible times. https://www.washingtonpost.com/ ...",
    "Feds seize notorious and shuttered hacking site BreachForums",
    "BreachForums seized by FBI three months after arrest of alleged admin",
    "Data Breach at New BreachForums: 4,000 members' data leaked",
    "Law enforcement seizes domains owned by “Pompompurin” and one currently owned by DataBreaches",
    "@tananarivedue.bsky.social",
    "Lol, jack wants to be the new w3 for social. This is hilarious at best. https://twitter.com/...",
    "Moderation in a public commons",
    "@Techmeme This company is a dumpster fire 🔥",
    "@lauren@mastodon.laurenweinstein.org",
    "@Techmeme Who in their right mind still uses LastPass in 2023?",
    "LastPass users furious after being locked out due to MFA resets",
    "Starfield exclusivity was the last straw for Microsoft, led to $7.5 billion ZeniMax buyout",
    "Here are some of the biggest revelations from the Microsoft vs FTC hearing",
    "Xbox Says That The Console War Is Just A Social Construct",
    "Microsoft Executive Vows to Keep ‘Call of Duty’ on Sony Consoles",
    "Day two of Microsoft's FTC trial: Court documents point to new Xbox in 2028",
    "Xbox FTC Trial Day 2: In Which the Head of Xbox Explains Mergers to the FTC",
    "FTC vs. Xbox: Sony ‘uses revenue’ from Microsoft's games to block games from coming to Xbox",
    "Microsoft says it looked at acquiring Zynga but opted to go bigger with Activision",
    "Phil Spencer says before Bethesda purchase, Microsoft heard Starfield could skip Xbox",
    "Microsoft Concedes Xbox Lost The Console Wars But Is It Gaming The FTC?",
    "Has Xbox lost the console wars?",
    "New Technologies and Jobs in Europe",
    "Who could have known?! https://twitter.com/...",
    "A cyber-focused candidate is running for president. Does he have a chance?",
    "Effective scheduling is key to workforce optimization",
    "@irwinfletcher.bsky.social",
    "@stephenjudkins.bsky.social",
    "@summeremacs@fashionsocial …",
    "Why Has Mastodon Adoption Stalled?",
    "messages on mastodon tend to be too elaborate.  as well as some very tone-deaf ui choices",
    "I can honestly say that I've had the exact opposite experience since I've migrated to Mastodon.",
    "Ya this is all about right https://blog.bloonface.com/...",
    "Thoughtful post on why Mastodon adoption may have slowed: https://blog.bloonface.com/...",
    "@wezm@mastodon.decentralised.social",
    "This is a good read: https://blog.bloonface.com/...",
    "@summeremacs@fashionsocial.host",
    "It didn't fail, it was impossible, the wrong idea. more later... https://blog.bloonface.com/...",
    "7 months later and about 25% have dropped off it seems https://blog.bloonface.com/... [image]",
    "The Flex Report (June 2023)",
    "Flex Report: Tech Industry Deep Dive",
    "‘The war on remote work is not over.’ But one group in particular is heading back to the office.",
    "Study: Small Companies Are More Flexible with Hybrid Work",
    "IBM Is in Talks to Buy Apptio for as Much as $5 Billion",
    "IBM nears deal to buy software company Apptio for $5 billion: WSJ",
    "IBM nears $5 billion deal for software provider Apptio: Report",
    "Truly the sign of a great business whose best days are ahead of it. https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Airtable: What will you make?",
    "Adobe: Let’s create experiences that matter.",
    "Clear Street: Today's financial infrastructure.",
    "Replit: From idea to software, fast.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Discord: Building something you actually use.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "(Portfolio Profile) The Player's Lounge",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Amazon to invest $15 billion more in India, says CEO Andy Jassy",
    "Amazon commits to $15 billion India investment, says Chief Executive Andy Jassy",
    "Amazon to take its India investment to $26 billion by 2030",
    "What Amazon, Google, And Microsoft Announced After PM's ‘Hi-Tech Handshake’",
    "Amazon CEO Andy Jassy says ready to invest $15 billion more in India",
    "Modi in US: Amazon CEO Andy Jassy commits to $15 billion investment in India",
    "Amazon to invest $15b more in India",
    "Amazon Plans To Invest Another $15 Billion in India By 2030",
    "Meta CEO Mark Zuckerberg and OpenAI CEO Sam Altman support EU AI Act",
    "EU welcomes Meta plans for tough content rules",
    "Meta agrees to July ‘stress test’ on new EU content rules",
    "AI chip giant Nvidia ‘extremely likely’ to invest in Europe, says CEO Jensen Huang",
    "EU, Meta agree to July stress test on EU online content rules",
    "EU official visits Twitter headquarters to ‘stress test’ its ability to handle content moderation",
    "Twitter is willing to comply with EU's Digital Services Act, says Breton",
    "EU warns Twitter to beef up content moderation as new rules loom",
    "Online games will appear on YouTube: Google is testing it right now",
    "YouTube is planning to expand into online gaming with ‘Playables’: Report",
    "YouTube could host mobile and desktop video games",
    "Just like nobody asked for, YouTube is reportedly testing in-app and in-site gaming",
    "YouTube is reportedly testing online games for mobile and desktop",
    "Google is reportedly bringing instantly playable online games to YouTube",
    "YouTube explores online gaming for its platform",
    "YouTube is testing an online-games offering",
    "youtube is testing an online gaming product, internally called “playables” https://www.wsj.com/...",
    "WSJ News Exclusive |  Google's YouTube Is Testing an Online-Games Offering",
    "YouTube integrates AI-powered dubbing tool",
    "Aloud - dubbing for everyone",
    "YouTube's New Aloud AI Tool Will Dub Your Videos Into Other Languages",
    "YouTube is testing an AI-powered dub tool to translate creators' videos",
    "YouTube is getting a powerful AI dubbing tool — here's how it works",
    "YouTube's new tool can automatically dub videos in other languages",
    "YouTube video translation is getting an AI-powered dubbing tool upgrade",
    "YouTube is testing an AI voice-dubbing feature for creators, and it's incredibly fast",
    "You may soon listen to YouTube videos in any language thanks to AI",
    "YouTube could soon automatically dub videos using AI",
    "YouTube to boost AI-generated foreign language dubs",
    "YouTube Integrates AI-Powered Dubbing Service",
    "How to dub YouTube videos with AI-powered Aloud tool",
    "YouTube will soon be introducing its new AI-powered dubbing tool",
    "YouTube Is Adding AI-Powered Dubbing",
    "ICYMI: Twitch Says Competition Will Make Us Stronger; VidCon Recap Day One",
    "YouTube adding AI dub technology to translate videos for creators",
    "YouTube AI Dubbing: Overcoming Language Barriers",
    "FTX Sues to Reclaim $700M Bankman-Fried Allegedly Spent on Celebrity Connections",
    "New York Times Reveals an SBF-DeSantis connection",
    "SBF denied access to FTX's former law firm documents",
    "FTX sues ex-Clinton aide's investment firm for $700 million",
    "FTX Strikes Back: Sues Ex-Clinton Aide's Investment Firm For $700 Million",
    "FTX files suit against SBF's old pals to attempt $700M clawback",
    "FTX files complaint to retrieve $700M from “super-networker” Bankman-Fried courted for connections",
    "FTX Attempts Clawback of $700M Allegedly Spent After A Networking Party",
    "FTX files $700m lawsuit against investment firm tied to Hillary Clinton aide",
    "Alameda seeks to claw back $700 million SBF paid ‘super networkers’",
    "Apple set to launch Apple Pay and a credit card in India - see their benefits",
    "Apple to launch credit card in India, will also introduce Apple Pay: Report",
    "Apple restarts talks for Apple Pay launch in India",
    "Apple Sets Sights on Indian Credit Card Market in Partnership with HDFC Bank",
    "Apple Reportedly in Discussions With Banks to Launch Apple Card in India",
    "Apple set to launch its credit card in India: Report",
    "Apple to launch credit card in India, in talks with NPCI for Apple Pay",
    "Apple Is Planning To Launch Its Credit Card In India: Report",
    "Apple Pay May Finally Come to India",
    "Apple explores launching Apple Card in India",
    "Apple Pay and US-exclusive Apple Card could expand to India",
    "Apple looks to launch its credit card in India, taps HDFC Bank for partnership",
    "Apple in early talks with banks to launch Apple Card and Apple Pay in India",
    "Apple is reportedly preparing to launch Apple Pay in India",
    "Apple reportedly discussing Apple Card launch in India",
    "Apple Card may arrive in India soon in partnership with HDFC Bank",
    "Apple wants to rival Samsung Pay in India",
    "Apple Card may launch next in India",
    "Apple Card could expand to India, four years after US rollout",
    "Apple Card global rollout discussions continue, but roadblocks along the way",
    "Apple Card will launch in India next, report claims",
    "Apple in talks to launch Apple Pay and Apple Card in India",
    "Apple reportedly in talks to launch its payment service Apple Pay in India",
    "Apple looking at rolling out credit card in India, may tie up with HDFC Bank: Report",
    "UPI to account for 90% of retail digital transactions in next 5 years, says RBI bulletin",
    "Apple Card and Apple Pay could soon launch in India",
    "Apple In Talks With HDFC Bank To Offer Credit Cards In India",
    "🚨🚨 Scoop: Apple looks to launch its credit card in India, taps HDFC Bank for partnership",
    "Apple Reportedly in Discussions with Banks to Launch Apple Card in India"
]