[
    "United States District Court, Northern District of California",
    "FTC Will Seek to Keep Microsoft From Closing Activision Deal",
    "FTC Seeks Injunction to Stop Microsoft From Closing Activision Deal",
    "Federal Trade Commission v. Microsoft Corp. and Activision Blizzard, Inc.",
    "FTC to seek federal court order temporarily blocking Microsoft-Activision deal",
    "US FTC seeks court order to block Microsoft acquisition of Activision -source",
    "FTC asks federal judge to block Microsoft's $69 billion Activision deal",
    "FTC Files Injunction to Block Microsoft's Activision Deal: What to Know",
    "US regulators move to block Microsoft's acquisition of Activision Blizzard",
    "FTC Reportedly Plans to File an Injunction Against Microsoft's Acquisition of Activision Blizzard",
    "FTC Officially Moves To Block Microsoft's Activision Blizzard Acquisition",
    "FTC to Sue Microsoft to Block $69 Billion Activision Deal: Report",
    "FTC files injunction to temporarily block Microsoft's Activision Blizzard deal",
    "The FTC Is Reportedly Filing To Block Microsoft's Activision Blizzard Acquisition",
    "FTC Sues to Block Massive Tech Deal",
    "FTC asks US court to block Microsoft-Activision Blizzard deal",
    "The FTC doubles down on its opposition to Microsoft acquiring Activision with a new injunction",
    "Microsoft Welcomes FTC's Injunction on Xbox's Activision Blizzard Buyout",
    "Report: FTC seeking injunction to block Microsoft's Activision Blizzard acquisition",
    "FTC files injunction to block Microsoft's Activision Blizzard acquisition",
    "FTC reportedly seeks injunction to stop Microsoft's Activision Blizzard deal",
    "FTC asks judge to put a stop to Microsoft-Activision deal immediately",
    "The FTC May File an Injunction to Block Microsoft's Activision Blizzard Purchase",
    "FTC to Seek Injunction Blocking Microsoft Purchase of Activision-Blizzard",
    "FTC files lawsuit to block Microsoft deal to buy Activision Blizzard",
    "FTC seeks injunction to block $68.7B Microsoft acquisition of Activision Blizzard",
    "The FTC Is Trying To Stop The Microsoft, Activision Blizzard Deal Again",
    "FTC files to block Microsoft's $69B Activision Blizzard acquisition [Updated]",
    "FTC files for an injunction against Microsoft's purchase of Activision Blizzard [Update]",
    "FTC Files Temporary Restraining Order and Preliminary Injunction Against Microsoft",
    "Microsoft Met With Another Roadblock in Activision Blizzard Acquisition",
    "The FTC is reportedly filing an injunction against the Xbox-Activision deal",
    "FTC to file injunction blocking Microsoft, Activision Blizzard transaction",
    "FTC Moves to Block Microsoft's Activision Blizzard Deal",
    "FTC aiming to block Microsoft's Activision Blizzard acquisition with injunction",
    "FTC To Seek Injunction Halting Microsoft-Activision Deal, And The Xbox Company Is Happy About It",
    "FTC files injunction to block Microsoft's purchase of Activision Blizzard",
    "FTC expected to block Microsoft's $69B purchase of Activision Blizzard: report",
    "The FTC is filing an injunction to block Microsoft's Activision acquisition",
    "Report: FTC to file injunction to block Microsoft-Activision merger",
    "The Federal Trade Commission does not seem to really like Trade. [image]",
    "The FTC can change the venue, but not the facts. https://twitter.com/...",
    "FTC Plans to Seek a Restraining Order to Stop Microsoft, Activision Deal",
    "FTC to file injunction seeking to block Microsoft's acquisition of Activision Blizzard",
    "@rodhilton@mastodon.social",
    "@ericleamen@mastodon.social",
    "@codinghorror@infosec.exchange",
    "API pricing protests caused Reddit to crash for 3 hours",
    "Reddit sees more than 6,000 communities ‘go dark’ in protest over API changes",
    "Reddit communities go dark in protest at changes",
    "The Why of Reddit Protests",
    "Reddit says protesting communities crashed the site",
    "Reddit Revolt, Apollo and Reddit's Changes, Complement Complaints",
    "Reddit communities to ‘go dark’ in protest over third-party app charges",
    "Reddit Blackout Begins as Forums Protest Charges for Developers",
    "Apple Subreddit Goes Dark in Protest of Reddit's API Pricing Changes",
    "Reddit's massive ‘blackout’ protest, explained",
    "Thousands of Reddit communities go dark to protest company's controversial new policy",
    "Over 7k Subreddits Go Private in Protest Over API Pricing Increase",
    "Subreddits Go Dark As Reddit Power Users Protest API Changes",
    "Reddit Crashed Because Too Many Users Are Protesting Site Changes",
    "Reddit blackout: Thousands of subreddits go dark as user protest begins",
    "Reddit's Crypto Communities Go Dark In Support of Protest Against API Changes",
    "Reddit faces mass protest over its API changes",
    "Apollo To Shut Down June 30th, Leading Many of the Largest Subreddits to Stage a Blackout",
    "Reddit's Site-Wide Protests Resulted In A Major Outage",
    "Reddit Communities Go Dark in Protest Against CEO and Developer Fees",
    "Reddit Goes Down As Communities Protest Wildly Unpopular Changes [UPDATE]",
    "48-hour Reddit user blackout kicks off, affecting 8K subreddits",
    "Reddit Communities Go Private in Protest Over Policy Adjustments",
    "Over 2.5B Reddit users flee to protest API changes",
    "It Sounds Like The Widespread Reddit Blackout Has Crashed The Overall Site, Too",
    "Reddit went down amid blackout protest over company's new policy",
    "Reddit down amid major protest",
    "Is Reddit Down? How To Check Server Status",
    "Reddit blackout: What, why and how it is impacting users",
    "Reddit Blackout darkens popular Windows and Microsoft subreddits",
    "@viticci@mastodon.macstories.net",
    "@mainframed767@infosec.exchange",
    "According to https://reddark.untone.uk/, 92.6% (7234/7806) of subreddits have gone private.",
    "Reddit is having server issues right now on top of the subreddit blackout. What a dumpster fire.",
    "the ongoing Reddit drama is once again a reminder that adtech is a horrible business model",
    "The Reddit strike has begun, and there's a great site to track it. https://reddark.untone.uk/",
    "Reddit crashed because of the growing subreddit blackout",
    "Why The Blackout's Happening- From The Beginning",
    "Reddit's users and moderators are pissed at its CEO",
    "Reddit's users and moderators are revolting against its CEO",
    "Reddit is Crashing Because of the Growing Subreddit Blackout",
    "Office of the Director of National Intelligence",
    "U.S. Spy Agencies Buy Vast Quantities of Americans' Personal Data, U.S. Says",
    "The U.S. Is Openly Stockpiling Dirt on All Its Citizens Thanks to Commercial Data Brokers",
    "ODNI Declassified Report on CAI",
    "The US government is buying troves of data about Americans",
    "Read the new Twitter CEO's first email to employees",
    "Yaccarino: Twitter to be ‘most accurate real-time info source’",
    "Twitter's new CEO has shared her first email to employees",
    "Twitter's New CEO Makes It Clear: This Is Elon's Ship, She's Just Running It,",
    "Twitter Sends First Comms Email Since Takeover",
    "Twitter's new CEO wants to turn it into the 'world's most accurate real-time information source'",
    "Elon Musk Successor Reveals Real Reason She Chose Twitter",
    "Twitter CEO Linda Yaccarino echoes Musk in emphasizing freedom of speech in debut tweet thread",
    "Twitter's new CEO just sent her first email to employees, then posted it on Twitter",
    "excruitiatingly hollowed words.  the glass cliff is real.",
    "Hello Twitter. People keep asking me: Why Twitter? So, I'll tell you. 👇",
    "Fire your ghostwriter, Linda https://twitter.com/...",
    "Good luck but extremely skeptical it'll go as she envisions https://www.theverge.com/...",
    "Has she told Elmo this? https://twitter.com/...",
    "@davidgerard@circumstances.run",
    "Emmer, Davidson Introduce ‘SEC Stabilization Act’ to Remove Chair Gary Gensler",
    "Crypto-Friendly Congressmen Draft Bill to Reform SEC, Fire Gary Gensler",
    "Maybe Coinbase Should Never Have Gone Public",
    "US Congressman Files Legislation to Fire SEC Chair Gary Gensler",
    "The SEC has spoken: The future of finance is not in America",
    "Fire Gary Gensler: Lawmaker Takes Stand Against SEC Chairman's Crypto Agenda",
    "Pro-Crypto Lawmakers Officially Introduce Legislation To Oust SEC Chair, Gary Gensler",
    "Coinbase Is the Latest Target of the SEC's Crypto Crackdown—How U.S. Investors May Be Affected",
    "“But the SEC let us go public” and other flawed arguments in Coinbase's defense",
    "Apple Mac Studio (M2 Ultra, 2023) Review",
    "M2 Ultra Mac Studio review: Top of the line",
    "Apple Mac Studio review (M2 Ultra, 2023): A better Mac for pros",
    "Apple Mac Studio (M2 Max) review: Re-filling the need for speed",
    "Apple M2 Ultra Mac Studio: Same shell, more firepower",
    "M2 Ultra Mac Studio! IT'S TOO GOOD.. 🤣🤯",
    "Apple Mac Studio 2023 Review: Still the Creative Choice for Mac",
    "Mac Studio Review: M2 Ultra Powers a Small Workstation Wonder",
    "Apple's Mac studio just got an upgrade, but does it beat last year's version?",
    "M2 Mac Studio Review: This is the New Pro Mac",
    "Apple Mac Studio (M2 Max/Ultra, 2023) initial review: Small but mighty",
    "New 2023 Mac Studio Review Roundup [Video]",
    "Mac Studio M2 Ultra reviews: ‘Champion’ desktop despite Apple silicon Mac Pro, cooling fixed",
    "M2 Ultra Mac Studio review round-up - who needs a Mac Pro?",
    "Mac Studio review roundup: The Pro's choice",
    "Mac Studio review roundup: M2 Max and Ultra chips offer blazing-fast performance",
    "Mac Studio M2 Ultra Review - It DESTROYS my MacBook Pro! 🔥",
    "Apple Mac Studio M2 (2023) review",
    "2023 Mac Studio Reviews: Faster M2 Ultra Chip and 8K Display Support",
    "Apple Mac Studio M2 review: More power, same small box",
    "Apple M2 Ultra Mac Studio Review: It Shreds Through Photo and Video Edits",
    "M2 Ultra Mac Studio review: Who needs a Mac Pro, anyway?",
    "Breakup of Google Ad-Tech Business Now on Table in Europe, Too",
    "EU regulators may demand Google to sell part of adtech business",
    "EU weighs push to break up Google's ad-tech business: WSJ",
    "EU could demand Google break up ad business on antitrust grounds",
    "Google's ad tech dominance spurs more antitrust charges, report says",
    "Google Reportedly Will Face EU Antitrust Complaint Over Advertising Business",
    "EU regulators may demand Google to sell part of advertising-technology business: Report",
    "Google reportedly faces fresh EU antitrust charges over ad tech policies",
    "Google to get hit with EU antitrust charges",
    "Brace for it... https://twitter.com/...",
    "Google To Get Hit With EU Antitrust Charges for Ad Tech Abuses",
    "Breaking Points on YouTube",
    "EXCLUSIVE: Jack Dorsey On RFK Jr. Elon Musk, AI Regulation | Breaking Points",
    "India threatened to shut down Twitter and raid employees' homes, Jack Dorsey says",
    "Murder of democracy...: BJP, Congress spat over Twitter co-founder Jack Dorsey's claim. Watch",
    "NYC food delivery gig workers score a big minimum wage victory",
    "EU countries amend draft proposal on gig workers' rights, companies unhappy",
    "NYC Food Delivery Workers Secure Landmark Minimum Pay Rate",
    "NYC establishes first minimum wage for food delivery workers",
    "New York City Sets New Minimum Wage for Food Delivery Workers",
    "Uber, DoorDash, and Other Delivery Apps Will Now Have to Pay Workers a Minimum Wage in NYC",
    "These food delivery drivers will get the nation's first minimum wage for app-based workers",
    "NYC mandates minimum wage for app-based delivery workers",
    "New York City sets an $18 per hour minimum wage for food delivery workers",
    "New York City introduces new minimum pay rate for food delivery workers",
    "EU countries back overhaul of app workers' conditions",
    "Oracle Announces Fiscal 2023 Fourth Quarter and Fiscal Full Year Financial Results",
    "Oracle cloud revenue up 54 percent in fourth quarter",
    "Oracle 4Q Revenue, Net Income Beat Estimates — Earnings Review",
    "Oracle Reports Record Revenue of $50 Billion in FY23, Driven by Cloud Growth",
    "Oracle beats on top and bottom lines as cloud revenue jumps",
    "Oracle Pushes to Record High as AI-Frenzy Spurs Cloud Demand",
    "Oracle beats quarterly revenue estimates on cloud services demand",
    "Oracle Earnings Day Is Here. The Focus is on Cloud and AI.",
    "Seems nobody gets fired for buying Oracle. Sadly. https://twitter.com/...",
    "CloudZero raises $32M to nearly double size of team",
    "CloudZero Raises $32 Million To Transform Cloud Cost Management",
    "Cloud cost intelligence platform CloudZero raises $32M",
    "CloudZero Raises $32M in Series B Funding",
    "Google Search Generative Experience Gets Major Update to Improve Answers",
    "Google's SGE is a Plagiarism Engine That Could Break the Internet",
    "Amazon cracks down on fake reviews with AI",
    "Free compensation benchmarking data from 3,000 startups",
    "TCV Misses $5.5 Billion Fundraising Goal, Filings Show",
    "Expanding to the UK  —  Over the last year it has become clear that blockchains …",
    "Andreessen Horowitz (\"a16z\") Announces its First International Expansion to the United Kingdom",
    "A16z Chooses London as Destination for First Office Outside U.S.",
    "Andreessen Horowitz is opening its first international office in London",
    "Andreessen Horowitz Picks Crypto-Friendly London as International Base",
    "London crypto move is a sign of desperate times",
    "Andreessen to Open London Office for Crypto Startups Amid Scrutiny in U.S.",
    "a16z Expands To London Citing Favorable Crypto Regulatory Environment",
    "VC Firm Andreessen Horowitz Lured By UK's Crypto Regulatory Environment To Open London Office",
    "a16z Chooses the U.K. for First International Expansion",
    "A16z picks crypto-friendly London for first non-US base",
    "a16z leads $43m funding round for Gensyn AI",
    "Blockchain-based, AI compute protocol Gensyn raises $43 million in a16z-led round",
    "Andreessen Horowitz has announced plans for a London-based crypto accelerator",
    "a16z opening London crypto office citing ‘predictable’ environment",
    "Gensyn AI Secures $43M for Decentralized Machine Learning Led by a16z",
    "London lures a16z's first international office with ‘predictable’ crypto regs",
    "Andreessen Horowitz to open London crypto office in first push overseas",
    "Sunak Keeps Up Push To Make UK a Leader in AI Regulation",
    "Absolutely mad https://twitter.com/...",
    "it's called u16k now actually https://twitter.com/...",
    "This is a win for the UK. Congrats to @a16z and the UK Crypto community. https://twitter.com/...",
    "Are US politicians paying attention? https://twitter.com/...",
    "UK is having its “How can I help” Miami moment for crypto.... https://twitter.com/...",
    "BRITISH DYNAMISM https://twitter.com/... [image]",
    "Personalized wealth management, built for tech people",
    "Embrace the future of note-taking with Noteboard",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Character.AI: Build something smarter than you.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Replit: From idea to software, fast.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Techmeme: You might have heard of us...",
    "Mon. 06/12 - Why Your Favorite Subreddit Might Go Dark.",
    "Jun 14-17Viva TechnologyParis",
    "Jun 15-16TNW ConferenceAmsterdam",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Israeli drone maker Percepto raises $67 million after US regulatory nod",
    "Percepto raises $67M for industrial inspection drone technology platform",
    "Percepto Raises $67M in Series C Funding",
    "Percepto raises $67 million to meet demand for automated drones",
    "Robinhood Markets, Inc. Reports May 2023 Operating Data",
    "Robinhood reports mixed operating data for May 2023, user engagement down",
    "Robinhood's Crypto Trading Takes a Major Hit: May Volume Falls 68% to $2.1B",
    "Robinhood Reports 68 Percent Decline in Crypto Trading Compared to 2022",
    "Robinhood saw crypto trading volumes plummet 43% in May",
    "Salesforce pledges to invest $500M in generative AI startups",
    "Salesforce unveils AI Cloud offering, doubles fund for AI startups to $500 mln",
    "Salesforce launches AI Cloud to bring models to the enterprise",
    "Salesforce Launches AI Cloud to Transform Customer Relationship Management",
    "AAA's second-largest club taps Salesforce for generative AI push",
    "Salesforce Ups Generative AI Fund to $500M, Launches AI Cloud",
    "Salesforce to invest $500 million in generative AI startups; unveils new AI Cloud offering",
    "Salesforce Ventures Doubles Down on Generative AI Fund",
    "Salesforce Ventures Doubles Down On AI Investments",
    "Salesforce bets big on AI, with new products and increased investment",
    "Salesforce announces AI Cloud to empower enterprises with trusted generative AI",
    "Salesforce adds generative AI support across its application portfolio",
    "A Massive Vaccine Database Leak Exposes IDs of Millions of Indians",
    "India probes medical info ‘leak’ to Telegram",
    "No leak of users' data from CoWIN portal, adequate safety measures in place: Govt",
    "CoWin portal safe, reports of data breach ‘mischievous’, asserts govt",
    "CoWIN vaccination data out, Centre denies breach",
    "CERT-In looking into CoWIN data breach issue claims Centre",
    "Hint of past Covid vaccine data breach puts Narendra Modi government under the pump",
    "Government refutes claims of CoWIN data breach; CERT-In reviews matter",
    "CoWIN data ‘leak’: Why the govt statement raises more questions than it answers",
    "Government to probe alleged CoWin data leak, MoS Rajeev Chandrasekhar says not a direct breach",
    "India Investigates COVID Vaccine Data Breach",
    "Telegram bot leaks CoWIN data",
    "Marques Brownlee on YouTube",
    "15-inch MacBook Air review: Sometimes bigger is better",
    "First 15-inch MacBook Air and Apple Silicon Mac Pro orders now arriving to customers",
    "Apple 15-inch M2 MacBook Air review",
    "Apple MacBook Air 15-Inch Review: Finally, Big for Less",
    "The 15-inch MacBook Air offers superb battery life and portability at an aggressive price",
    "Apple MacBook Air 15-Inch Review",
    "15\" MacBook Air M2 Review: The Obvious Thing!",
    "15\" M2 MacBook Air Review - FINALLY!",
    "Apple MacBook Air 15\" Gives Consumers What They Want",
    "15-inch M2 MacBook Air reviews are out — 3 things people hated about it",
    "15-inch MacBook Air review: The best is still the best, just bigger",
    "MacBook Air 15-inch: At last, Apple fills a glaring gap in its line-up",
    "Review: Apple's 15-inch MacBook Air says what it is and is what it says",
    "Apple MacBook Air 15-inch (2023) review",
    "15-Inch MacBook Air Reviews: The Sweet Spot for Performance, Size, and Value",
    "15-inch M2 MacBook Air reviews: Big screen, bigger value",
    "15-inch MacBook Air review roundup: Big screen, big value",
    "15-inch MacBook Air review roundup: Killer for consumers",
    "Apple MacBook Air 15-inch review: Bigger screen is an absolute dream",
    "Apple 15-inch M2 MacBook Air Review Roundup [Video]",
    "Apple MacBook Air 15-inch review: A bigger screen makes a surprising difference",
    "15-inch MacBook Air review roundup: Here are the key takeaways",
    "15-inch M2 MacBook Air (2023) Unboxing & Comparison",
    "MacBook Air M2 15-inch review: the best laptop you can buy under €2,000",
    "15in MacBook Air review: Apple's best consumer laptop, just bigger",
    "MacBook Air 15-inch M2 review round-up - here's what reviewers think",
    "Evergreen summary of every new Apple product. HT @Techmeme [image]",
    "NEW VIDEO - 15\" M2 MacBook Air Review: The Obvious Thing! https://www.youtube.com/... [image]",
    "Simple but important chart https://twitter.com/...",
    "@mattburgess@infosec.exchange",
    "Nasdaq to Acquire Financial-Software Firm Adenza for $10.5 Billion",
    "Nasdaq to buy Adenza for $10.5bn in US exchange operator's biggest deal",
    "Nasdaq Inks Its Largest Acquisition Furthering CEO Adena Friedman's Tech Vision",
    "Thoma Bravo Hits Home Run With Adenza Deal",
    "Nasdaq to buy financial software firm Adenza for $10.5 bln",
    "Nasdaq buys financial software maker Adenza in $10.5B deal",
    "Hello, What? Nasdaq Pays $10B For Adenza",
    "Nasdaq Pays $10.5 Billion for Risk Management Firm Adenza",
    "Nasdaq buys fintech software Firm Adenza for $10.5 billion to accelerate growth",
    "Nasdaq to buy financial software company Adenza in $10.5 billion cash-and-stock deal",
    "Nasdaq to acquire financial services software company Adenza from Thoma Bravo for $10.5B",
    "Wow, 17x ARR Growing 18% at $590m ARR ... but ... Adjusted EBITDA of 58% https://twitter.com/...",
    "PM London Tech Week speech: 12 June 2023",
    "PM urges tech leaders to grasp generational opportunities and challenges of AI",
    "Richi Sunak's £100 Million Plan to Make the UK an AI Hub",
    "Sam Altman Is ‘Optimistic’ He Can Get the AI Laws He Wants",
    "OpenAI, DeepMind, and Anthropic to give UK early access to AI models for safety research",
    "Rishi Sunak's plans for AI - revealed | i Exclusive",
    "Rishi Sunak touts UK AI safety research at London Tech Week",
    "UK to get ‘early or priority access’ to AI models from Google and OpenAI",
    "UK government will get early access to OpenAI and Google's AI models for safety purposes",
    "Google, OpenAI will share AI models with the UK government",
    "AI could be used to provide ‘personalised learning’ to schoolchildren, Rishi Sunak says",
    "‘OpenAI, DeepMind have agreed to open up models to the UK government’",
    "Ex-Samsung Elec executive accused of stealing secrets for China chip factory",
    "Ex-Samsung exec indicted for stealing trade secrets to build copycat plant in China",
    "Former Samsung exec accused of stealing data to build copycat chip plant in China",
    "Ex-Samsung executive alleged to have stolen tech to recreate chip plant in China",
    "Ex-Samsung executive accused of audacious chip factory plan",
    "Ex-Samsung exec arrested for trying to steal a ‘complete copy’ of a factory.",
    "Ex-Samsung Executive Arrested for Stealing Company Secrets to Build Fabs in China",
    "Ex-Samsung exec charged with stealing trade secrets to create copycat chip factory in China",
    "Asia Markets Mostly Rise as U.S. Inflation Forecasts Fall, Nikkei to Reach New 2023-Highs",
    "Ex-Samsung executive faces trial for stealing chip secrets",
    "Former Samsung executive indicted for stealing chip tech",
    "Samsung Ex-Executive Arrested for Alleged Chip Tech Theft #1674",
    "Former Samsung Exec Indicted for Stealing Secrets for Chinese Chip Plant",
    "Reddit revolt puts CEO Steve Huffman in a tough position",
    "Former Samsung exec allegedly stole blueprints to build a factory a mile away",
    "Former Samsung exec charged with stealing trade secrets to build replica chip plant in China",
    "Ex-Samsung Executive Accused of Stealing Secrets for China Chip Factory",
    "Bethesda Softworks on YouTube",
    "Xbox execs explain why 2024 will be a strong year for the console",
    "Xbox's Bright Future, and How We'll Get There",
    "Starfield Direct - Gameplay Deep Dive",
    "Xbox Games Showcase 2023 and Starfield Direct Double Feature: Every Announcement and Reveal",
    "Microsoft Unveils Its Next Xbox Console Release With A $349 Retail Price",
    "Giant Bomb at Nite: Night 3",
    "Xbox boss Phil Spencer is ‘confident’ that the Activision Blizzard acquisition will go through",
    "Phil Spencer Gives Update On Activision Blizzard Acquisition Efforts",
    "Don't Expect an Xbox Series X Pro Console",
    "Microsoft unveils black 1TB Xbox Series S, doesn't see the need for mid-cycle console refresh",
    "Microsoft exec says Starfield has ‘the fewest bugs any Bethesda game ever shipped with’",
    "Why Microsoft Is Excited About the Future of Gaming on the Xbox",
    "Will There Be A New Xbox In 2023?  Don't Get Your Hopes Up  —  Microsoft is in no rush …",
    "Game Pass and Xbox are profitable, Phil Spencer reiterates",
    "Xbox says PC audience 'isn't a window, it's a market that deserves our games day 1'",
    "Microsoft's Phil Spencer Says No Urgency for Major Xbox Console Upgrade",
    "Microsoft's revamped Xbox Home UI is finally launching soon",
    "Don't expect a more powerful Xbox Series X anytime soon",
    "Xbox Isn't Currently Planning a Mid-Gen Console Upgrade",
    "Bethesda and NASA created a new punk genre just for Starfield",
    "Playing Xbox games on a Mac will soon be way easier",
    "Phil Spencer Says Don't Expect A New Xbox Anytime Soon",
    "Xbox Finally Flexes Some Muscle After Years Of Atrophy",
    "Phil Spencer Says Mid-gen Xbox Upgrade Doesn't “Feel an Imperative”",
    "Microsoft's PC Game Pass titles will start streaming on GeForce Now",
    "Microsoft Gaming CEO Phil Spencer doesn't see imperative for Xbox Series X|S hardware revision",
    "The biggest announcements from the Xbox Games Showcase 2023 and Starfield Direct",
    "Fallout 76 surpasses 15 million players as Atlantic City update announced",
    "Phil Spencer Confident There Are Solutions to Make Activision Blizzard Acquisition Go Through",
    "Microsoft Is Still ‘Very Committed’ To The Activision Blizzard Acquisition",
    "Watch 45 minutes of new Starfield gameplay",
    "Microsoft announces black Xbox Series S with 1TB of storage for $349",
    "AI is polluting the Internet, so one writer bought a physical encyclopedia set instead",
    "MusicGen Demo  —  MusicGen This is the demo for MusicGen, a simple and controllable model …",
    "Meta Releases New Generative AI Tool That Can Create Music from Text Prompts",
    "Meta's new music AI could change how you craft soundtracks and tunes",
    "Meta's MusicGen: A Leap Forward in AI-Generated Music",
    "Audiocraft  —  Audiocraft is a library for audio processing and generation with deep learning.",
    "Meta open sources an AI-powered music generator",
    "MusicGen: Simple and Controllable Music Generation",
    "MusicGen can be conditioned on a chromagram. https://twitter.com/...",
    "@_akhaliq That is by far some of the cleanest AI generated music I have ever seen (and heard😅)",
    "Take On Me - AI Cover #MusicGen [video]",
    "making foley percussion loops with musicgen [video]",
    "This new MusicGen model from Meta is seriously impressive! https://twitter.com/... [image]",
    "oh this is fun! https://twitter.com/...",
    "Meta's MusicGen is insanely good - this is the StableDiffusion moment for music: [video]",
    "Having lot's of fun with this, especially the melody conditioning feature. https://twitter.com/...",
    "Meta just released MusicGen"
]