[
    "Daniel Zhang to focus on Alibaba Cloud Intelligence Group",
    "Alibaba prepares for leadership shakeup as CEO moves to focus on cloud",
    "Daniel Zhang May Focus on Cloud and Step Down as CEO of Alibaba",
    "Alibaba co-founder Joe Tsai to take over as chairman from Daniel Zhang",
    "Tech giant Alibaba names new CEO and chairman amid China's economic slowdown",
    "Alibaba Says Its Chairman, Daniel Zhang, Will Leave Post in September",
    "Alibaba CEO to step down to focus on cloud business in surprise leadership reshuffle",
    "Alibaba Group Announces Chairman and CEO Succession Plan",
    "Crypto Proponent Joseph Tsai Becomes the New Chairman of Alibaba",
    "Alibaba Names Crypto-Friendly Joseph Tsai as New Chairman",
    "Crypto enthusiast Tsai to steer Alibaba",
    "Alibaba's Crypto Friendly Joseph Tsai Set to Become Chairman",
    "Chinese e-commerce giant Alibaba names new CEO, chairman in major management reshuffle",
    "Meet the new CEO of Alibaba",
    "Alibaba CEO and chairman steps down to focus on cloud business",
    "Alibaba's Zhang to step down as CEO, chairman amid business shakeup",
    "Alibaba's Daniel Zhang to step down as group chairman and CEO",
    "Alibaba Group Replaces CEO and Chair Daniel Zhang",
    "Alibaba Says Chairman and CEO Daniel Zhang Will Be Replaced",
    "Alibaba Group says Eddie Wu to succeed Daniel Zhang as CEO",
    "Alibaba names new chairman and CEO in major shakeup",
    "Alibaba's New Chairman ‘Likes’ Crypto",
    "Alibaba Group In Succession Shake-up: Joe Tsai To Become Chairman; Eddie Wu Appointed CEO",
    "Alibaba CEO Daniel Zhang steps down as Eddie Wu takes charge",
    "Daniel Zhang steps down amid Alibaba's major organizational shift",
    "Joe Tsai to Become Alibaba Group Chairman, Eddie Wu Appointed CEO",
    "Crypto curious Joseph Tsai to take over as chair at Alibaba",
    "Chinese e-commerce giant Alibaba announces new CEO and chairman in major management reshuffle",
    "Live news: Donald Trump trial for mishandling classified documents to start in August",
    "Alibaba appoints Joseph Tsai as chairman and Eddie Wu as CEO in management change",
    "Alibaba CEO Daniel Zhang to pass the torch and focus on cloud",
    "Alibaba Stock Drops as CEO Daniel Zhang Steps Back",
    "Alibaba names new chairman and CEO in surprise shake-up",
    "Eddie Wu to succeed Daniel Zhang as Alibaba Group CEO in major executive reshuffle",
    "Alibaba replaces longtime chief and chair in management shake-up",
    "OpenAI Lobbying Efforts Could Weaken Europe's AI Act",
    "ChatGPT creator OpenAI asked EU for weaker AI regulations",
    "An OpenAI White Paper from 2022 reveals that it isn't as gung-ho about AI regulation as it claims",
    "Sam Altman talks a good game apparently",
    "Meet the new Big Tech boss...same as the old Big Tech boss 🇪🇺🤖🤷⤵️ https://twitter.com/...",
    "Powerful reminder that we simply cannot trust Big Tech. A must read. https://twitter.com/...",
    "Sam Altman is not your friend. https://time.com/...",
    "No way, who could have expected this? Great reporting Billy! https://twitter.com/...",
    "OpenAI Lobbied E.U. to Water Down AI Regulation",
    "OpenAI Lobbied the EU To Water Down AI Regulation",
    "@Imoptimal@mastodon.social",
    "@stringz@masto.nobigtech.es",
    "@jonas@social.jonaskoeritz.de",
    "@tillianisafox@vulpine.club",
    "@chrismessina@mastodon.xyz",
    "Defederating from Universeodon  —  We've decided to defederate from Universeodon.",
    "Facebook is launching an ActivityPub service to compete with Mastodon. …",
    "@EugeneTeplitsky@mastodon.social",
    "@Techmeme  —  Two options for fedi  —  1. It's will be Organic  —  2. It will be Meta",
    "Spotify Rumored to Launch HiFi Audio as Part of New Top-Tier ‘Supremium’ Subscription Plan",
    "Spotify's HiFi Plan May Finally Launch Later This Year",
    "Spotify may finally join Apple Music's lossless audio party two years late",
    "Spotify Might Finally Get HiFi Audio This Year—If You're Willing to Pay a ‘Subpremium’",
    "Spotify's long-anticipated HiFi tier might require a more expensive subscription",
    "Spotify may finally be ready to debut a premium HiFi audio tier",
    "Spotify is finally getting this Apple Music feature, but it's going to charge extra",
    "Spotify is rumored to launch its more expensive HiFi audio streaming plan later this year",
    "Spotify may charge extra for HiFi ‘lossless’ audio streaming",
    "Spotify HiFi may finally be coming with more expensive subscription plan",
    "Spotify reportedly readying new ‘Supremium’ tier with HiFi audio and more",
    "Thank god https://twitter.com/...",
    "Apple expands Self Service Repair and updates System Configuration process",
    "Apple's Self Service Repair program updates make it easier for DIY fixers",
    "Apple just fixed the most annoying part of its Self Service Repair program",
    "iPhone 14 and M2 Macs get added to Apple's Self Service Repair program",
    "Apple expands Self Service Repair with iPhone 14, M2 Macs, system config changes, more",
    "Apple expands Self Service Repair to M2 Macs and iPhone 14",
    "Apple adds the iPhone 14 and new Macs to its Self Service Repair Program",
    "Apple adds iPhone 14 lineup and more Macs to its Self Service Repair program",
    "iPhone 14 now supports Apple Self Service Repair along with M2 MacBook Air and Pro",
    "Apple Broadens DIY Repair Program and Enhances System Configuration Tool",
    "Fixing your iPhone 14 and 2022 MacBook models just got easier",
    "Apple expands Self Service Repair to include new iPhone and MacBook models",
    "Apple Expanding Self-Service Repair Program To iPhone 14 Lineup and More Macs",
    "Apple Expanding Self-Service Repair Program to iPhone 14 Lineup and More Macs",
    "New Privacy Features: Silence Unknown Callers and Privacy Checkup",
    "WhatsApp is finally bringing you relief from spam callers",
    "WhatsApp Boosts Your Privacy: How to Silence Unknown Callers",
    "WhatsApp can now silence calls from unknown numbers",
    "Big relief from spam calls on WhatsApp! App will now silence calls from unknown numbers",
    "This new Whatsapp feature allows you auto-silence calls from unknown numbers",
    "WhatsApp gets a long-awaited protection feature",
    "WhatsApp lets you cast unknown callers back into the fiery chasm from whence they came",
    "WhatsApp's newest feature will finally let me ignore people with ease",
    "WhatsApp now allows users to silence unknown callers",
    "WhatsApp just got a huge free upgrade, and it's a game changer",
    "WhatsApp is borrowing one of the iPhone's best privacy features",
    "WhatsApp gains the ability to silence unknown callers automatically",
    "WhatsApp update adds option to automatically silence unknown callers",
    "Silence unknown callers on WhatsApp with the last update",
    "Latest WhatsApp Update Will Help You Avoid Spam Callers with New Privacy Features",
    "WhatsApp announced silence unknown callers feature and privacy checkup",
    "WhatsApp can now automatically silence unknown callers",
    "WhatsApp announces much-needed feature ‘Silence Unknown Callers’; check how it works",
    "WhatsApp's new feature lets you silence incoming calls from unknown callers",
    "WhatsApp will now let you silence incoming calls from unknown callers: How it works",
    "WhatsApp lets you silence unknown callers on the app",
    "New WhatsApp update will help keep spam calls out of sight",
    "Whatsapp rolls out Call Silencing to combat spam calls in India",
    "WhatsApp is now allowing users to automatically silence pesky spam calls",
    "Advertisers are returning to Twitter after Linda Yaccarino calmed fears over content moderation. …",
    "Twitter looks to reassure anxious advertisers at Cannes",
    "Cannes Lions: Global Fandoms Are Finally Within Reach — It's on Every Business to Seize Them",
    "Cannes Briefing: Twitter's absence at Cannes makes space for competitors",
    "Elon Musk wants to launch a Twitter video app for smart TVs to revive falling ad sales",
    "Charles Schwab, Citadel-backed crypto exchange goes live today: WSJ",
    "Citadel Securities, Fidelity, Backed Crypto Exchange Makes Slow Start",
    "Breaking: EDX Markets Backed By Fidelity, Citadel, Schwab Starts Crypto Exchange Services",
    "An institutional crypto exchange backed by Fidelity, Schwab, and Citadel launches today",
    "“they blow up FTX” https://twitter.com/...",
    "Crypto Exchange Backed by Citadel Securities, Fidelity, Schwab Starts Operations",
    "Adobe's $20 bln deal to acquire Figma under threat from EU regulators - FT",
    "EU regulators to probe Adobe's $20b Figma acquisition",
    "Orange Faces EU Warning Shot Over $19 Billion Masmovil Deal",
    "Adobe's $20B deal to acquire Figma under threat from EU investigation",
    "Binance to Incorporate BTC Lightning Network for Seamless Withdrawals and Deposits",
    "Binance Setting Up Lightning Nodes: Is Bitcoin Becoming a Payment Network?",
    "Binance Confirms Bitcoin Lightning Network Integration",
    "Binance Sets Up Bitcoin Lightning Nodes to Ease Deposits and Withdrawals",
    "Binance is working on integrating Bitcoin Lightning Network for deposits and withdrawal",
    "Binance confirms Bitcoin Lightning Network integration in the works",
    "Binance Adopts Bitcoin Lightning Network for Fast Deposits and Withdrawals",
    "Binance Set to Integrate Bitcoin Lightning Network for Deposits and Withdrawals",
    "Binance Working on Bitcoin Lightning Network Integration for Deposits and Withdrawals",
    "Slowly, but we keep building... https://twitter.com/...",
    "FTX Spent More Than $120 Million in Two Months on Legal Fees",
    "Bankrupt FTX Spends $120 Million In Two Months, Where Did The Money Go?",
    "Legal Advisors at Sullivan and Cromwell Bill FTX Exchange $38 Million In 3 Months",
    "UK crypto law inches closer to approval, Do Kwon sentenced, FTX legal costs exceed $120m",
    "FTX incurs over $120m in advisor fees as bankruptcy costs mount",
    "FTX Paid $120 Million in Advisor Fees Over 3 Months: Report",
    "FTX Incurred More than $121M in Legal and Advisory Fees between February 1 and April 30",
    "$10 million per week leaving FTX None going to victims https://twitter.com/...",
    "This is absolutely insane. The level of injustice is mind boggling. https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "But why? It's a mystery! https://www.nytimes.com/...",
    "G.O.P. Targets Researchers Who Study Disinformation Ahead of 2024 Election",
    "G.O.P. Targets Researchers Who Study Disinformation Ahead of 2024 Election.  [ A legal campaign...",
    "Vimeo Introduces AI-Powered Tools for Effortless Video Production",
    "Vimeo Launches New AI Features to Simplify Video Editing and Scripting",
    "Vimeo intros a trio of AI-powered editing features",
    "Vimeo's new AI script generator will write corporate marketing filler in seconds",
    "Vimeo introduces a suite of AI tools to simplify video creation",
    "Vimeo announces AI-powered script generation and text-based video editing tools",
    "Vimeo unveils generative AI tools for faster video editing",
    "Vimeo Wants ChatGPT to Write Execs' Video Scripts Then Fix It When They Inevitably Screw Up",
    "Vimeo unveils AI tools to make video creation a breeze",
    "Personalized wealth management, built for tech people",
    "Make panel interviews worth the hassle",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "PayPal: Opening opportunities for all.",
    "Adobe: Let’s create experiences that matter.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "Character.AI: Build something smarter than you.",
    "Airtable: What will you make?",
    "Techmeme: You might have heard of us...",
    "(IHP) Eugene Wei On How Amazon Won",
    "Jun 19-23Cannes LionsCannes",
    "Jun 20-22HPE DiscoverLas Vegas",
    "Jun 21-22HYBRID: ConfigSan Francisco",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Gannett Sues Google, Alleges Monopolization of Ad-Tech Markets",
    "Gannett sues Google, alleges it monopolizes online ads",
    "Intel, Germany strike record €30B deal for chip mega-factory",
    "Return to tradition in Silicon Valley https://giftarticle.ft.com/...",
    "Microsoft cybersecurity revenue grows 32.3% year-over-year",
    "Microsoft gains 32% annual growth in cybersecurity revenue",
    "SoftBank's Son says he is ‘heavy user’ of ChatGPT",
    "Masayoshi Son to speak at SoftBank meeting amid investment doubts",
    "Foxconn hedges its bets: US and China will make up, but diversify just in case",
    "Google reportedly planning to manufacture Pixel phones in India",
    "Google seeks suppliers to move Pixel production to India",
    "INDIA-US Together To Counter Terrorism & China | US Representative Ahead Of PM Modi's Visit",
    "US games and esports market worth $54bn in 2022",
    "Gaming Just Isn't About You: Consoles Are Thrashed By Casual Games",
    "Cord-Cutting to Reduce Pay TV to Just 38 Percent of U.S. Households By 2027, PwC Forecasts",
    "Marques Brownlee on YouTube",
    "@dcseifert@mastodon.social",
    "Google Pixel Tablet review: What Android tablets should have been all along",
    "Review: Google Pixel Tablet",
    "Google Pixel Tablet review: It's all about the dock",
    "Google's new Pixel Tablet is perfect for smart home devotees",
    "Best Prices Today: Google Pixel Tablet",
    "Google Pixel Tablet: A great tablet, a so-so smart home device",
    "The official Google Pixel Tablet case's clever design hooked me from day one",
    "Pixel Tablet review: Google's Android slate and smart display rolled into one",
    "Google's Pixel Tablet is a good start, now Android needs to catch up",
    "Google Pixel Tablet Review: Not Made To Battle Galaxy Tab Or iPad, And That's A Good Thing",
    "Google Pixel Tablet review: That first-gen feeling",
    "26 helpful Pixel Tablet tips and features",
    "Google Pixel Tablet Review: Android Tablets Are Back",
    "Google Pixel Tablet Review: A Solid Android Tablet, but an Even Better Smart Home Hub",
    "Google Pixel Tablet Review: Unboxing, First Impressions",
    "Google Pixel Tablet review: Clever accessories transform an unexciting tablet",
    "Google Pixel Tablet review: Hi honey, I'm (Google) home",
    "Google Pixel Tablet review: half tablet, half home hub",
    "Pixel Tablet Review: Is Google Back?!",
    "Google Pixel Tablet review: the worst Pixel I've ever used",
    "NEW VIDEO - Pixel Tablet Review: Is Google Back?! https://www.youtube.com/... [image]",
    "Google Pixel Tablet review: the dock makes all the difference",
    "Alibaba's Taobao & Tmall Attracts Record Number of Merchants During 6.18 Shopping Festival",
    "China's 618 shopping festival records slower growth amid gradual consumption recovery",
    "JD.com's 2023 618 Grand Promotion: Surpassing Expectations and Setting New Records",
    "Consumption soft even amid deep discounts during major China shopping festival, analysts say",
    "Slower Growth During China's 618 Shopping Festival Signals Lagging Consumer Confidence",
    "Bargain hunting drives up retailers' sales as 618 shopping gala ends",
    "Taobao, JD.Com, and Pinduoduo Hail Success of ‘618’ E-Commerce Festival",
    "JD.com sales during China shopping festival beat expectations",
    "Chinese online shoppers are enticed by deep discounts, payment plans as zest for spending lags",
    "China's online shopping bonanza loses sheen as consumption sags",
    "China's 6.18 shopping fest sets record on Alibaba platforms",
    "AI and Fame: How Celebrities are Embracing Their Digital Duplicates",
    "Courts Put Privacy Over Transparency in FTX, Other Crypto Bankruptcies",
    "NFT Phishing Takes Dark Twist: School Children Stealing Millions for Roblox Skins",
    "School Kids Reportedly Phishing Millions in NFTs for Roblox Skins",
    "Cyber heists in digital playground, school-age hackers steal millions in NFTs",
    "Damn kids. https://twitter.com/...",
    "guess the real play isn't buying NFTs, it's buying Roblox skins https://www.theblock.co/...",
    "School kids are stealing millions of dollars to buy Robloxx skins",
    "@tchambers@indieweb.social",
    "@nexusofprivacy@mastodon …",
    "Update from Lemmy after the Reddit blackout",
    "Unofficial Subreddit Migration List (Lemmy, Kbin)",
    "Looking for a Reddit alternative? Lemmy tell you, they currently kinda suck",
    "Second Life in the Threadiverse",
    "Neowin mentioned Lemmy, Kbin, and Mastodon in their Reddit coverage today",
    "@mastodonmigration@mastodon.online",
    "222,397 Lemmy/kbin accounts  —  +23,441 in the last hour  —  71,331 monthly active users",
    "@nexusofprivacy@mastodon.social",
    "Eight days later: Kbin, Lemmy, the landed gentry, and the rise of “threadiverse”",
    "Opaque Algorithm Changes by Facebook Leave Publishers in the Dark #1675",
    "Facebook rocks publishers' worlds again. https://gizmodo.com/...",
    "Snapchat Users' Embrace of AI Could Improve Ads, Snap CEO Says"
]