[
    "International Business Times",
    "On-chain Sleuth Estimates $35 Million Loss From Atomic Wallet Exploit",
    "Atomic Wallet hack leads to at least $35M in stolen crypto assets",
    "Over $35 Million Lost in Atomic Wallet Attack as Exploit Investigation Continues",
    "Atomic Wallet hack losses top $35M, on-chain sleuth reports",
    "Over $35 Million Reportely Stolen From Atomic Wallet Users",
    "Atomic Wallet efforts to track and revert stolen funds",
    "Atomic Wallet security breach causes over $35 million in losses",
    "Atomic Wallet Reportedly Hacked: $35M in Crypto Assets Vanish",
    "Atomic Wallet Users Hacked for $35M Worth of Bitcoin, Ether, Tether and Other Tokens",
    "Atomic Wallet Hit by Massive Hack: $35 Million Worth of Cryptocurrency Stolen",
    "Atomic Wallet Users Left Devastated as Their Funds Vanished Completely",
    "Atomic Wallet Security Breach Results In $35 Million Crypto Heist",
    "Atomic Wallet Alerts Users Of Ongoing Exploit; Victims Claim Complete Loss Of Crypto Portfolios",
    "Report: At least $35M worth of crypto stolen from Atomic wallet users",
    "Atomic Wallet Customers Lose Over $35m in Crypto Attacks",
    "Atomic Wallet hacks total over $35 million",
    "Atomic Wallet Hack Causes Over $35M in Losses",
    "Atomic Wallet claims hack affected less than 1% of monthly active users",
    "Scam Alert: Atomic Wallet Calls for Caution as it Investigates Ongoing Compromise",
    "Atomic Wallet Investigating Exploit As Wave of Crypto Users Report Stolen Funds",
    "Breaking - Atomic Wallet Hacked, Crypto Analyst ZachXBT Investigates",
    "Binance Hands Rising Star Teng Key Role to Replace CEO Zhao at Largest Crypto Exchange",
    "Binance poaches OKX exec Rachel Conlan to lead global marketing",
    "Richard Teng seen as potential successor to Binance's Changpeng Zhao -reports",
    "Binance's Regulatory Hurdles Open Path for Potential CZ Successor",
    "Binance's CZ could leave his post amid regulatory hurdle",
    "Binance's Regulatory Hurdles Set the Stage for CEO Zhao's Likely Successor",
    "Binance Regulatory Woes: Richard Teng Eyed As Possible Successor To CZ - Report",
    "Regulatory Storm Clears Path for Binance's Future: Meet CEO Zhao's Heir Apparent",
    "Binance Exec Touted As Possible ‘CZ’ Replacement",
    "Binance gains ISO certifications amid global regulatory hurdles",
    "Dollar-Based Stablecoins to Strengthen Greenback, CZ Says, Thinks DeSantis ‘Is Great’",
    "Binance Looking for the Next Heir to CZ Amid Regulatory Woes | Coingape",
    "Ask not for whom carries the can, the can is carried by thee. https://www.bloomberg.com/...",
    "Report: Binance Exec Controlled US Affiliate's Accounts",
    "Binance controlled its US arm's bank accounts for two years: Reuters",
    "Breaking: Binance Exec Tightly Controlled Exchange's US Arm's Finances: Reuters | Coingape",
    "Who is Guangying Chen? 🤔 https://www.reuters.com/...",
    "Bitcoin Advocate Robert F. Kennedy Jr. Gains Jack Dorsey Support In Bid For Presidency",
    "Twitter co-founder Jack Dorsey endorses Robert F. Kennedy, Jr. in 2024 presidential race",
    "Instagram reinstates Robert F. Kennedy Jr.'s account",
    "Instagram reinstates Robert F. Kennedy Jr. amid presidential bid launch - WaPo",
    "RFK Jr. Says He Will Join Elon Musk For Twitter Interview After Being Banned From Instagram",
    "Zuck Loves Biden: Facebook Prevents RFK Jr. from Launching Instagram Campaign Account",
    "*years long headache forms*",
    "He can and will https://www.youtube.com/...",
    "Hosting @RobertKennedyJr's upcoming Space https://twitter.com/...",
    "Don't Let Reddit Kill 3rd Party Apps!",
    "Reddit Community Considers Blackout In Response to API Policy Changes",
    "How Reddit Became the Enemy - w/ Apollo Developer Christian Selig",
    "A decentralized, ownerless Reddit is needed https://twitter.com/...",
    "Reddit going dark in protest at API pricing; Apple cut Twitter ad spend",
    "Elon Musk: Twitter snaps up top NBCUniversal executive",
    "Twitter is hiring ad executives to bolster its business",
    "Twitter's ad sales stink of Musk.Elon Musk to the BBC in April:",
    "More Safety Execs Flee Twitter",
    "we are in the “find out” stage of fuck around",
    "that's the good shit  —  https://www.nytimes.com/...  [image]",
    "Twitter to recoup revenue by being everyone's Everything app. https://www.nytimes.com/...",
    "Seems like a good place to launch a presidential campaign from https://www.nytimes.com/...",
    "Wile. E. Coyote, Super Genius! https://www.nytimes.com/...",
    "On Setting the Record Straight",
    "Stability AI faces another Getty Images legal action in UK",
    "Stability AI Founder Overstated Startup Strength, Report Says",
    "Good time to remember there are two sides to every story This is Emad's https://twitter.com/...",
    "Congrats on the hit-piece @EMostaque ! Reminds me of this quote from @nntaleb [image]",
    "This is the most beautiful pivot to AI I have ever seen https://twitter.com/...",
    "Spotify will cut 200 jobs in its podcast unit",
    "Spotify Laying Off 200 Employees in Its Podcast Division",
    "Spotify announces layoff of 200 employees in podcast division",
    "Spotify to Cut 200 Jobs as It Reorganizes Podcasting Division",
    "Spotify lays off 200 employees, or about 2% of its workforce",
    "Spotify to Slash Podcast Workforce, Combine Parcast and Gimlet Studios in New Round of Cuts",
    "Another exclusive show to leave Spotify?",
    "Stock Futures Are Little Changed After the S&P 500's Best Week Since March: Live Updates",
    "Maybe the Joe Rogan podcast wasn't that good for the company https://twitter.com/...",
    "holymoly this is good! https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Ted Chiang on AI: ‘The Machines We Have Now Are Not Conscious’",
    "Catching Up On Readings: AI Regulation",
    "What Would AI Regulation Look Like?",
    "Excellent @FT piece by @MarietjeSchaake. https://twitter.com/...",
    "It's sad that this isn't blindingly obvious. https://twitter.com/...",
    "Oh crap! Another amazing profile of an amazing human in gaming @DrKowert. https://twitter.com/...",
    "Personalized wealth management, built for tech people",
    "Why Zoho Sign is a great alternative to Adobe Acrobat Sign",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "PayPal: Opening opportunities for all.",
    "Figma: Make design accessible to everyone.",
    "Replit: From idea to software, fast.",
    "Techmeme: You might have heard of us...",
    "(IHP) She Gave The World A Billion AOL CDs",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Google AI Search: A Slow and Cluttered Experience",
    "How to clear search history on Mac",
    "Google is using machine learning models to speed up Gmail search",
    "Star developers: they're just like me!",
    "Ethereum gas fees cool down after May memecoin frenzy",
    "Republican bill seeks SEC, CFTC ‘clarity’ on crypto, memecoin frenzy drives Uniswap to record",
    "SHIB, PEPE: Bitcoin Devs Want to Crush $500 Million Meme Coin Market",
    "TSMC Arizona job hiring hurt by ‘brutal’ culture",
    "@dcseifert@mastodon.social",
    "everything about this sounds absolutely awful https://www.theverge.com/...",
    "The legal case for Montana's TikTok ban",
    "TikTok code being worked on from China prompts fresh alarm",
    "ISS U.S. National Laboratory",
    "CTF in space: hackable satellite set to launch",
    "US Space Force plans to launch its own cybersecurity satellite this week",
    "World's 1st ‘hacking sandbox’ satellite and more to ride on SpaceX's next NASA cargo launch",
    "Moonlighter space-hacking satellite readies for launch https://www.theregister.com/ ...",
    "Sony CEO: Cloud gaming's “technical difficulties are high”",
    "Sony Boss Warns Cloud Gaming Still Technically ‘Very Tricky’",
    "Sony exec cautious about cloud gaming, says it's “very tricky”",
    "Sony CEO Hands Microsoft a Golden Assist by Downplaying Cloud Gaming Importance",
    "Sony CEO warns of cloud tech difficulties",
    "Sony CEO isn't sure cloud gaming is the future",
    "Sony CEO admits cloud gaming is ‘very tricky’ just after announcing Project Q",
    "Sony wants to improve cloud gaming, but admits the tech is tricky",
    "Sony's CEO admits that cloud gaming is still “very tricky” technically",
    "Sony CEO warns technical issues still remain for cloud gaming",
    "Sony: Cloud Gaming Is an Amazing Business Model, But There Are Big Challenges",
    "Cloud Gaming Has Promise, but Still Has a Lot of “Technical Difficulties”, Says Sony CEO",
    "PlayStation Boss Says Cloud Gaming Has Too Many Technical Difficulties",
    "Sony may use proprietary AI to augment PlayStation cloud gaming",
    "Sony CEO Says Significant Barriers to Cloud Gaming Remain: FT",
    "Sony chief plays down threat to consoles from cloud gaming https://www.ft.com/...",
    "The Google Pixel Watch is randomly popping open for some",
    "Users report their Pixel Watch backplates randomly falling off",
    "Google Pixel Watch backplate coming undone for some users",
    "Google Pixel Watch Owners Report Issue With Backplate Falling Off",
    "Some Pixel Watch owners are seeing the back panel fall off without clear cause",
    "Some Pixel Watch owners are reporting backplates falling off",
    "Oof, some Pixel Watch units are randomly popping open (Update: Google statement)",
    "Google Pixel Watch's back is falling off and causing major frustrations",
    "Some Google Pixel Watch Units Are Falling Apart on Their Own",
    "Pixel devices and random hardware issues go hand in hand https://www.androidpolice.com/ ..."
]