[
    "Nintendo World Report Updates",
    "Microsoft wins FTC fight to buy Activision Blizzard",
    "Judge rejects FTC's attempt to block Microsoft's $69 billion Activision deal",
    "Microsoft Cleared to Buy Activision in US as UK Pauses Fight",
    "Microsoft Can Close Its $75 Billion Buy of Activision Blizzard, Judge Rules",
    "Microsoft can move ahead with record $69 billion acquisition of Activision Blizzard, judge rules",
    "U.S. federal Judge Corley finally rules on Microsoft's Xbox-ABK deal: Microsoft WINS",
    "Microsoft Prevails Over FTC: US Judge Denies Bid to Block Activision Deal",
    "US judge greenlights $69 billion Microsoft-Activision deal, FTC may appeal verdict",
    "Microsoft wins pivotal court ruling over FTC, clearing key hurdle for $69B Activision deal",
    "Judge denies injunction in Microsoft's Activision Blizzard acquisition",
    "The Hurdles That Remain for $69 Billion Microsoft-Activision Deal",
    "Microsoft Gets the Green Light to Purchase Activision Blizzard in Victory Over FTC",
    "S judge rules Microsoft deal to buy Activision can go forward",
    "Microsoft wins FTC trial, can proceed with Activision Blizzard merger",
    "Microsoft Wins its US Court Case Over its Activision Blizzard Acquisition",
    "Microsoft, Activision defeat FTC's bid to block $69B deal",
    "Microsoft may proceed with $69bn Activision Blizzard deal, judge rules",
    "The FTC's case against Microsoft's Activision acquisition is not going well",
    "Microsoft can go forward with Activision Blizzard purchase after court rules against injunction",
    "Microsoft's Activision acquisition moves ahead as judge rejects FTC injunction request",
    "Court Ruling Clears Path for Microsoft to Buy Activision",
    "Microsoft can close its Activision merger, federal judge rules",
    "Microsoft wins US court nod to buy Activision in FTC loss",
    "FTC Loses First Bid to Block Microsoft's Acquisition of Activision Blizzard",
    "A Verdict Has Been Reached in the Microsoft vs. FTC Trial",
    "Federal Judge Rejects FTC Effort To Halt Microsoft-Activision Merger",
    "Microsoft wins latest legal battle against FTC over Activision Blizzard acquisition",
    "Microsoft wins U.S. court case over Activision Blizzard acquisition",
    "Microsoft has won its Activision Blizzard acquisiton case with the FTC",
    "Microsoft Wins against FTC: Activision Merger Can Move Forward after Court Ruling",
    "Game-Changing Decision: Microsoft Clears Path for Activision Blizzard Deal",
    "US Judge rejects FTC's injunction request against Microsoft's Activision Blizzard deal",
    "FTC preliminary injunction blocked...so where does the Activision Blizzard deal go from here?",
    "US judge denies FTC request to block Microsoft-Activision merger",
    "Microsoft wins crucial FTC case on Activision Blizzard acquisition",
    "Microsoft Wins FTC Brawl Over $69B Activision Blizzard Deal as Merger Nears Close",
    "Microsoft gets US approval to buy Activision Blizzard",
    "Microsoft wins FTC court case to acquire Activision Blizzard",
    "Microsoft Comes Out Victorious Over FTC Court Case",
    "Microsoft Gets Green Light To Buy Activision Blizzard In FTC Case",
    "Judge won't block Microsoft's $69B takeover of video games giant Activision",
    "Microsoft has won its US court case to acquire Activision Blizzard",
    "Judge Rules in Favor of Microsoft's Activision Blizzard Acquisition",
    "Microsoft wins the court battle against FTC for its Activision Blizzard deal",
    "Microsoft wins FTC case, removing Xbox's biggest Activision Blizzard acquisition hurdle",
    "Judge rules for Microsoft in FTC fight over Activision",
    "Microsoft Wins Court Case Against FTC To Buy Activision Blizzard",
    "Microsoft Beats US Regulator FTC in Activision Blizzard Buyout Battle",
    "Microsoft wins bid against FTC injunction to buy Activision Blizzard",
    "Microsoft Beats FTC's Request for Preliminary Injunction to Block Activision Blizzard Deal",
    "FTC Injunction Denied by Judge in Microsoft's Acquisition of Activision Blizzard",
    "FTC v Microsoft: Judge Corley denies preliminary injunction in big win for Xbox",
    "Microsoft Wins Court Battle Against FTC Over Activision Blizzard Acquisition",
    "Microsoft Cleared In US Court To Complete Activision Blizzard King Buyout",
    "Xbox's Phil Spencer ‘Grateful’ For Speedy Court Decision On FTC Activision Blizzard Case",
    "Microsoft Wins FTC Court Case, Activision Blizzard Deal Can Proceed",
    "Microsoft Prevails in FTC Case",
    "Dow Rises 200 Points Tuesday as Traders Await Key Inflation Data: Live Earnings",
    "Our statement on today's decision: https://twitter.com/... [image]",
    "Can Microsoft save COD. That is the question for me. Also selfishly, lol. https://twitter.com/...",
    "Microsoft and UK regulators agree to pause legal fight to negotiate Activision acquisition",
    "UK CMA Agrees to Renegotiate with Microsoft",
    "Microsoft to modify Activision Blizzard acquisition to address CMA concerns",
    "UK regulator open to looking at Microsoft-Activision deal again",
    "A major milestone: Update on the Microsoft deal",
    "Microsoft's Activision Blizzard merger can't be blocked by FTC, judge rules",
    "Microsoft and the UK CMA will now enter talks over Activision Blizzard purchase",
    "UK Antitrust Agency Pauses Microsoft-Activision Appeal on FTC Court Loss in US",
    "Microsoft wins against FTC, clearing vital hurdle for Activision Blizzard acquisition",
    "The Industry Reacts to the Microsoft vs. FTC Trial Verdict",
    "Microsoft has one major hurdle left in its Activision Blizzard deal",
    "Microsoft and CMA pause appeal battle to negotiate on Activision Blizzard deal",
    "Microsoft And UK CMA Agree To Pause Legal Battle Over Activision Blizzard Deal",
    "Microsoft Wins US Court Approval to Acquire Activision Blizzard",
    "UK regulator and Microsoft pause litigation in bid to reach agreement on Activision deal",
    "FTC denied preliminary injunction on Microsoft Activision deal",
    "Our statement on the mutual request with the CMA for a pause of our appeal in the UK: [image]",
    "“Cloud gaming? Never heard of it. Anyway let's talk” https://twitter.com/...",
    "Intel Exiting the PC Business as it Stops Investment in the Intel NUC",
    "Intel will stop making its own NUC mini PCs",
    "Intel is quitting on its adorable, powerful, and upgradable mini NUC computers",
    "Intel sunsets Next Unit of Compute (NUC) product line",
    "Intel Exits NUC Business, Will Rely on External Partners",
    "Intel wird keine NUCs mehr anbieten",
    "Intel will no longer make NUC PCs, will pivot to support partners instead",
    "Intel to Stop Making its Excellent NUC PCs, Opting to Use Partners Instead",
    "No more NUCs: Intel seemingly confirms that its nifty mini PCs are canceled",
    "Intel Ends Direct Investment in NUC Business: Future Development Relies on Ecosystem Partners",
    "Intel Discontinues its NUC Product Range",
    "@meredithmeredith.bsky.social",
    "@susanrinkunas.bsky.social",
    "@evilrobert.newrosehotel.co",
    "Nebraska mom pleads guilty to giving daughter pills for an abortion and helping bury the fetus",
    "Mother Pleads Guilty To Giving Daughter Abortion Pills, Burning and Burying Dead Baby",
    "It was disgusting and I get annoyed that so many media outlets leave out the details.",
    "Nebraska Mom Pleads Guilty to Giving Abortion Pills to Her Teen Daughter",
    "Claude 2  —  We are pleased to announce Claude 2, our new model.",
    "Anthropic releases Claude 2, its second-gen AI chatbot",
    "Anthropic releases upgrade Claude 2 AI chatbot with improved safety and coding ability",
    "Anthropic releases Claude 2, a more capable, less gullible AI chatbot",
    "Google-backed Anthropic startup upgrades its Claude AI, better at coding",
    "Anthropic's ‘friendly’ AI chatbot, Claude, is now available for more people to try",
    "Anthropic unveils Claude 2, an AI model that produces longer, safer responses",
    "Claude 2.0, Anthropic's Latest ChatGPT Rival, Is Here — And This Time, You Can Try It",
    "Anthropic — the $4.1 billion OpenAI rival — debuts new A.I. chatbot and opens it to public",
    "ChatGPT alternative: OpenAI competitor Anthropic's “Claude 2” chatbot is live",
    "Anthropic's Claude 2 Is The Latest ChatGPT Competitor",
    "Anthropic announces the second major release of its Claude large language model",
    "Introducing AnthropicAI's Claude 2",
    "Anthropic Releases a New Version of Its ChatGPT Rival, Claude",
    "Introducing Phone (2) ft. Casey Neistat",
    "Nothing Phone 2 Brings 50MP Shooter And Unique Light Show To The US, UK And Europe",
    "Nothing Phone (2): Everything you need to know",
    "The Nothing Phone 2 and Its Flashy Lights Debut at $599",
    "Nothing Phone 2's Glyph lights are the opposite of a gimmick",
    "Nothing Phone 2 comes to the US on July 17th for $599",
    "Nothing Phone (2) doubles down on the brand's minimalist, low-key aesthetic",
    "Nothing Phone (2) goes official for $599 in the US - ask us anything",
    "Nothing Phone 2 arrives in the US starting at $599",
    "Hands-On With the New Transparent Nothing Phone",
    "Nothing's Phone (2) is up for preorder, starting at $599",
    "The Nothing Phone 2 has me excited about midrange phones again",
    "Nothing's flashy Phone 2 lands in the US for $599",
    "Nothing Phone (2) vs Nothing Phone (1): which is best to buy now?",
    "Nothing phone (2) hands-on impressions: The big leagues",
    "Nothing Phone (2) battery and charging: Up there with the big boys!",
    "The Nothing Phone (2) arrives and seeks harmony with its refined aesthetics and 2.0 OS",
    "Is the Nothing Phone 2 available in the U.S.?",
    "Nothing Phone 2: Price, availability, specifications, and more",
    "Nothing Phone (2) Hands-On: First Impressions With A Few Key Details",
    "Sleek and Stylish Nothing Phone 2 Has Upgraded 50MP Cameras",
    "Nothing Phone (2) Hands-On: A True Android Flagship?",
    "Nothing phone (2) hands-on: A welcome second coming",
    "Apple launches an online store on China's WeChat app",
    "Apple woos Chinese consumers on Tencent super app WeChat with new mini-program",
    "Apple launches online store on China's giant WeChat messaging app",
    "Apple Debuts Store on Chinese Super App WeChat",
    "iPhone buyers in China can now purchase Apple devices on WeChat, a messaging platform",
    "Apple targets China sales growth with new WeChat storefront",
    "Apple Store launches as mini-app on WeChat platform in China",
    "Apple opens official online store on Tencent's WeChat",
    "Apple's full product lineup is now available on WeChat, China's massive super app",
    "Apple opens store on China's WeChat platform: Details inside",
    "Apple has Launched a new online Store on China's WeChat messaging App",
    "Apple opens online store on Chinese WeChat app",
    "Apple Launches Online Store Through WeChat in China",
    "Apple Launches Online Store on China's WeChat Platform",
    "Apple launches store on Tencent's WeChat to expand China reach",
    "Apple opens store on China's WeChat platform",
    "Apple Opens Store on China's WeChat Platform",
    "Mac shipments grow 10%, as all major PC brands see downturns",
    "Global PC market is continuing to collapse for everybody but Apple",
    "Should leaders place bets on new PCs or generative AI?",
    "PC Shipments Drop Again in Q2, IDC Says",
    "HP, Apple PC Shipments Are Bright Spots in a Q2 Slump",
    "Global PC shipments decline eases in Q2, Apple outperforms on MacBook Air demand - Canalys",
    "Mac shipments return to growth but Windows keeps plunging",
    "Apple Defies the Odds: Mac Sales Rise Amidst PC Industry Decline",
    "IDC, Canalys both confirm Mac sales up, PC sales not up",
    "Apple's Mac Market Share Jumped Even Though PC Sales Fell for the Sixth Consecutive Quarter",
    "Global PC market decline eases as shipments drop 12% in Q2 2023",
    "Mac shipments surge 10.3% as PC market craters",
    "PC sales keep falling around the globe, so this could be a great time to upgrade",
    "Apple was the only PC maker to post shipments growth in Q2 2023",
    "IDC reveals that in 2Q23 Apple was the only PC maker to deliver shipment and market share Growth",
    "AI Safety and the Age of Dislightenment",
    "Video Game History Foundation",
    "@PlayHistory@oldbytes.space",
    "87% Missing: the Disappearance of Classic Video Games",
    "Study finds nearly every pre-2010 video game is unavailable",
    "Survey of the Video Game Reissue Market in the United States",
    "87% of classic video games are ‘critically endangered’, says game history organisation",
    "87% of older video games are currently impossible to buy anywhere reveals report",
    "Video Game History Foundation estimates 87 percent of “classic” games now unavailable",
    "Vanishing act: 87% of classic video games are no longer available commercially",
    "An Alarming 87 Percent Of Retro Games Are Being Lost To Time",
    "Classic games are ‘critically endangered’ according to new study",
    "Almost all classic US video games ‘critically endangered’",
    "87 Percent Of Retro Games Are Considered “Critically Endangered”",
    "Commercial Availability of Video Games from Before 2010 is Lower Than Silent Films, Study Finds",
    "All your favorite classic games are ‘critically endangered’ and could soon be unplayable",
    "New study reveals most classic video games are unavailable",
    "87% Missing: the Disappearance of Classic Video Games |  Video Game History Foundation",
    "Privacy update  —  For Immediate Release … HCA Healthcare Reports Data Security Incident",
    "HCA confirms breach after hacker steals data of 11 million patients",
    "HCA Healthcare reports breach of 11 million patients' personal data",
    "HCA Healthcare data breach impacted 11 million patients",
    "Razer investigates potential breach involving its digital wallet",
    "HCA Healthcare releases statement while hacker puts data up for sale on deep web",
    "11 Million Patients Impacted in Healthcare Data Breach",
    "Data for Potentially Tens of Millions of HCA Healthcare Patients for Sale on Breach Forum",
    "Data for 11 million patients stolen in breach of HCA Healthcare",
    "Medical City parent company reveals patient data breach affecting 11 million",
    "Florida patients among 11 million affected by HCA Healthcare data breach",
    "HCA Healthcare Data Leak Appears to Be Theft",
    "5 Things to Know Before the Stock Market Opens Tuesday",
    "Personal Information of 11 Million Patients Stolen in Data Breach at HCA Healthcare",
    "Millions of HCA Healthcare customers have data stolen - here's what you need to know",
    "Mark Lucovsky Leaves Google, Calls Company “Unstable”",
    "Google loses senior director on secretive Project Isis augmented reality effort",
    "Samsung's upcoming AR/XR headset could have a shaky start",
    "Googler leading XR OS quits, citing 'Google's unstable commitment and vision' for AR",
    "Google's AR/VR Operating System Engineering Director Quits",
    "Google loses a Senior Director due to ‘unstable commitment’ in AR",
    "Google's Latest Exec Loss Has Dire Implications For A Vision Pro Competitor",
    "Google XR software lead quits, heavily criticizes company on way out",
    "?? did we know G had an AR arm? was that a thing? https://twitter.com/...",
    "Wow, big loss for G. https://twitter.com/...",
    "What is happening at Google? https://twitter.com/...",
    "Teen hacked Uber, Revolut and Grand Theft Auto maker, London court hears",
    "Shutterstock to Provide OpenAI with Training Data in New Partnership Deal",
    "Stocks Making the Biggest Moves Midday: Shutterstock, Newell Brands, Zillow and More",
    "Pro-Chinese Twitter accounts seek to expand Beijing's influence in Latin America",
    "Why Threads Got 100 Million Users When Other Twitter Rivals Could Not",
    "Meta will label government accounts on Threads",
    "Facebook says China trolls ‘evolving’ in push for influence",
    "Meta's Transparency Drive: Labels & Fact Checking on Threads",
    "Meta's social media apps including Threads restored after brief outage",
    "Threads Tops ChatGPT's Record With 100 Million Users in 5 Days",
    "Meta tells Australian Senate Threads does not yet have tools for fact-checking",
    "Threads won't have ads for now; fact-checking planned; brands at risk",
    "Meta planning to bring its branded content tools to Threads: report",
    "Meta's Instagram to bring branded content tools to Threads - Axios",
    "Instagram Threads won't have to worry about Twitter's years of advertising pain",
    "Clop: Behind MOVEit Lies a Loud, Adaptable and Persistent Threat Group",
    "Amazon Files Legal Challenge to EU Digital Services Act",
    "Amazon makes first Big Tech challenge to EU online content rules",
    "Amazon joins Zalando in challenging very large online platform designation",
    "Amazon tells court it shouldn't have to police its platforms for hate speech and disinformation",
    "Amazon launches first Big Tech challenge to EU online content rules",
    "That Google memo about having ‘no moat’ in AI was real — and Google's AI boss disagrees with it",
    "Google DeepMind CEO Says Company Can Outpace Open Source AI despite Recent Pessimistic Memo",
    "Google DeepMind CEO Demis Hassabis sees LLMs talking to experts as “next era” of AI",
    "Savvy Raises $30M in Funding",
    "SaaS Application Security Firm Savvy Exits Stealth Mode With $30 Million in Funding",
    "End of an Era at Google DeepMind Hints at New Future for AI",
    "Influencial AI expert leaves Google Japan to start own venture",
    "Free Figma template of onboarding & activation designs",
    "Debate over ‘fake work’ and ‘lazy management’ in tech industry",
    "Broadcom's $61 Billion VMware Deal Set for EU Approval",
    "Let's not have regulatory overlaps on data compliance",
    "Tumblr's Core Product Strategy",
    "Tumblr Details Big Plans To Draw In New Users",
    "Tumblr's building a TikTok inspired feed in bid to grow its user base",
    "@Techmeme no mention of #ActivityPub 😔",
    "Tumblr, all you have to do is be Tumblr! https://www.theverge.com/... [image]",
    "Tumblr's core product strategy",
    "Tumblr says it's going to ‘fix’ its ‘core experience’ to appeal to new users",
    "Tumblr says it's going to “fix” its “core experience” to appeal to new users",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Internal applications: App-solutely customized for your organization",
    "Google: Bring questions. Build answers.",
    "Stripe: Help us build universal payments.",
    "Lightmatter: Next-gen computing built for AI.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Adobe: Let’s create experiences that matter.",
    "PayPal: Opening opportunities for all.",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "Techmeme: You might have heard of us...",
    "Tue. 07/11 - A Meaningful Anti-Tracking Law",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Jul 11-12VentureBeat TransformSan Francisco",
    "Jul 26Samsung Galaxy Unpacked \"Join the Flip Side\" media eventSeoul",
    "Jul 26Earnings: META, EBAY, Samsung Electronics",
    "Aug 2Earnings: DASH, QCOM, HOOD, PYPL",
    "Aug 3Earnings: AAPL, BKNG, SQ, NET",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Discord introduces new opt-in parental controls for teens",
    "Discord adds Family Center, giving parents overview of teen activity",
    "Discord is making it easier for parents to keep track of what their teens are up to in the app",
    "How to Use Discord's ‘Family Center’ Safety Settings for Your Kids",
    "Lining Up The “El Capitan” Supercomputer Against The AI Upstarts",
    "Tuolumne is El Capitan's Little Brother with 200+ PetaFLOPS Performance",
    "El Capitan Installation Begins: First APU-based Exascale System Shaping Up For 2024",
    "Installation of El Capitan supercomputer begins at Lawrence Livermore National Laboratory",
    "Interesting that Microsoft isn't mentioned in this article at all [embedded post]",
    "UK-based Raft secures €27.2M for its intelligent logistics platform",
    "Raft Raises $30M in Series B Funding",
    "Raft, which services freight forwarders, closes $30M Series B led by Eight Roads VC",
    "HealthTech startup Verifiable lands $27m in Series B funding",
    "Verifiable Raises $27M in Series B Funding",
    "Verifiable Lands $27M to Automate Healthcare Provider Credentialing",
    "Amazon's confusing payment strategy in India",
    "Report: China to tighten rules around releasing generative AI tools",
    "China vs EU: Which is Leading the Way in Strict AI Regulation?",
    "China's search engine pioneer unveils open-source large language model to rival OpenAI",
    "China's Web Watchdog Wants to License Generative AI Use",
    "Tata-assembled iPhones coming up; Down rounds for Indian startups here to stay?",
    "Tata Group To Take Over Wistron's iPhone Assembly Unit In Karnataka",
    "Tata Group may soon be first Indian firm to manufacture iPhone",
    "Tata Group all set to acquire Apples Indian Supplier Factory",
    "Tata Group will become the first India-native company to build the iPhone",
    "Report: After 5 Years, Uber CFO Nelson Chai Plans to Leave",
    "Uber CFO to depart after nearly 5 years",
    "India-based BluSmart rapidly expands fleet to up Uber, Ola competition",
    "Bangladesh e-Government Computer Incident Response Team",
    "Contacted the govt multiple times but got no response: Viktor Markopoulos",
    "Massive leak at Bangladesh govt site exposes data of millions of citizens",
    "Site's weakness to blame for exposing citizens' data: Palak",
    "Updated article, now that the data is secured https://twitter.com/...",
    "TPG to Buy Forcepoint Unit From Francisco Partners for $2.45 Billion",
    "TPG to buy Forcepoint unit from Francisco Partners",
    "TPG to Acquire Forcepoint's Government Cybersecurity Business Unit",
    "TPG to buy Forcepoint's government cyber unit in a deal valued at $2.45 billion",
    "Forcepoint To Sell Government Unit To TPG, Creating ‘Leader’ In Zero Trust Security",
    "TPG to Buy Forcepoint's Government Security Unit for $2.45B",
    "TPG to buy Forcepoint's public sector cybersecurity business for $2.45B",
    "TPG Buys Forcepoint Unit From Francisco Partners for $2.45 Billion",
    "San Francisco Business Journal",
    "Former Flexport CEO Ryan Petersen joins Peter Thiel's Founders Fund",
    "Founders Fund Hires Flexport Founder as Partner",
    "Flexport's Ryan Petersen joins venture firm Founders Fund as a partner",
    "Flexport's Ryan Petersen Joins Thiel-Backed Founders Fund as Partner",
    "Ah the joys of going from successful CEO to investing professional at a VC fund",
    "The best I have a new role post ever. https://twitter.com/...",
    "I mean, fuck... what a get! https://twitter.com/...",
    "The legend grows. @typesfast = next level. https://twitter.com/...",
    "Huge add for Founders Fund 🚀 @typesfast is a national treasure https://twitter.com/...",
    "Excited to have @typesfast join the FF team: https://www.forbes.com/...",
    "New VC in the Presidio. welcome @typesfast! https://twitter.com/...",
    "Snapchat will now let users add links to public profiles",
    "Linktree is now available on Snapchat for users with a Public Profile",
    "Sega workers form largest multi-department video game union in the US",
    "Sega Workers In Irvine, California Form Largest Multi-Department Union In Game Industry",
    "Sega Of America workers successfully vote in favour of unionising",
    "Sega of America employees vote to unionize",
    "Sega Of America Has Unionized",
    "Sonic the Hedgehog's US Workers Vote to Join Union",
    "Sega of America workers successfully vote to unionize",
    "SEGA of America Workers Vote to Unionize",
    "This is cool. Grats Sega workers! https://twitter.com/...",
    "The Download: AI weather forecasting, and Threads is thriving",
    "AI Detectors Discriminate Against Non-Native English Speakers",
    "Not Boring by Packy McCormick",
    "John Battelle's Search Blog",
    "@themckenziest.bsky.social",
    "@taylorlorenz@mastodon.social",
    "Taliban Endorses Twitter Over Threads",
    "Twitter is Blocking Threads Links as App Crosses 100 Million Users",
    "Twitter Beats Out Threads for Coveted Taliban Leader Endorsement",
    "Twitter traffic is ‘tanking’ as Meta's Threads hits 100 million users",
    "Twitter traffic sinks in wake of changes and launch of rival platform Threads",
    "Twitter's New CEO Strikes Back at Meta's Threads: 'There's Only ONE Twitter.'",
    "‘Meta Loses More:’ Zuckerberg Takes Threads Fight to EU",
    "Linda Yaccarino says Twitter saw its ‘largest usage day’ despite users flocking to Threads",
    "Musk calls Zuckerberg a “cuck” and then asks to compare penises",
    "Zuckerberg's Threads hits 100 million users- What's in it for Chancer?",
    "At Threads, No News Is Good News, For Now. But That's About To Change.",
    "Elon Musk jet-tracking account banned from Twitter arrives on Threads with request for Zuckerberg",
    "Taliban endorses Elon Musk's Twitter for freedom of speech and credibility over Meta's Threads app",
    "Meta's Twitter rival Threads hits 100 million users in record five days",
    "Twitter traffic plunges after Musk takeover, Threads debut",
    "The Elon Musk private jet tracker resurfaces on Threads and immediately goads Mark Zuckerberg",
    "Twitter traffic really is tanking, Cloudflare reveals, but is anyone that surprised?",
    "Suspended Twitter account tracking Elon Musk's jet moves to Threads",
    "Twitter's traffic is taking a dive, according to Cloudflare's CEO.",
    "Musk Melts Down as Threads Nears 100M Users: ‘Zuck is a Cuck’",
    "Why did the worst person for the job take over my favourite app lol [embedded post]",
    "we're quickly nearing the end of the simulation [embedded post]",
    "Techmeme posts I never expected to see for $200 Alex.  [embedded post]",
    "Twitter traffic tanking. [Image: Cloudflare DNS rankings over time]",
    "@fentasyl I propose a literal dick measuring contest 📏",
    "@brettdash_ @charliewrich Censorship pays them well",
    "Excruciating flop sweat vibes. https://twitter.com/...",
    "The Taliban endorsing Twitter is a sign we're on a sinking ship https://twitter.com/...",
    "Jim Cramer has said: “Whatever Twitter can do, Zuck can do better”. [video]",
    "@lindayacc I spent over 25 hours a day on Twitter all weekend to support you and all of us here",
    "i can't imagine why this platform is having a hard time attracting advertisers [image]",
    "Now we know why Twitter recently allowed male enhancement product ads on its platform [image]",
    "A @Techmeme headline for the history books [image]",
    "META'S TWITTER RIVAL THREADS OVERTAKES CHATGPT AS FASTEST-GROWING PLATFORM $META",
    "The censorship on Meta's new app is insane. They even want to control whom you follow. [image]",
    "Elon: Protects free speech Zuck: Protects brand speech https://twitter.com/... [image]",
    "zuck's meat was on his mind for 8 hours I'm crying [image]",
    "bro came back 8 hours later for this [image]",
    "A story that would seem insane to anyone from 2021 https://twitter.com/...",
    "@SOClALRATE This platform will protect anons for this reason particularly",
    "Zuck is actually doing it lmaooooo [image]",
    "damn even Mark Zuckerberg is mocking Elon Musk's tweets now [image]",
    "The Taliban Endorses Twitter Over Threads",
    "Taliban says Meta is Intolerant, so it is sticking with Twitter instead of using Threads."
]