[
    "@0x00string@infosec.exchange",
    "@JoeUchill@mastodon.social",
    "@santim@social.vivaldi.net",
    "@chrismessina@mastodon.xyz",
    "Google challenger Neeva gives up on consumer search, goes all in on AI and the enterprise",
    "Neeva, the would-be Google competitor, is shutting down its search engine",
    "Neeva shuts down its search engine to focus on AI products",
    "Google search rival Neeva is shutting down its search engine to work on AI products",
    "Neeva, The Ad-Free Search Engine, Announces Closure",
    "Neeva Shut Downs its Search Engine",
    "Neeva Shuts Down Search Engine Ahead of Snowflake Deal",
    "It takes a lot to switch user behavior https://www.theverge.com/...",
    "LLMs are a bigger opportunity for startups than search https://twitter.com/...",
    "The esports world is starting to teeter",
    "Reported offers for TSM's LCS slot fall well short of league's record sale price",
    "Hidden crypto holdings turn divorce battles into high-stakes cases, attorneys warn",
    "Crypto hunter busts husband's $500k BTC hideout in divorce",
    "Wife finds husband's Bitcoin stash amid divorce proceedings",
    "Hidden $500K Bitcoin Stash Unearthed in Divorce Proceedings",
    "Meta in Talks With Magic Leap Over AR Deal",
    "Magic Leap's CEO will discuss the future of AR at Disrupt's Hardware Stage",
    "G7 Hiroshima Leaders' Communiqué",
    "AI Draws Attention at G-7 Summit, With Leaders Calling for Guidelines",
    "G7 leaders unite to regulate generative AI globally under the ‘Hiroshima Process’",
    "G7 countries call to have global technical standards for AI",
    "G7 calls for ‘responsible’ use of generative AI",
    "Microsoft's planned $69B Activision purchase gets China antitrust approval - report",
    "Microsoft Gains China's Approval to Acquire Activision Blizzard amid Ongoing Antitrust Scrutiny",
    "Microsoft says China approves its plan to buy video game-maker Activision Blizzard",
    "China approves Xbox acquisition of Activision Blizzard as pressure builds on CMA",
    "China's antitrust committee joins Microsoft's growing list of Activision approvals",
    "Microsoft's purchase of Activision Blizzard reportedly approved in China",
    "China Approves Microsoft's Activision Blizzard Acquisition",
    "Chinese regulators have reportedly approved Microsoft's purchase of Activision Blizzard",
    "37 Countries Have Now Approved Microsoft's Deal To Buy Activision Blizzard",
    "An in-depth look at the executive team behind Apple's upcoming mixed reality headset",
    "Report: Apple to start selling Ted Lasso merch through the Apple online store",
    "Apple's big WWDC 2023 launch may include MR headset, new MacBook Air",
    "Apple Reality Pro headset: Everything we know about Apple's AR/VR headset",
    "Dear Apple, this is what we want from the Reality Pro headset",
    "COMMENTS OF AT&T  —  Before the FEDERAL COMMUNICATIONS COMMISSION Washington …",
    "FCC Gives SpaceX Starlink A Major Win Against Dish Network",
    "AT&T files with the FCC seeking to put the kibosh on T-Mobile's satellite-to-cellular plan",
    "AT&T opposes the Starlink and T-Mobile satellite-to-phone service plan",
    "AT&T has some concerns about Starlink and T-Mobile's satellite-to-cellular plans",
    "AT&T Asks FCC to Block T-Mobile From Expanding Network With SpaceX Satellites",
    "A New Kind of Space Race: Companies Vie Over Market For Satellite-Enabled Phone Calls",
    "5 HR strategies for managing dynamic career trends with analytics",
    "FBI misused surveillance tool on Jan. 6 suspects, BLM arrestees and others",
    "FBI misused intelligence database in 278,000 searches, court says",
    "FBI Searched Jan. 6 Rioters and George Floyd Demonstrators in Spy Database",
    "The FBI Broke The Law Over 278,000 Times With Illegal Searches On Americans",
    "FBI misused surveillance authorities to investigate Black Lives Matter protesters",
    "FBI repeatedly misused surveillance tool, unsealed FISA order reveals",
    "FBI issued 278,000 improper searches in 2021: filings",
    "POV: The FBI will keep abusing personal data until we end Section 702",
    "Gee they would never break the law would they? They do, every day. https://twitter.com/...",
    "Mistakes were made — 278,000 times. https://twitter.com/...",
    "FinTech firm Percent secures $29.7m in oversubscribed Series B funding",
    "Private credit marketplace platform Percent lands $29.7m Series B funding",
    "Private debt delivers calm waters in storm of volatility",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "Character.AI: Build something smarter than you.",
    "Airtable: What will you make?",
    "TikTok: Inspire creativity and bring joy.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Adobe: Let’s create experiences that matter.",
    "Figma: Make design accessible to everyone.",
    "Stripe: Help us build universal payments.",
    "Techmeme: You might have heard of us...",
    "(BNS) @BradyDale On SBF, FTX, All The Stuff",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "China says Micron's products fail security review, bars some purchases",
    "China says US chip maker Micron failed security review",
    "Bitcoin's Price Faces Bleak Outlook as Selling Pressure from Miners Surge",
    "Strike Goes Global Adding USDt Support and Enhanced App Unveiled at Bitcoin 2023 Conference",
    "Strike Relocates Global Headquarters To El Salvador, Expands Presence To 65 Countries",
    "Strike Expands Services To 65 Global Markets, Moves Headquarters To El Salvador",
    "Strike moves global headquarters to El Salvador, expands bitcoin payments to 65 countries",
    "Bitcoin Payments App Strike Expands to More Than 65 Countries From Three",
    "Strike moves global headquarters to El Salvador, expands to 65 countries",
    "Bitcoin Wallet Strike Expands Support to 3 Billion People, Targets Global South",
    "Max Keiser Says XRP And All Cryptocurrencies Are Securities, Except For Bitcoin — Here's Why",
    "Dennis Duffy was ahead of his time. https://www.wsj.com/...",
    "US presidential candidate accepts campaign donations in bitcoin",
    "Mobile pet game Peridot is an adorable, expensive ruse",
    "it was the pokemon IP that made it a hit, not the AR https://twitter.com/...",
    "This website has a fake commenter problem  —  https://www.ft.com/...",
    "UK banking licence eludes Revolut amidst financial scrutiny and executive exodus",
    "SoftBank Butts Heads with Revolut Over Plan to Secure Banking License",
    "Revolut's Application For A UK Banking License May Be Rejected",
    "Not terribly surprising. https://twitter.com/..."
]