[
    "Data Protection Commission",
    "European Data Protection Board",
    "Real Facebook Oversight Board",
    "@profcarroll@federate.social",
    "Our Response to the Decision on Facebook's EU-US Data Transfers",
    "Data Protection Commission announces conclusion of inquiry into Meta Ireland",
    "1.2 billion euro fine for Facebook as a result of EDPB binding decision",
    "Meta Fined $1.3 Billion for Violating E.U. Data Privacy Rules",
    "noyb win: € 1.2 billion fine against Meta over EU-US data transfers",
    "EU hits Meta with record €1.2B privacy fine",
    "Meta Fined Record €1.2 Billion in EU Over US Data Transfers",
    "Meta hit with record-breaking $1.3 billion fine over Facebook data transfers to the US",
    "Facebook given record $1.3 billion fine, given 5 months to stop EU-US data flows",
    "E.U. slaps Meta with record $1.3 billion fine for data privacy violations",
    "EU slaps Meta with $1.3 billion fine for moving data to US servers",
    "Facebook to be fined £648m for mishandling user information",
    "Meta: Facebook owner fined €1.2bn for mishandling data",
    "Meta slapped with record $1.3 billion EU fine over data privacy",
    "Facebook hit with record €1.2 billion GDPR fine for transferring EU data to US",
    "Meta fined $1.3B for violating EU GDPR data transfer rules on privacy",
    "The EU's $1.3 billion blockbuster Meta fine shows it's the de facto global tech regulator",
    "Facebook owner Meta expected to face record fine over transfer of European data to US servers",
    "European watchdog fines Meta $1.3 billion over privacy violations",
    "Meta fined a record $1.3 billion over EU user data transfers to the U.S.",
    "Meta hit with a record-breaking $1.3 billion fine over data privacy breaches",
    "Facebook owner Meta hit with record €1.2bn fine over EU-US data transfers",
    "That Meta GDPR fine is €1.2B.  Plus biz must stop sending EU data to US",
    "Meta fined $1.3 billion by EU for privacy violations",
    "Meta fined $1.3 billion for violating European data privacy rules",
    "EU, U.S. data transfer pact expected by summer, EU Commission says after Meta fine",
    "As Meta is hit with EU data ban and $1.3 billion fine, what happens next?",
    "Meta fined €1.2B in the EU for moving users' data to the US",
    "Meta fined record $1.3 billion and ordered to stop sending European user data to US",
    "Meta fined record $1.3 billion by EU over handling of Facebook user data",
    "Meta Receives €1.3 Billion Fine For Sending EU Facebook Data to the US",
    "Meta Fails Yet Again To Protect Users Data in Major New €1.3b GDPR Order",
    "CCIA Statement on Irish Decision Regarding EU-US Data Transfers",
    "EU regulators fine Meta a record-breaking $1.3B for data privacy violations",
    "Meta Fine, Not Fine  —  DATA PROTECTIONDATA PROTECTION BY DESIGNDATA STRATEGYTECH TRENDS",
    "Meta's $1.3 Billion Fine Is a Strike Against Surveillance Capitalism",
    "Meta hit with $1.3 billion fine over Facebook's EU-US data transfers",
    "Breaking Meta fined €1.2 billion by Irish data watchdog",
    "EU hands Meta record $1.3 billion fine over data transfers to US",
    "EU hits Meta with $1.3 billion fine for transferring European user data to the US",
    "Facebook Ordered to Suspend Data Transfers to US From Europe",
    "Meta Executives Respond to Record $1.3 Billion GDPR Fine",
    "Meta Was Just Fined a Record-Breaking $1.3 Billion by E.U. Regulators",
    "EU fines Meta €1.2bn over transfer of data to US",
    "Facebook hit with record $1.3B fine in European privacy case",
    "Facebook owner Meta fined €1.2bn for mishandling user information",
    "Meta slapped with massive $1.3B fine for EU-U.S. data transfers",
    "Meta receives record €1.2bn GDPR fine for US data transfers",
    "Facebook privacy breach sees parent company Meta fined a record $1.3B",
    "Meta's new record-setting EU fine is nearly as big as its last six combined",
    "Irelands slaps Meta with $1.3B fine over GDPR data privacy violations",
    "Meta's €1.2bn fine for breaching GDPR could have a big impact on EU-US data transfers",
    "EU Fines Meta A Record $1.3 billion For Violating EU Privacy Law",
    "Meta gets hit with a $1.3 billion fine by the EU for sending personal data to the US",
    "Meta Platforms receives $1.3B European fine for failure to protect user data and privacy",
    "Meta hit with record-breaking $1.3 billion fine over Facebook data transfers",
    "Meta ordered to pay a $1.3 billion fine because they're bad with data",
    "Irish DPA Finally Fines Facebook",
    "Meta hit with record €1.2 billion fine for transferring European Facebook user data to the US",
    "Meta fined 1.2 billion euro for violating GDPR in the EU",
    "Facebook Fined €1.2 Billion for Transferring EU User Data to the US",
    "Meta Issued Record-Breaking $1.3 Billion Fine for Mishandling Data",
    "Meta Fined €1.2bn for Violating GDPR",
    "EU fines Facebook $1.3 billion for privacy violations",
    "EU slaps Meta with $1.3 billion fine over data privacy concerns",
    "Meta Fined $1.3bn In Europe's Largest GDPR Punishment to Date",
    "EU Regulators Fine Meta $1.3B Over Data Transfers",
    "Facebook Owner Meta to Challenge Historic €1.2 Billion Fine",
    "EU Slaps Meta With Record €1.2 Billion Fine Over Sending User Data To US",
    "Meta breached your privacy for the sake of adverts — and has been fined $1.3bn as a result",
    "Meta Down 1.4% Premarket After $1.3B Fine Over US Data Transfers",
    "Meta hit with €1.2B fine over data privacy rules",
    "Facebook's Meta fined a record $1.3 billion for transferring EU users' data to the US",
    "Biggest fines under EU privacy law",
    "Facebook Fined $1.3B — Zuckerberg Furious in GDPR Fight",
    "EU regulators hit Meta with record $1.3B fine in data privacy inquiry",
    "Meta slapped with record $1.3 billion fine over EU-US data transfers",
    "Meta Fined Record $1.3 Billion in EU Over US Data Transfers",
    "The fact these privacy rules don't apply to the EU's own governments is also very funny",
    "This is quite the graph.... https://twitter.com/... [image]",
    "EDPB binding decision on Fb data flows has now been published: https://edpb.europa.eu/...",
    "The clock counter on Facebook is now ticking. #GDPR https://www.tickcounter.com/ ... [image]",
    "@om Regulation is the friend of the incumbent. Especially US regulation.",
    "Meta data is the new oil - https://twitter.com/...",
    "It's always fun when reporters don't respect embargoes.",
    "@JohnSullivan@mastodonapp.uk",
    "‘Verified’ Twitter Accounts Spread Pentagon Explosion Hoax",
    "Multiple verified accounts on Twitter share fake Pentagon blast pic",
    "AI-Generated Hoax of Pentagon Explosion Sparks Brief Market Sell-Off",
    "Fake Image Of Explosion Near Pentagon Went Viral—Even Though It Never Happened",
    "Fake image of Pentagon explosion goes viral",
    "Fake Pentagon explosion photo caused a real dip in the stock market",
    "Pentagon explosion hoax goes viral after verified Twitter accounts push",
    "AI-generated photo of fake Pentagon explosion sparks brief stock selloff",
    "Faked Images of Pentagon Explosion Circulate on Twitter",
    "AI-Generated Image of Pentagon Explosion Caused Markets to Dip",
    "Fake image of a Pentagon explosion briefly goes viral",
    "Large Explosion near The Pentagon Complex in Washington D.C. - Initial Report",
    "Ah yes, no-one saw this coming. https://www.vice.com/...",
    "New Twitter is fraud-friendly https://twitter.com/...",
    "This election season is gonna be hell with AI-assisted disinformation. https://twitter.com/...",
    "Russian propaganda now running with this lie. https://twitter.com/...",
    "Twitter bug sees deleted tweets resurrected for some users",
    "A Twitter bug is reviving deleted tweets and retweets",
    "Twitter bug seems to be randomly restoring deleted tweets",
    "Twitter users report deleted tweets return, won't delete",
    "Those tweets you deleted might be back online without your knowledge",
    "Twitter's latest bug reportedly restores deleted tweets and retweets",
    "New Twitter bug is restoring deleted tweets for hundreds of users",
    "Everything is going well here at twitter dot com. https://www.theverge.com/...",
    "Oh crap! Thanks to @jjvincent for the reporting on this. https://www.theverge.com/...",
    "lol lmao good luck in EU courts Elon https://twitter.com/...",
    "How soon before our DM end up in our public timeline? https://artifact.news/...",
    "Google's Photos App is Still Unable to Find Gorillas",
    "Wait what? https://twitter.com/...",
    "Oak Ridge National Laboratory",
    "US supers maintain grip on Top500 list as China seemingly hides its powers",
    "Early Frontier users seize exascale advantage, grapple with grand scientific challenges",
    "Top500: Frontier Gains 92 Petaflops; Henri Gets a Little Greener",
    "TOP500 List Updated With Frontier Remaining At The Top",
    "AMD-powered Frontier supercomputer remains top dog and boosts performance",
    "Top500 List Shows AMD Leading With 121 Supercomputers In Its Bag, 168 Powered By NVIDIA GPUs",
    "TOP500 supercomputers list: US continues to dominate, number of AMD-powered systems increases 29%",
    "Frontier still reigns as world's fastest supercomputer",
    "AMD Now Powers 121 of the World's Fastest Supercomputers",
    "Nvidia, HPE Announce Superchip-Powered ‘Isambard 3’ Supercomputer",
    "NVIDIA Grace Drives Wave of New Energy-Efficient Arm Supercomputers",
    "NVIDIA Notches a Modest Grace Superchip Win at ISC 2023",
    "Nvidia chips away at Intel, AMD turf in supercomputers",
    "Nvidia Has Gone Big Into AI. Its Chips Will Now Power Supercomputers.",
    "Now You Can Edit Your WhatsApp Messages",
    "WhatsApp Users Can Now Edit Messages For Up to 15 Minutes",
    "WhatsApp will now let you edit messages with iMessage-style time limit and more",
    "WhatsApp adds iMessage-like editing with a 15 minute window",
    "WhatsApp allows users to edit messages with 15-minute time limit",
    "You Can Now Edit Sent Messages on WhatsApp—If You're Fast Enough",
    "WhatsApp introduces ‘edit within 15 minutes’ function for messages",
    "WhatsApp now lets you edit your messaging nightmares - here's how to do it",
    "WhatsApp finally rolls out message editing for the masses",
    "Introducing WhatsApp's latest superpower: edit your sent messages!",
    "WhatsApp allows users to edit messages",
    "WhatApp is borrowing one massive iMessage feature, and it's about time",
    "You can finally edit messages on WhatsApp",
    "You can edit messages on WhatsApp, Finally!",
    "Mark Zuckerberg announces new feature that lets users edit WhatsApp messages",
    "Message editing is coming to WhatsApp",
    "You can finally edit WhatsApp messages, with one major limitation",
    "WhatsApp is finally letting everyone edit sent messages with the latest update",
    "WhatsApp gains the ability to edit sent messages across chats",
    "WhatsApp finally lets you fix typos in sent messages",
    "WhatsApp Says You Can Now Edit Messages",
    "WhatsApp finally rolls out the ability to edit messages",
    "WhatsApp Now Lets You Edit Messages for 15 Minutes After Sending Them",
    "WhatsApp Now Lets You Edit Your Messages",
    "WhatsApp Now Lets You Edit Messages (But You Have To Be Quick)",
    "WhatsApp finally allows you to edit sent messages",
    "WhatsApp's latest update lets you edit messages within 15 minutes of sending them",
    "WhatsApp Now Lets You Edit Messages Within 15 Minutes Of Sending",
    "WhatsApp Edit Messages feature soon to be there",
    "Editable WhatsApp messages are coming to help you fxi silly typos",
    "WhatsApp Is Getting iMessage-Like Edit Feature",
    "WhatsApp Messenger Gets Ability to Edit Sent Messages",
    "You can now edit your WhatsApp messages up to 15 mins after they're sent!  😅",
    "Uber Puts Diversity Head on Leave After Worker Backlash Over 'Don't Call Me Karen' Events",
    "Uber Diversity Chief Suspended After Events on Race Spark Uproar",
    "Uber suspends diversity chief over 'Don't Call Me Karen' events",
    "Uber diversity exec put on leave after hosting 'Don't Call Me Karen' panel",
    "Uber suspended its DEI chief after she hosted events titled “Don't Call Me Karen”",
    "Uber's 'Don't Call Me Karen' Diversity Chief Placed on Leave",
    "Uber's diversity chief put on leave after complaints of insensitivity",
    "This is everything all at once https://www.nytimes.com/...",
    "General Secretariat of the Council of the European Union",
    "Proposal for a Regulation laying down rules to prevent and combat child sexual abuse",
    "Apparently Spain wants to ban E2E encryption. https://www.wired.com/...",
    "Governance of superintelligence  —  Now is a good time to start thinking about the governance …",
    "OpenAI CEO Sam Altman lays out his company's view of AI regulation.",
    "International Atomic Energy Agency",
    "Does code have a governance body? https://twitter.com/...",
    "“future AI systems dramatically more capable than even AGI” 🤔 https://openai.com/...",
    "App Spotlight: Australian Public Holidays for Zoho CRM",
    "Introducing speech-to-text, text-to-speech, and more for 1,100+ languages",
    "Meta's open-source speech AI recognizes over 4,000 spoken languages",
    "Meta AI open-sources tools for self-supervised training of speech recognition models",
    "Meta's Open Source AI Project Can Identify 4,000+ Spoken Languages",
    "Preserving the World's Language Diversity Through AI",
    "We're open sourcing another new AI model today that we call Massively Multilingual Speech. …",
    "International Business Times",
    "South Korea signals its chipmakers can fill gap after China's ban on Micron",
    "China's Micron ban creates chip dilemma for Samsung, SK Hynix",
    "With Ban on Micron, China Escalates Microchip Clash With U.S.",
    "US Expresses ‘Serious Concerns’ About China Move Against Micron",
    "Micron expects revenue impact following China ban",
    "China bans Micron from being used for major infrastructure projects in the country",
    "China's Micron ban highlights chipmakers' dilemma as Sino-U.S. tensions grow",
    "China wants U.S. to meet it halfway and fix ties",
    "Who will benefit from China's Micron ban?",
    "China bans US chipmaker Micron from key infrastructure projects",
    "Samsung and SK Hynix May Benefit From China's Micron Ban",
    "Micron Stock Sinks on China Sales Ban. Why Intel, Nvidia, AMD Look Safe for Now.",
    "China Says US Chipmaker Micron Failed National Security Review",
    "China says US chipmaker Micron failed security review",
    "China bans major chip maker Micron from key infrastructure projects",
    "Revelations of surveillance misuse complicate policy fight",
    "Beijing Bans Micron as Supplier to Big Chinese Firms, Citing National Security",
    "South Korea's SK Hynix shares rise slightly after China fails U.S. rival Micron in security review",
    "China bars Micron chips from critical infrastructure purchases",
    "China bans chip maker Micron from its key information infrastructure",
    "China bans Micron's products from key infrastructure, citing security risk",
    "China Bans Micron Chips Claiming They Pose a Risk to National Security",
    "China imposes sales restrictions on Micron as it escalates tech battle with Washington",
    "China bans Micron's products from key infrastructure over security risk",
    "China Bans Micron Chip Sales",
    "Chinese agency claims U.S. chipmaker Micron poses national security risk",
    "China bans US chipmaker Micron in apparent retaliation for sanctions",
    "China imposes sales ban on Micron citing national security risks",
    "Beijing bans Chinese companies from using Micron chips in critical infrastructure",
    "3 US chip stocks to watch as China cracks down on Micron",
    "Monday, May 22, 2023  —  More layers of uncertainty, demonetization, BTC payments and more",
    "China bans chip maker Micron from key infrastructure projects",
    "China hits back, bans major US chip maker Micron",
    "China bans Micron chips over “network security risks”",
    "China bans Micron chips over security concerns",
    "Pressure mounts on Korean chipmakers as China restricts Micron chip sales",
    "China hits back, bans chips from US company",
    "China Issues Ban on US Chipmaker Products",
    "China chip stocks rally after Beijing said U.S. chip giant Micron is ‘major security risk’",
    "China bans Micron chips in key infrastructure over ‘national security’ risks",
    "China Bans Some Sales of Chips From U.S. Company Micron",
    "China Bars Purchases of Micron Chips, Escalating US Conflict",
    "China bars US chipmaker Micron from key infrastructure projects",
    "China Goes Ahead with Micron Technology Sales Ban",
    "China tells tech manufacturers to stop using Micron chips, stepping up feud with U.S.",
    "China Limits Use Of Chips From US-Based Micron Over Security Concerns",
    "China bans Micron products after security review finds unspecified flaws",
    "China fails Micron's products in security review, bars some purchases",
    "China Orders Halt To Using Micron Chips Claiming Security Concerns In Rising Tech War",
    "China Bans Micron Chips in Wake of Cybersecurity Review",
    "Attacker Takes Over Tornado Cash DAO With Vote Fraud, Token Slumps 40%",
    "Tornado Cash DAO Attacker Proposes Restoring Governance Control",
    "Tornado Cash attacker to potentially give back governance control, proposal reveals",
    "Tornado Cash attacker proposes to return control",
    "DeFi has rough weekend with Aave and Tornado Cash chaos",
    "Tornado Cash Attacker Funnels 360 ETH Through Crypto Mixer After Weekend Governance Exploit",
    "Hijacker's Remorse in Tornado Cash Governance Tussle?",
    "Tornado Cash Hacker Hints of Undoing Attack Pushing Price of Torn Up by 10%",
    "Tornado Cash attacker considers returning governance control",
    "Tornado Cash attacker creates proposal that could restore governance",
    "Tornado Cash Attacker Proposes To Give Back Control, TORN Price Spikes | Coingape",
    "Hackers Exploit Sanctioned Crypto Mixer Tornado Cash, Unleashing Chaos",
    "TORN price dumps 50% after attacker takes over Tornado Cash DAO",
    "Tornado Cash DAO suffers hostile takeover",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "TikTok: Inspire creativity and bring joy.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Adobe: Let’s create experiences that matter.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Airtable: What will you make?",
    "Techmeme: You might have heard of us...",
    "Mon. 05/22 - Meta Hit With Biggest Ever GDPR Fine",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "US District Court, District of Montana",
    "TikTok sues Montana over new law banning the app",
    "TikTok, Citing First Amendment, Sues Montana Over Impending Ban",
    "TikTok sues Montana over controversial state ban",
    "TikTok sues Montana over a controversial new law banning the app in the state",
    "TikTok is suing Montana over law banning the app in the state",
    "TikTok sues Montana to reverse state's ban of the app",
    "TikTok files lawsuit against Montana over download ban",
    "TikTok Sues Montana Over State's Ban of Its Service",
    "TikTok Inc. v. Austin Knudsen",
    "Social media expert discusses consequences of changes for TikTok, Twitter",
    "TikTok Sues Montana Over New Law Banning The App",
    "Montana Has Already Been Sued Over Its TikTok Ban",
    "Content creators sue to block Montana's TikTok ban",
    "President Biden nominates a fresh face to break FCC deadlock",
    "President Biden Announces Federal Communications Commission Nominees",
    "Biden names Democrat Anna Gomez as nominee for fifth FCC seat",
    "Biden nominates telecom attorney Anna Gomez to FCC after more than two years of deadlock",
    "Biden Names FCC Picks, Pushes for Democratic Majority at Deadlocked Agency",
    "FCC Nominee Anna Gomez is an FCC and NTIA Veteran",
    "Biden nominates Anna Gomez for FCC commissioner vacancy",
    "Biden Nominates Telecom Attorney Anna Gomez as FCC Commissioner",
    "Biden to nominate Dem Anna Gomez for key FCC seat after Gigi Sohn flap",
    "Board resolutions face shareholder pushback",
    "FlowX.AI Raises USD35M in Series A Funding",
    "FlowX.ai Raises $35M in Groundbreaking Funding to Accelerate Enterprise Digitization with AI",
    "AI enterprise innovator FlowX.AI rakes in $35m, eyes global expansion",
    "Romanian insurtech FlowX.ai raises $35M in a Series A round",
    "He Was Investigating Mexico's Military. Then the Spying Began. https://www.nytimes.com/...",
    "Web3 Move-to-Earn App STEPN Integrates Apple Pay for In-Game Purchases",
    "Web3 Lifestyle App STEPN Integrates Apple Pay for In-Game Purchases",
    "Blockchain Gaming Platform STEPN Integrates With Apple Pay, Here's What We Know",
    "Massive for crypto apps - congrats ⁦@Stepnofficial⁩! https://www.theblock.co/...",
    "Professor Falsely Students of ChatGPT Plagiarism",
    "Applied Materials to Spend Up to $4 Billion in Silicon Valley Thanks to Chips Act",
    "Silicon Valley company plans to build $4-billion computer chip research center",
    "Meta and data, chips and dips, crypto and meltdowns",
    "Silicon Valley Business Journal",
    "Applied Materials to create multibillion-dollar R&D facility in Silicon Valley",
    "Applied Materials to invest $4 bln in Silicon Valley chip research center",
    "Applied Materials to Build $4 Billion Chip Research Facility in Silicon Valley",
    "Semiconductor manufacturer to invest $4B for new facility in California",
    "Vice President Kamala Harris to Visit Bay Area Monday",
    "Patient21 Raises $108 Million to Expand Digital Health Platform",
    "Dentistry software provider Patient21 raises healthtech's biggest round of 2023",
    "Patient21 Nabs $108M To Expand In-Person Health Care Offerings",
    "Patient21 Raises €100M in Series C Funding",
    "iPhone maker Wistron calls it quits, saying Apple didn't allow it to make a profit",
    "Wistron is Selling Its India iPhone Assembly Business to Tata Group [Report]",
    "Wistron quits making iPhones in India to focus on Vietnam",
    "Unable to make a profit, Wistron is giving up iPhone assembly in India",
    "Wistron To Exit Apple's India Business, Bengaluru Plant To Be Acquired By Tata Group",
    "Wistron drops out of iPhone assembly in India",
    "Bitcoin miner revenue derived from fees drops to 7%",
    "Global Crypto Mining News (May 15 to May 21)",
    "Bitcoin Mining  —  Mining Purpose and Function:  —  Miners are an essential component …",
    "Ordinals boost Litecoin and Dogecoin's network activities",
    "Bitcoin Mining Revenue Surges after Increased Interest in Memecoins and NFTs on Blockchain",
    "Dogecoin, Litecoin Transactions ‘Spike’ After Ordinals Intervene",
    "Bitcoin Blockchain Continues to See Growth in Ordinal Inscriptions and BRC20 Tokens",
    "@dangillmor@mastodon.social",
    "Lemon Group's Cybercriminal Businesses Built on Preinfected Devices",
    "Popular Android TV boxes sold on Amazon are laced with malware",
    "Don't buy these Android TV boxes — they come pre-loaded with malware",
    "Amazon Sold Android TV Boxes Infected with Malware: Report",
    "Select Android TV Streaming Devices Reportedly Sold Loaded with Malware; Is Your Data Affected?",
    "Millions of Android devices are infected with malware before they leave the factory",
    "Popular Chinese Android TV boxes are preloaded with malware: Report",
    "Millions of Android Phones and TVs May Come with Preinstalled Malware"
]