[
    "AI Funding Explosion: Inflection AI Nabs $1.3B, Runway and Typeface Also Raise Big",
    "Inflection lands $1.3B investment to build more ‘personal’ AI",
    "Inflection AI raises $1.3 bln in funding from Microsoft, others",
    "Microsoft and Nvidia join $1.3bn fundraising for Inflection AI",
    "Inflection AI: Maker of Personal AI Chatbot Raises $1.3 Billion from Microsoft and Others",
    "Inflection AI Announces $1.3 Billion of Funding Led by Current Investors, Microsoft, and NVIDIA",
    "Reid Hoffman personally invested in ...the AI company he co-founded? https://www.forbes.com/...",
    "Not concerning at all https://twitter.com/...",
    "@therealahall@infosec.exchange",
    "@colincornaby@mastodon.social",
    "@emilygorcenski@indieweb …",
    "@MagentaRocks@mastodon.coffee",
    "@juandesant@astrodon.social",
    "Twitter's New Chief Eases Into the Hot Seat",
    "Inside Linda Yaccarino's ambitious plan for Twitter 2.0",
    "Twitter's new chief working on plans to bring advertisers back to platform - FT",
    "@emilygorcenski@indieweb.social",
    "wait what why would you hire someone with an active non-compete clause https://twitter.com/...",
    "love how nobody's business plan is “make the site good” https://twitter.com/...",
    "Linda Yaccarino's vision for Twitter 2.0 emerges",
    "Microsoft CEO says he wants to end Xbox exclusives but blames Sony",
    "Microsoft CEO claims he'd ‘love to get rid of console exclusives entirely’",
    "Activision's Bobby Kotick says he made ‘a bad decision’ not bringing Call of Duty to Switch",
    "Microsoft CEO Says Call of Duty to ‘100%’ Stay on PlayStation",
    "Microsoft CEO Satya Nadella claims he has “no love” for video game exclusivity deals",
    "Sony's PlayStation chief says publishers hate Xbox Game Pass",
    "Bobby Kotick Says He Wouldn't Put ‘Call Of Duty’ On Xbox Game Pass Or Other Services",
    "Microsoft CEO Wants To “Get Rid” Of Console Exclusives",
    "Microsoft CEO Satya Nadella says exclusive Activision games make no sense",
    "Sony's Deal For Call Of Duty Only Includes One More Game",
    "Microsoft CEO Satya Nadella Says $75 Billion Activision Deal Won't Block Competition",
    "Not Supporting the Switch Was “a Bad Decision on My Part” - Activision CEO",
    "Microsoft, Sony CEOs Clash in FTC Trial Over Console Exclusives and Game Pass",
    "Sony's Call of Duty Deal With Activision Only Includes One More Game",
    "Microsoft CEO Satya Nadella blames Sony for console game exclusives",
    "FTC documents reveal how much money Sony makes from Call of Duty",
    "Microsoft CEO Would ‘Get Rid’ of Console Exclusives if He Could",
    "Microsoft CEO Satya Nadella admits he doesn't love console game exclusives",
    "Microsoft CEO: If It Were Up To Me, I'd Get Rid of Exclusives",
    "Will the Biggest Tech Merger of All Time Go Through?",
    "Microsoft CEO Satya Nadella says Call of Duty to ‘100%’ stay on PlayStation",
    "Microsoft, Activision CEOs expected to urge US judge to allow $69 billion merger",
    "Microsoft's CEO Wants To Get Rid Of Console Exclusives Entirely",
    "Satya Nadella wants to remove all game exclusivity: ‘I have no love for that world’",
    "Microsoft's CEO Isn't A Fan Of Console Exclusives, Blames Sony",
    "Microsoft Wants to Offer Games That Work on Every Device",
    "Sony Says Current CoD Contract For PlayStation Ends After 2023's Game",
    "Activision would likely ditch Microsoft takeover if FTC pauses deal",
    "Microsoft's Lineup of Exclusive Games Draws Fire From Deal Foes",
    "Activision CEO wouldn't put Call of Duty, other titles on Xbox Game Pass",
    "@BrendanSinclair@mastodon.social",
    "Microsoft CEO blames Sony for Xbox exclusive games like Starfield",
    "The Risks of Cutting Off China",
    "Massive PlayStation leak reveals Call of Duty revenues and first-party game budgets",
    "Sony Accidentally Revealed How Deeply Loyal Call Of Duty Players Are",
    "Both TLOU Part II and Horizon Forbidden West cost over $200 million to develop",
    "Sony court documents removed after redacted details spotted",
    "Sony Made A Truckload Of Cash From Call Of Duty Players In 2021",
    "Sony accidentally reveals trade secrets by using sharpie marker",
    "Leaked PlayStation intel reveals shocking number of Call of Duty players only play CoD",
    "Sony Accidentally Reveals Major PlayStation Game Budgets",
    "Call Of Duty's Worth to PlayStation May Have Been Revealed by Sony",
    "Sony's secrets: Poor redactions show first-party development costs",
    "Sony accidently reveals confidential Call of Duty player and revenue data",
    "Sharpie scanning goof reveals major PlayStation budgets and revenues",
    "The Last of Us Part 2 and Horizon Forbidden West cost Sony over $200m to develop each",
    "Sony accidentally reveals budgets for Horizon Forbidden West, The Last of Us Part 2",
    "Sony Knew Call of Duty Was a Major Revenue Driver, But Still Didn't See It as a Threat",
    "Sony just spilled confidential Playstation information because of a Sharpie",
    "I never liked COD but Sony's loss is huge if Microsoft acquisition acquisition is done",
    "Sony's Confidential PlayStation Secrets Just Spilled Because of a Sharpie",
    "Niantic Organizational Update",
    "Pokémon GO maker says Apple Vision Pro validates their work as it closes studio and cancels games",
    "Niantic shutters LA office, lays off 230 employees",
    "‘Pokémon Go’ developer Niantic is laying off 230 employees",
    "Niantic lays off staff and shuts down games as it focuses on Pokémon Go",
    "Niantic cancels projects, closes LA office to prioritize Pokémon Go",
    "Pokemon Go Maker Niantic Closes Studio, Cancels Games",
    "Pokemon Go maker Niantic lays off 230 employees, cancels games",
    "Pokemon Go still “top priority” as Niantic lays off 230 employees",
    "Pokemon Go Dev Cancels Marvel Game, Lays Off 230 People",
    "Pokémon Go developer Niantic laying off hundreds of staff",
    "Niantic lays off 230 staff, cancels two games, closes LA studio",
    "Niantic lays off 230 employees and cancels Marvel AR game",
    "Pokémon Go maker Niantic laying off hundreds, cancels NBA and Marvel games",
    "Niantic cuts hundreds of jobs and shuts down multiple games to focus on Pokémon Go",
    "@WarnerCrocker@mastodon.social",
    "@mercedesallen@mastodon.social",
    "@jeffjarvis@mastodon.social",
    "@joshmcconnell@mastodon.nz",
    "Google will pull news links in Canada in response to new law",
    "Google Will Remove Canadian News From Search Over New Law",
    "Google to block news links in Canada over law on paying publishers -statement",
    "Our approach to news regulation",
    "Google to scrap local news links in Canada over Online News Act",
    "A Massive Own-Goal for the Government: Google to Stop News Links in Canada Due to Bill C-18",
    "This went well for other countries that went this route... https://twitter.com/...",
    "Transparency and brand safety on Google Video Partners",
    "Ad-Fraud Claims Could Force Google to Pay Billions. But Don't Hold Your Breath.",
    "The Problem With ‘Independent’ Third-Party Verification On YouTube (Is That It Ain't)",
    "Did Google mislead advertisers about TrueView skippable in-stream ads for the past three years?",
    "Google Accused of ‘Ad Fraud’ and Misleading Advertisers",
    "YouTube Ramps Ups Its Efforts In Fight Against Ad Blockers",
    "Google may have misled dozens of advertisers and violated its own guidelines - report",
    "YouTube is about to get VERY aggressive with ad blockers",
    "New Research Suggests that Google Misled Advertisers Over Video Ad Placement",
    "Do Google's video ads violate its standards? A new report claims the tech giant “misled” buyers.",
    "Google accused of mis-selling ads on third-party websites for years",
    "Google reportedly violates its own standards in third-party ad deals 80% of the time",
    "Google's video ads are shortchanging advertisers and failing standards, report claims",
    "New AI-powered Microsoft Shopping tools arrive on the new Bing and Edge",
    "Microsoft Adds New AI-Powered Shopping Tools in Bing and Edge",
    "Microsoft gives Bing and Edge new AI tools to help you shop",
    "Bing will now surface AI-generated buying guides",
    "Microsoft will use AI to help you save money online when shopping with Edge and Bing",
    "Microsoft Taps Bing AI to Generate Shopping Guides",
    "Bing adds new AI-powered shopping tools",
    "Microsoft announces new AI-powered shopping tools in Bing and Edge",
    "New AI-based Microsoft Shopping features added to Bing search, Bing Chat, and Edge browser",
    "Microsoft announces new AI-powered Microsoft Shopping tools on the new Bing and Edge",
    "New Bing and Edge features give online shopping an AI makeover",
    "Bing with ChatGPT now produces AI-generated shopping guides for you",
    "@danilo.redeem-tomorrow.com",
    "As Reddit protests turn to porn-bombing, advertisers face increasing brand safety concerns",
    "Reddit protest updates: news on the apps shutting down and Reddit's fights with mods",
    "Minecraft Developers Are Dropping Reddit For Community Feedback",
    "Minecraft Developers Leave Subreddit with 7.5m Members amid Controversial Reddit API Changes",
    "Minecraft developers quit Reddit after company's controversial changes",
    "Minecraft Devs Are Leaving the Subreddit Behind",
    "Mojang leaving official Minecraft subreddit amid current protests",
    "Is Minecraft subreddit shutting down?",
    "Mojang ends official support for Minecraft subreddit",
    "Minecraft Subreddit Loses Support From Devs Who Disapprove Of Reddit Changes",
    "Minecraft Will No Longer Use Reddit In Light Of The API Changes",
    "Minecraft Developer Mojang Quits Reddit Citing API Change, Protests",
    "What was that shit Spez said? “Redditors will get over it”? https://www.reddit.com/...",
    "So Long, and Thanks for All the Feedback",
    "@dangillmor@mastodon.social",
    "@EshuMarneedi@mastodon.social",
    "Reddit Is Already on the Rebound",
    "Reddit Threatens Subs to Go Public Again, or Else...",
    "Reddit tells protestors to reopen subreddits",
    "New Communities + Beehaw is once again looking for community moderators",
    "Reddit is telling protesting mods their communities ‘will not’ stay private",
    "FTC prepares “the big one,” a major lawsuit targeting Amazon's core business",
    "FTC reportedly plans major antitrust lawsuit against Amazon",
    "FTC Preps for Battle With Amazon. It's the Big One.",
    "FTC Set to File Major Amazon Antitrust Suit Over Marketplace Practices",
    "Amazon Faces Broadscale FTC Antitrust Suit",
    "Amazon to soon face big FTC antitrust suit over online marketplace power, report says",
    "U.S. antitrust regulator plans to target Amazon's online marketplace - Bloomberg News",
    "GOP chairs accuse FTC's Khan of ‘misleading Congress’ over ‘ethical failure’ in Meta probe",
    "Binance Dropped by Paysafe for Euro Deposits and Withdrawals",
    "Binance to lose support of its euro banking partner",
    "Binance's European banking partner Paysafe to withdraw support",
    "Binance Loses European Banking Partner Paysafe",
    "Binance Loses Another Banking Partner Amid Global Regulatory Storm",
    "Binance's European Banking Partner, Paysafe, To Withdraw Support On September 25",
    "Binance Faces Another Blow as EUR Banking Partner Halts Support in September",
    "Binance's EUR banking partner announces plan to halts support",
    "Binance's euro banking partner pulls support - Why?",
    "Binance loses euro banking Paysafe amid global regulatory scrutiny",
    "Binance hit by two further banking setbacks in Europe",
    "Binance's European Banking Service Provider Paysafe to Halt Support",
    "Binance loses Euro payment partner; denied licensing in Germany",
    "Binance to change euro banking partner from September",
    "Binance's European Banking Partner Paysafe Withdraws Support",
    "Binance EUR Banking Partner to Halt Support of the Crypto Exchange in September",
    "An Interview with Marc Andreessen about AI and How You Change the World",
    "@mattburgess@infosec.exchange",
    "Pornhub accused of abusing user data",
    "Pornhub Is Being Accused of Illegal Data Collection",
    "How AI Influences What You See on Facebook and Instagram",
    "The AI behind unconnected content recommendations on Facebook and Instagram",
    "Meta really wants to explain its AI recommendation algorithms to you",
    "Meta explains how its AI decides what you see on Facebook and Instagram",
    "Meta expects recommendation models ‘orders of magnitude’ bigger than GPT-4. Why?",
    "Meta reveals how its AI systems show you posts on Facebook and Instagram",
    "Meta Shares How AI Dictates Instagram and Facebook Feeds",
    "Meta's new feature will tell you all about reels that you on Instagram, Facebook",
    "Meta explains how AI influences content on your Facebook and Instagram feeds",
    "Meta Offers A Glimpse Into the Black Box of AI Ranking",
    "Meta's system cards show how AI powers content recommendations on Facebook and Instagram",
    "Is this when you desperately want your stock to go up? https://twitter.com/...",
    "Online Hate and Harassment: The American Experience 2023",
    "More than half of Americans have experienced online harassment, says ADL report",
    "‘Dramatic increase’: Online harassment rates surge by 51% in a year, ADL report reveals",
    "‘I have over 30 threats to rape, kill, or assault me’: Being a doctor on social media",
    "Over half of Americans have faced online hate, survey finds",
    "New Report Suggests That Hate Speech via Tweet Has Increased Under Elon Musk",
    "Over half of Americans report targeted online harassment - ADL survey",
    "More than half of Americans have experienced online hate and harassment, report finds",
    "More than 50 percent of Americans report facing online harassment, hate: survey",
    "TSMC sending more workers to speed up building of new Arizona plant",
    "TSMC to Send More Taiwanese Workers to U.S. to Speed Up Arizona Fab",
    "TSMC Arizona chip plant over budget and behind schedule; US workers blamed",
    "TSMC's Arizona headache and a surprise chip deal in Japan",
    "TSMC sends more Taiwanese workers to finish Arizona plant",
    "TSMC (Taiwan Semiconductor) to send hundreds more workers to speed U.S. plant construction",
    "Runway, a startup building generative AI for content creators, raises $141M",
    "Inflection, Runway and Stability get new funding as capital pours into generative AI startups",
    "AI company Runway valued at $1.5 bln in latest funding -source",
    "Runway Raises $141M in Addiditional Series C Funding",
    "Runway raises $141 million to continue building the future of creativity",
    "More gasoline for awesome things! https://twitter.com/...",
    "Bitpanda Pro spins out under Josh Barraclough, raises €30 million",
    "Bitpanda Pro spins out as One Trading and raises €30M",
    "One Trading springs from Bitpanda Pro rebrand and secures $33m investment",
    "Bitpanda crypto exchange spins out with €30m funding",
    "Bitpanda Pro Morphs to One Trading after Closing Series A Funding Round with €30 Million",
    "Tiger Global rejects low bids, aims for cash through startup stakes",
    "That's a lot of words to say “no bid” and “inflated marks” https://twitter.com/...",
    "AI-generated text is hard to spot. It could play a big role in the 2024 campaign",
    "Exploring How Image Upscalers Can Integrate Into Existing Design Workflows & Tools",
    "Free compensation benchmarking data from 3,000 startups",
    "Snapchat+ gains 4 million paying subscribers in its first year",
    "Snapchat+ reaches 4 million paid subscribers since launching a year ago",
    "Snapchat+ gained four million subscribers in its first year",
    "Snapchat+ hits 4 mln paid subscribers",
    "Snapchat has found more than 4 million people willing to pay it $4/month",
    "Snapchat+ subscription hits 4 million paid subscribers",
    "Report: Snapchat Now At 4 Million Paid Subscribers",
    "Pretty damn impressive https://twitter.com/...",
    "Meta oversight board wants Cambodian leader's account suspended",
    "Oversight Board overturns Meta's decision in “Cambodian prime minister” case",
    "Oversight Board Tells Facebook to Remove Video of Cambodian Prime Minister Threatening Opponents",
    "Cambodian leader Hun Sen, a huge Facebook fan, says he is jumping ship to Telegram",
    "Cambodian PM Hun Sen's Facebook account faces 6-month ban",
    "Cambodia PM Hun Sen accused of inciting violence on social media",
    "Meta's Oversight Board urges Facebook to suspend Cambodia's Prime Minister",
    "Meta oversight board orders firm to take down video by Cambodian leader",
    "Meta Oversight Board Urges Cambodia Prime Minister's Suspension from Facebook",
    "Cambodia PM ditches Facebook as Meta mulls case over alleged threats",
    "Official Tesla Support For Third-Party API-Based Services Is Coming, What Could This Mean?",
    "Narwhal will continue to be available even after the new API pricing kicks in on July 1st",
    "Personalized wealth management, built for tech people",
    "App Spotlight: Phone and Email Verifier for Zoho CRM",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Adobe: Let’s create experiences that matter.",
    "Replit: From idea to software, fast.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Character.AI: Build something smarter than you.",
    "Figma: Make design accessible to everyone.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Lightmatter: Next-gen computing built for AI.",
    "Techmeme: You might have heard of us...",
    "Thu. 06/29 - Big Interesting (AI) Raises",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "U.S. Securities and Exchange Commission",
    "Fidelity Refiles For Spot Bitcoin ETF",
    "Exchange operator Cboe files with US SEC to list Fidelity's spot bitcoin ETF",
    "Fidelity Refiles Bitcoin ETF Application With SEC as BlackRock Renews Hope",
    "Fidelity becomes latest firm to re-up bid for spot bitcoin ETF",
    "Cboe filing shows plans for Fidelity spot bitcoin ETF",
    "Fidelity officially files for spot bitcoin ETF in second attempt",
    "Fidelity files new spot bitcoin ETF application, following BlackRock, Invesco",
    "Fidelity joins the rush for a bitcoin ETF, following BlackRock, Ark Invest and others",
    "Fidelity Officially Files for Spot Bitcoin ETF",
    "Crypto gets a boost following reports of Fidelity's imminent Bitcoin spot ETF filing",
    "Chinese food delivery giant Meituan acquires four-month-old AI startup for $234 million",
    "Meituan buys founder's months-old ‘OpenAI for China’ for $234M",
    "Meituan to buy all shares of AI startup Light Year from HongShan, co-founder",
    "Meituan buys out four-month-old AI start-up Light Year for US$281 million",
    "Meituan Buys Co-Founder's Months-Old AI Startup for $234 Million",
    "I see AI has reached the “acquisitions mad lib” stage.  [embedded post]",
    "Worldcoin launches in Germany and integrates with Okta's Auth0 platform",
    "Massachusetts man is offloading 2,200 vintage Z80 computers on eBay one at a time",
    "Why 2,000 Ancient PCs Mysteriously Appeared on eBay",
    "2,200 Forgotten Vintage Computers Are Being Liberated From a Barn in Massachusetts",
    "Apple seeks to fend off EU antitrust charge triggered by Spotify at hearing",
    "Apple to argue against EU antitrust charge at hearing triggered by Spotify",
    "Apple argues no more changes necessary to App Store policy in Spotify EU antitrust case",
    "Apple to defend itself against Spotify's antitrust accusations in the EU",
    "Apple says it already changed its rules enough to satisfy Spotify EU complaint",
    "Big tech corporate venture capital 🤝 generative AI startups",
    "AI Firm Typeface Valued at $1 Billion After Salesforce/Google Funding",
    "Typeface, which is building generative AI for brands, raises $100M at a $1B valuation",
    "Generative AI Platform Typeface Bags $100M in Series B, Hitting Unicorn Status",
    "Typeface lands $100M for its generative AI content creation engine",
    "Typeface Raises $100M in Series B Funding",
    "AI startup Typeface valued at $1 bln after Salesforce-led fundraise",
    "Typeface Raises $100 Million To Set Up AI ‘Content Factories’ For Enterprises",
    "Generative AI startup Typeface raises $100M to customize enterprise content creation",
    "Apple livestreaming through Chinese e-commerce apps, but no bargains to be had",
    "Oracle Ports Database to Arm-Based Ampere CPUs: Might Ditch Intel and AMD",
    "Oracle extends its flagship database to Ampere's computing chips",
    "Building Momentum for the Sustainable Cloud",
    "Oracle Increases Ampere's Momentum with New Database Support",
    "Oracle spending ‘billions’ on Nvidia chips this year",
    "Silicon Valley Business Journal",
    "Oracle is no longer buying Intel processors for its data centers",
    "Chip startup Ampere pitches climate-friendly data centers",
    "US tech ban and strong demand for AI chips in China is fuelling NVIDIA GPU smuggling",
    "Oracle Expands Database to Ampere Chips, Dealing a Blow to Intel",
    "Oracle spending billions on Nvidia chips this year, Chairman Larry Ellison says",
    "Oracle spending billions on Nvidia chips this year, Ellison says (Huge AMD News)",
    "Putting trust at the center of the next digital assets innovation cycle",
    "Mastercard Unveils Multi Token Network (MTN) to Scale, Secure Blockchain Tech",
    "Mastercard Building Ethereum-Based Blockchain App Store for Regulated Financial Apps",
    "Tokenized Deposits: Unlocking New Possibilities in Finance",
    "Mastercard Unveils Multi-Token Network (MTN)",
    "Mastercard UK To Test Tokenized Bank Deposits",
    "Local Government Federal Credit Union offerings",
    "Mastercard Ventures into Tokenized Bank Deposits with Multi-Token Network Pilot",
    "Mastercard Launches Digital Assets and Blockchain Initiative",
    "Putting trust at the center of the next digital assets innovation cycle.  Mastercard",
    "Microsoft, OpenAI sued for $3B after allegedly trampling privacy with ChatGPT",
    "OpenAI Sued for Using ‘Stolen’ Data, Violating Your Privacy With ChatGPT",
    "OpenAI and Microsoft face new class-action lawsuit over ChatGPT",
    "OpenAI and Microsoft Sued for $3 Billion Over Alleged ChatGPT ‘Privacy Violations’",
    "OpenAI sued for ‘stealing’ data from the public to train ChatGPT",
    "Lawsuit says OpenAI violated US authors' copyrights to train AI chatbot",
    "OpenAI Hit With Class Action Over ‘Unprecedented’ Web Scraping",
    "Microsoft and OpenAI face $3B lawsuit alleging privacy violations with ChatGPT",
    "The AI Arms Race and Why We Need to Come Together Now",
    "OpenAI, maker of ChatGPT, hit with proposed class action lawsuit alleging it stole people's data",
    "OpenAI and Microsoft Accused of Scraping and Exploiting Private Data for AI Training",
    "Microsoft and OpenAI sued for $3 Billion for breach of privacy with ChatGPT",
    "Explosive allegations: OpenAI faces lawsuit for data breach",
    "ChatGPT maker OpenAI hit with class-action lawsuit over alleged data theft",
    "OpenAI sued for allegedly ‘stealing’ data from millions",
    "OpenAI and Microsoft Hit With $3 Billion Data Theft Lawsuit",
    "ChatGPT Data Harvesting ‘Reminiscent’ of Clearview AI, Lawsuit Claims",
    "Case 3:23-cv-03199  —  Plaintiffs P.M., K.S., B.B., S.J., N.G., C.B., S.N., J.P., S.A. …",
    "Together on AI  —  We all believe in the power of AI.  And we all recognize the dangers.",
    "This is where I come to play …",
    "Well, I lasted less than a month of locking my ao3 fics to registered users. …",
    "OpenAI sued for $3B after allegedly trampling privacy with ChatGPT",
    "ChatGPT maker OpenAI faces a lawsuit over how it used people's data",
    "@ravirockks@infosec.exchange",
    "@kimzetter@infosec.exchange",
    "@metacurity@infosec.exchange",
    "SEC notices spark alarm for cyber executives",
    "Micron Expects to Debut GDDR7 Memory in 2024",
    "Micron to Introduce GDDR7 Memory in 1H 2024",
    "Expect GPU Upgrades in Early 2024 With the Launch of Micron's GDDR7",
    "Memory chipmaker Micron's sales down 57% as market bottoms out",
    "Micron still bumping along memory trough",
    "Chip maker Micron beats estimates on demand from booming AI, easing glut",
    "Micron Has China Problems, Too. Why the Stock Got Upgraded.",
    "Can the coming AI boom help Micron outrun negative China effects?",
    "Micron's stock rises as CEO says memory chip market has bottomed out",
    "Micron Technology, Inc. Reports Results for the Third Quarter of Fiscal 2023",
    "Chipmaker Micron beats revenue estimates on demand from booming AI",
    "Live news: Micron upbeat on revenue prospects but warns on impact of China ban",
    "Micron Earnings May Disappoint. The Outlook Is More Important.",
    "Micron is ‘at the bottom of this deep downturn,’ but ‘China complicates the recovery plan’"
]