[
    "Update on Sharing  —  Starting today, we will be sending this email to members …",
    "Netflix's password crackdown has started in the U.S.",
    "Netflix Launches Paid Sharing in U.S., Will Start Blocking Users With Unauthorized Passwords",
    "Netflix Password Sharing Crackdown Begins in the U.S.",
    "Netflix cracks down password-sharing in Malaysia: extra user slot costs RM13 per month",
    "Netflix's Password-Sharing Crackdown Finally Hits The US, Here's What It Means",
    "Netflix crackdown on password sharing reaches the UK",
    "Netflix's controversial password-sharing crackdown hits the US",
    "Want to share your Netflix account? That'll be an extra $8",
    "Adding Extra Members to Your Netflix Account Costs $8 a Pop",
    "Netflix's password sharing clampdown reaches the UK",
    "Netflix's password-sharing crackdown is here: How much it'll cost you now",
    "The Netflix password sharing crackdown is here. Check your inbox.",
    "Breaking: Netflix Announces Official Password-Sharing Policy, Notifies U.S. Customers of New Rules",
    "Netflix's password shakedown begins now, $8 per user",
    "Netflix password sharing in the United States: extra member slot costs more than the cheapest plan",
    "It's time: Netflix's account sharing fee is now live in the US for $7.99 a month per user",
    "Netflix's password crackdown has hit most markets: here's what you need to know",
    "Silicon Valley Business Journal",
    "Netflix has begun crackiung down on password sharing in the U.S.",
    "Netflix password sharing crackdown finally hits the United States",
    "Netflix paid password sharing hits the U.S., but Americans shouldn't be too worried",
    "Netflix expands password-sharing crackdown worldwide",
    "Netflix password sharing crackdown: What you need to know",
    "Netflix Password Sharing Crackdown Rolls Out in the U.S.",
    "Netflix U.S. Password Sharing Crackdown Begins, Joining Canada",
    "The Netflix crackdown on password sharing in the US has arrived",
    "Netflix password sharing crackdown has finally reached the US",
    "Netflix finally brings its password-sharing crackdown to the US, its biggest market",
    "Netflix Bill Comes Due As Streaming Giant Begins Clampdown On Password Sharing In U.S.",
    "Netflix Tells US Consumers to Stop Sharing Accounts",
    "Netflix begins its password sharing crackdown in the US and global markets",
    "Netflix Starts to Roll Out its Password Sharing Crackdown In The United States",
    "Netflix Announces Extra Member Tier as First Step of U.S. Password-Sharing Crackdown",
    "@campuscodi@mastodon.social",
    "Twitter Is a Far-Right Social Network",
    "DeSantis Set to Announce 2024 Run on Twitter With Elon Musk",
    "Florida college student who shared location of Elon Musk is now tracking Ron DeSantis",
    "Musk scores Daily Wire's full set of podcasts to put on Twitter",
    "Ron DeSantis to Join Elon Musk on Twitter Wednesday to Announce 2024 Run",
    "DeSantis sees a path to the White House — 240 characters at a time",
    "Musk's Twitter tries to recapture the political spotlight post Trump with DeSantis 2024 run",
    "Why YouTube is a tough place for kids podcasts",
    "Is Elon Musk's Twitter about to supplant Fox News?",
    "Explainer: What is Twitter Spaces where DeSantis will announce his presidential run?",
    "Elon Musk wants ‘someone fairly normal’ to be elected president in 2024",
    "Elon Musk is Set to Host Ron DeSantis' Presidential Campaign Launch via Twitter Spaces",
    "DeSantis to Announce 2024 Presidential Run in Interview with Elon Musk",
    "Ron DeSantis to Launch 2024 Presidential Run in Twitter Talk With Elon Musk",
    "Elon Musk will launch Ron DeSantis' presidential campaign on Twitter Spaces",
    "Elon Musk Is Going to Try to Make Ron DeSantis Cool",
    "DeSantis to Announce His 2024 Campaign Alongside Elon Musk",
    "Ron DeSantis to announce presidential bid in Twitter Space with Elon Musk",
    "DeSantis to announce 2024 bid on Twitter Spaces meeting with Elon Musk",
    "@lauren@mastodon.laurenweinstein.org",
    "Well this ‘analysis’ from the Times aged wonderfully... https://twitter.com/... [image]",
    "Musk hasn't even endorsed DeSantis and praised one of his opponents last week lmao [image]",
    "Unsafe levels of dork energy in one place https://twitter.com/...",
    "So much free speech, it's blinding. https://twitter.com/...",
    "This is a real slap in Fox's face https://www.semafor.com/... [image]",
    "Wonder if this is going to be the thing that makes Trump start tweeting again?",
    "Worth noting Sacks is belligerently isolationist on Ukraine https://twitter.com/...",
    "That's one way to make your candidate seem human! https://www.nytimes.com/...",
    "The guy DeSantis is launching his campaign with hasn't even endorsed him lmao [image]",
    "Elon Musk: Twitter must be politically neutral also Elon Musk: [image]",
    "With DeSantis campaign event, Musk seeks to shore up a sinking Twitter",
    "Ron DeSantis to announce presidential run on Elon Musk's Twitter",
    "The Official Microsoft Blog",
    "Microsoft Developer on YouTube",
    "@thekenyeung@mastodon.social",
    "Microsoft announces Windows Copilot, an AI ‘personal assistant’ for Windows 11",
    "Windows 11 is getting its own integrated AI assistant, powered by Bing Chat and ChatGPT",
    "Microsoft puts AI in the heart of Windows 11 with Windows Copilot",
    "Microsoft's Copilot and Bing AI plug-ins will be interoperable with ChatGPT",
    "Here are all the AI updates Microsoft announced at its developers conference keynote",
    "Empowering every developer with plugins for Microsoft 365 Copilot",
    "Hallelujah! Windows 11 is finally introducing RGB lighting standards",
    "Microsoft outlines framework for building AI apps and copilots; expands AI plugin ecosystem",
    "Copilot crazy? Microsoft shoe-horns AI assistant into Windows 11, Power BI, Analytics and more",
    "Microsoft Build 2023: Copilots & Plugins",
    "Bing Integrates With ChatGPT",
    "Here are the biggest announcements coming out of Microsoft Build 2023",
    "Microsoft wants you to think inside the Dev Box from July",
    "Windows Copilot: Your new AI assistant for Windows 11",
    "Microsoft integrates AI front & centre into Windows 11 with Windows Copilot",
    "Microsoft flaunts redesigned and modern File Explorer in Windows 11",
    "New Windows 11 File Explorer design gets teased by Microsoft during Build 2023",
    "Microsoft Build 2023: What businesses need to know",
    "Microsoft & OpenAI to create a new ecology of chat robot plugins",
    "Microsoft Build 2023: Every major AI and Bing Chat announcement",
    "Microsoft adds an AI copilot to Windows",
    "Microsoft launches generative AI tools for developers",
    "Windows Terminal is getting smart AI features thanks to GitHub Copilot",
    "A livestream of the Microsoft Build 2023 keynote",
    "Copilot is coming to Windows, and everywhere else! 🚀 https://twitter.com/...",
    "Off to the races!!!! https://blogs.microsoft.com/ ...",
    "Microsoft 365 Copilot is coming to Microsoft Edge",
    "The man who put Microsoft in the AI lead",
    "Build 2023: Microsoft Edge to Add New Business Experience, More",
    "Microsoft Edge gets AI-powered upgrades and these other new features",
    "Microsoft confirms 365 Copilot AI will be ‘natively integrated’ into Edge",
    "Bing Search is coming to ChatGPT",
    "With Windows Copilot, every Windows user can be a power user. https://blogs.windows.com/...",
    "Introducing a new era of AI-powered ads with Google",
    "Google Will Soon Show You AI-Generated Ads",
    "Here's how ads might look in Google's new AI-powered search experience",
    "Who Said What at Google's Advertising Exhibition",
    "Inside Google's plans for improving paid search with generative AI",
    "Google to test ads in generative AI search results",
    "Google debuts new generative AI advertising tools",
    "Google details plans for AI-generated ads in Search",
    "@chrismessina@mastodon.xyz",
    "New tools to help small businesses connect with online shoppers",
    "Google Product Studio brings AI-generated images to advertisers",
    "Google Announces New Generative AI Ad Tools at Marketing Live Event",
    "Google Unveils ‘Product Studio’ AI Tool for Small Businesses",
    "Yes, Google's AI-infused search engine will have ads",
    "Google Search Generative Experience integrates Search, Shopping ads",
    "The problem with the search engine business is that the money's in the searching, not the finding.",
    "Kane and Pia Muehlenbeck on YouTube",
    "First Impressions: Final Cut Pro for iPad",
    "Final Cut Pro and Logic Pro for iPad are here",
    "Apple releases Final Cut Pro and Logic Pro for iPad",
    "Hands on with Final Cut Pro and Logic Pro for iPad",
    "Final Cut Pro on iPad Feels Like a Great and Optional Upgrade",
    "Final Cut Pro and Logic Pro are finally available on your iPad - here's how to get them",
    "Final Cut Pro iPad hands-on - one of Apple's best multi-touch apps on iPad",
    "Final Cut Pro and Logic Pro for iPad now available on the App Store",
    "Final Cut Pro for iPad Reviews: Worth the Wait, But Some Limitations",
    "Apple Brings Final Cut Pro And Logic Pro To iPad",
    "The biggest features missing from Final Cut Pro for iPad at launch",
    "2023 Apple Design Awards finalists announced",
    "What's It Like to Use Apple's Final Cut Pro on an iPad?",
    "Final Cut on iPad ushers in a new generation of video editors",
    "Final Cut Pro For iPad 1st Review: Smooth, Fast And Affordable",
    "Final Cut Pro for iPad: Release date, features, compatibility, price",
    "Reviews: Final Cut Pro for iPad ‘still rendering,’ Logic Pro for iPad a ‘great’ DAW",
    "Apple Updates Final Cut Pro and Logic Pro for Mac to Support New iPad Apps",
    "FINAL CUT PRO FOR IPAD - First impressions for travel vlogging",
    "Why Apple is right about bringing Final Cut Pro and Logic Pro to iPad",
    "Final Cut Pro for iPad is finally here - and its secret weapon is the Apple Pencil",
    "Final Cut Pro on iPad is a game changer for content creators — here's why",
    "Final Cut Pro on the iPad: A surprisingly touching experience",
    "Final Cut Pro on iPad: Effortless Editing",
    "Apple Final Cut for iPad Review: Lots Here, But Some Things Still Missing",
    "Final Cut Pro on iPad is AMAZING - Hands on Review!",
    "Oh nooo, my beloved Markers are not in FCP for iPad 🥲",
    "@johnvoorhees@mastodon.macstories.net",
    "Final Cut Pro on iPad is working properly now and is glorious. [image]",
    "MacStories Hands-On: Podcast Editing with Logic Pro for iPad",
    "Apple Releases Final Cut Pro and Logic Pro for iPad",
    "Final Cut Pro and Logic Pro for iPad hands-on: High-end tools for a low-end price",
    "Logic Pro for iPad: Release date, features, compatibility, price",
    "Get creative: Final Cut Pro and Logic Pro launch for iPad",
    "Hands-On With Apple's Logic Pro for iPad",
    "Final Cut Pro and Logic Pro for macOS updated with new features and support for iPad apps",
    "Hands On With Apple's Logic Pro for iPad",
    "Logic Pro iPad hands-on - Apple proves that Pro apps can be for everyone",
    "Chinese Businesses Fueling the Fentanyl Epidemic Receive Tens of Millions in Crypto Payments",
    "Chinese companies selling synthetic opioid chemicals raked in $27M in crypto payments",
    "@ravirockks@infosec.exchange",
    "Google Mobile Vulnerability Reward Program Rules",
    "Google Launches Bug Bounty Program for Mobile Applications",
    "Google announced its Mobile VRP (vulnerability rewards program)",
    "Google Unveils Bug Bounty Program For Android Apps",
    "Google wants to pay you for finding security flaws in its biggest Android apps",
    "Find Android bugs, earn up to $30k",
    "Android should become a more secure platform thanks to new bug bounty program for Google apps",
    "Welcoming AI to the Microsoft Store on Windows",
    "Microsoft opens the door to allow more Android apps on Windows 11",
    "Build 2023: Microsoft Store Adds AI Hub and AI Summaries to Showcase AI Apps",
    "AI is headed to the Microsoft Store on Windows",
    "Microsoft bakes its Bing/ChatGPT bot into Windows 11",
    "ChatGPT Will Use Bing to Answer Questions",
    "Microsoft integrates Bing Search with ChatGPT, launches common plugins platform",
    "Microsoft to add Bing search to OpenAIs ChatGPT in battle with Google",
    "ChatGPT Adding Bing as Its Default Search Experience",
    "8 Key Factors to Consider When Testing AI Chatbots for Accuracy",
    "Google Bard AI Can Now Retrieve Images, And That's Just The Start",
    "Microsoft to Integrate Bing Search into OpenAI's ChatGPT",
    "Microsoft Build 2023: From ChatGPT on Bing to Azure AI, check latest announcement",
    "ChatGPT is about to integrate Bing and leave Google in the dust",
    "Apple announces multibillion-dollar deal with Broadcom for components made in the USA",
    "Apple announces multibillion-dollar agreement for 5G components made in US",
    "Apple Announces Multibillion-Dollar Deal With Broadcom to Make Components in the USA",
    "Apple strikes deal with Broadcom, sending stock higher",
    "Chip war: Apple strikes major US-made semiconductor deal",
    "Apple partners with Broadcom to build 5G components in the United States",
    "Apple Teamed Up with Broadcom for 5G Components",
    "Apple and Broadcom sign multi-year deal to develop made-in-USA chips",
    "Apple announces multibillion-dollar deal with Broadcom for U.S.-made chips",
    "Apple Partners with Broadcom in a Multibillion-Dollar Deal to Reduce Dependence on China",
    "FirstFT: Multibillion-dollar chip deal",
    "Apple Partners with Broadcom to Develop USA-Made 5G Components",
    "Born in the USA!  Broadcom will produce American-made RF modules for Apple",
    "Apple secures supply of 5G components as it signs new multibillion-dollar deal with Broadcom",
    "Apple inks multibillion-dollar deal with Broadcom for wireless components",
    "Apple expands US chip sourcing with multibillion-dollar Broadcom deal",
    "Apple touts multibillion-dollar Broadcom deal for 5G and wireless tech built in the US",
    "Apple agrees multibillion-dollar partnership with Broadcom for US-made 5G components",
    "Apple Signs Multibillion-Dollar Deal With Broadcom for 5G Parts",
    "Great to see this. Hope modems get better. https://www.apple.com/...",
    "APPLE ANNOUNCES MULTIBILLION-DOLLAR DEAL WITH BROADCOM FOR COMPONENTS MADE IN THE USA $AAPL $AVGO",
    "Department of Health & Human Services",
    "@caseynewton@mastodon.social",
    "Social Media and Youth Mental Health",
    "The surgeon general's warning is a wake-up call for social networks",
    "U.S. surgeon general warns that social-media use poses a ‘profound risk of harm’ to children",
    "Surgeon General Issues New Advisory About Effects Social Media Use Has on Youth Mental Health",
    "Social media could have a ‘profound risk’ on kids and teens, US surgeon general warns",
    "US Surgeon General says social media may be hazardous to teen health",
    "US Surgeon General warns social media is driving a mental health crisis in the young",
    "‘Profound risk of harm’: Surgeon General issues warning about youth social media use",
    "Social Media and Youth Mental Health: The U.S. Surgeon General's Advisory (Executive Summary)",
    "Building Happier: Social Media, Mental Health And What Parents Can Do",
    "Social media may harm kids.  US Surgeon General says so",
    "Social media could harm youth mental health, U.S. Surgeon General warns",
    "Social media is driving the teen health crisis, warns surgeon general, and Big Tech must act",
    "Social media is driving teen mental health crisis, surgeon general warns",
    "A guide to teens, smartphones and social media settings",
    "Social media can put young people in danger, U.S. surgeon general warns",
    "Surgeon general issues advisory about social media risks for kids",
    "Surgeon general warns social media is triggering teen mental health crisis",
    "Social media use is taking a toll kids' mental health. These 8 tips for parents can help",
    "U.S. surgeon general: We need a safety-first approach for kids on social media",
    "Social media risks for youth mental health highlighted in new surgeon general report",
    "Surgeon general issues urgent warning about kids and social media",
    "Surgeon General issues advisory that social media is contributing to youth mental health crisis",
    "This is really starting to feel like a moral panic https://www.nytimes.com/...",
    "Surgeon General's warning on social media. Better late than never. https://www.hhs.gov/...",
    "I... I don't think we need to draw the line at teenagers, tbh. https://twitter.com/...",
    "Spotify may use AI to make host-read podcast ads that sound like real people",
    "AI Voices Could Soon be Reading Ads on Spotify Podcasts",
    "Microsoft wants to help you build a website with Copilot AI",
    "Windows 11 to get a new AI assistant - Copilot",
    "Safety. https://twitter.com/...",
    "Build next-generation, AI-powered applications on Microsoft Azure",
    "Microsoft is helping developers build their own ChatGPT-compatible AI copilots",
    "Microsoft Build 2023: CEO Satya Nadella's Boldest Statements",
    "Microsoft CTO tells devs to ‘do legendary sh*t’ with AI at 2023 Build conference",
    "Integrate Zoho PageSense with Zoho Flow : Automate your website optimization workflows",
    "Center for Democracy and Technology",
    "Lost in Translation: Large Language Models in Non-English Content Analysis",
    "Sony claims PS VR2 sales are ahead of projections and is outselling original headset",
    "PlayStation is betting big on new franchises and live service games",
    "PSVR2 Sales at 600,000 Six Weeks After Launch, Sony Confirms",
    "Sony Confirms PSVR 2 Sold 600k Units Up To April, Outpacing Original PSVR Launch",
    "Sony Prepares ‘Aggressive’ Cloud Gaming Push in Coming Months",
    "Encoding of speech in convolutional layers and the brain stem based on language experience",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Adobe: Let’s create experiences that matter.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "Replit: From idea to software, fast.",
    "Discord: Building something you actually use.",
    "Character.AI: Build something smarter than you.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "Tue. 05/23 - Shutterstock Nabs Giphy",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "International Business Times",
    "Alibaba Cloud to cut 7 per cent of staff ahead of planned IPO",
    "Meta Layoffs: Partnerships And Marketing Divisions To Be Hit Hard, Report Says",
    "Alibaba's Cloud arm plans workforce reduction of 7% in overhaul: Report",
    "Alibaba's Cloud Arm to Cut 7% of Staff in Overhaul, Sources Say",
    "Alibaba Cloud to Downsize Headcount by 7%, with Layoff Signaling Beginning of Its Spinoff Process",
    "Alibaba Cloud is laying off 7% of its workforce",
    "TikTok CEO Chew: Montana's ban on the app ‘unconstitutional’",
    "The Exclusive College Club Training Student Influencers",
    "TikTok Responds to Montana Ban With a Lawsuit",
    "Tik Tok Sues Montana After State Passes Law Banning App",
    "Samsung's screens will check your blood pressure if the movie's too scary",
    "Samsung Sensor OLED Display Has Built-in Fingerprint Reader and Can Monitor Cardiovascular Health",
    "Samsung unveils a 12.4-inch rollable OLED panel",
    "Samsung shows off several exciting displays including one that expands more than 5 times",
    "Samsung Display exhibits new rollable screen and health-sensing OLED",
    "Samsung Display makes screen that can recognize several fingers",
    "Samsung's Next-Gen Display Will Read Blood Pressure and Heart Rate",
    "Samsung reveals OLED light-based blood pressure sensor",
    "Samsung Unveils OLED Touch Screen With Built-In Cardiovascular, Fingerprint Sensors",
    "Future Is Now: Samsung Unveils 12.4-inch Rollable OLED display",
    "Samsung's new OLED display tech has a built-in blood pressure sensor",
    "Windows 11 getting native support for 7-Zip, RAR, and GZ archives",
    "Ahoy, matey! Windows 11 will soon have native RAR support",
    "Windows 11 will soon extract RAR, 7z and other archive formats natively",
    "Microsoft uses open source to kill WinRAR by adding native .rar support to Windows 11",
    "Thanks for everything, WinRAR: Windows is finally getting native RAR support",
    "The most request feature of Windows XP is coming soon to Windows 11. https://www.techmeme.com/...",
    "Flipboard is ready to work with Bluesky and Pixelfed",
    "Peloton launches freemium app with new membership tiers and features",
    "Peloton the rebrand: High end exercise bike maker says it's now a health company for all",
    "Peloton Works to Stay Relevant With Massive Rebrand",
    "Peloton's revamped fitness app restricts most equipment workouts to new, more expensive tier",
    "Peloton App Gets a Free Tier",
    "Peloton Gym is a big step away from bikes — and it's completely free (EXCLUSIVE)",
    "Peloton app goes free and pricier https://www.bloomberg.com/...",
    "BuzzFeed's Chatbot Mistake, Bing's Big Goal",
    "Pixar meets The Last of Us movie about botulism toxin controlling a chef https://twitter.com/...",
    "A little too botulism evoking for me https://twitter.com/...",
    "Introducing Microsoft Fabric: Data analytics for the era of AI",
    "Microsoft Build 2023: Microsoft launches Fabric - a unified data and analytical tool",
    "Microsoft announces unified analytics platform Fabric",
    "Microsoft Build 2023: Microsoft Fabric and oodles of Azure AI integrations announced",
    "Microsoft Fabric Defragments Analytics, Enters Public Preview",
    "Microsoft is bringing an A.I. chatbot to data analysis",
    "Microsoft unveils Fabric analytics program, OneLake data lake to span cloud providers",
    "Microsoft debuts Fabric, a single, integrated data analytics platform for AI and business",
    "Anthropic Raises $450 Million in Series C Funding to Scale Reliable AI Products",
    "Anthropic Raises $450 Million to Fuel AI Work",
    "Google-backed Anthropic raises $450 million in latest AI funding",
    "AI Craze Hits New Level As Anthropic Locks Up $450M, Builder.ai Closes $250M Round",
    "Binance Denies Commingling ‘Billions’ in Customer Funds",
    "Binance denies commingling customer fund allegations | Curated CoinCodeCap #23 May 2023",
    "Former Binance Insiders Claim Exchange Commingled User Funds and Revenue: Report",
    "Binance Blasts Reuters Report It Mixed Customer/ Company Funds",
    "Binance Refutes Reuters' Claims of Commingling: “Story is so weak”",
    "International Watchdog Eyes Crypto's Future as Hong Kong Releases Rulebook",
    "Reuters Says They Stand by Its Reporting On Binance Commingling Customer Funds",
    "Binance accused of misconduct with user funds",
    "Binance Responds to Reuters Claims About Mixing User Funds",
    "More fraud over at Binance? You don't fucking say! https://www.reuters.com/...",
    "Following UK antitrust order, Meta sells Giphy to Shutterstock for $53M after buying it for $400M",
    "Shutterstock to Acquire GIPHY, the World's Largest GIF Library and Search Engine",
    "Meta has no choice but to sell Giphy at $262M loss to Shutterstock",
    "Shutterstock buys Giphy Inc from Meta for $53 million in cash",
    "Facebook owner Meta sells Giphy at a loss of more than $260m",
    "Shutterstock to buy Giphy from Meta Platforms for $53 million in cash",
    "Meta forced to sell Giphy, takes 87% loss in Shutterstock deal",
    "Meta sells Giphy to Shutterstock at a loss in a $53 million deal",
    "Giphy Sold by Meta for $53 Million to Shutterstock",
    "Giphy/Meta: the cost of doing business overseas keeps rising",
    "Meta sells Giphy to Shutterstock at huge loss following antitrust ruling",
    "Meta unloads Giphy in the fire sale of the year",
    "Meta Agrees to Sell Giphy to Shutterstock for a $347 Million Loss",
    "Shutterstock to buy GIPHY after CMA forced Meta to sell it",
    "Facebook Parent Meta Sells Giphy To Shutterstock For $53 Million Under Pressure From UK Regulator",
    "From $400M to $53M: Shutterstock Acquires Giphy from Meta at Fraction of Price",
    "Meta selling Giphy for fraction of purchase price",
    "Shutterstock to Acquire Giphy From Meta for $53 Million",
    "Shutterstock Acquires Giphy from Meta in $53 Million Deal",
    "Shutterstock picks up Giphy for $53 million after UK blocks Meta's acquisition",
    "Facebook Parent Meta Agrees to Sell Giphy for $53 Million on Regulator's Order",
    "How Meta's Acquisition of Giphy Went South",
    "Facebook tracking pixels to be smaller, much less funny. https://twitter.com/...",
    "Feels like a steal https://www.reuters.com/...",
    "Adobe to integrate AI into Photoshop amid fears of job losses and mass faking of images",
    "Adobe Adds Generative AI Features to Photoshop",
    "I Just Tried Photoshop's New AI Tool. It Makes Photos Creative, Funny or Unreal",
    "Adobe brings Firefly's generative AI to Photoshop",
    "Adobe supercharges Photoshop with Firefly Generative AI",
    "Adobe Unveils Future of Creative Cloud With Generative AI as a Creative Co-Pilot in Photoshop",
    "A.I. Photoshopping Is About to Get Very Easy. Maybe Too Easy.",
    "AI image generation comes to Photoshop with native Adobe Firefly integration",
    "Adobe is adding an AI-powered image generator to Photoshop",
    "Adobe introduces ‘generative fill’ to Photoshop with its Firefly AI tool",
    "Adobe adds generative AI editing to Photoshop",
    "Adobe's Firefly Image Generator Is Going to Make Photoshop Much Easier to Use,",
    "Photoshop is the first Adobe Creative Cloud app to get Firefly Generative AI",
    "AI is magic https://twitter.com/...",
    "Game over, thanks for playing [video]"
]