[
    "Microsoft wins FTC fight to buy Activision Blizzard",
    "Judge rejects FTC's attempt to block Microsoft's $69 billion Activision deal",
    "Microsoft wins FTC trial, can proceed with Activision Blizzard merger",
    "Microsoft Cleared to Buy Activision in US as UK Pauses Fight",
    "Judge shoots down FTC attempt to stall Microsoft-Activision merger",
    "Microsoft Can Close Its $75 Billion Buy of Activision Blizzard, Judge Rules",
    "Microsoft, Activision defeat FTC's bid to block $69B deal",
    "Judge paves way for Microsoft, Activision deal to close this month",
    "US approves Microsoft's Activision Blizzard deal, UK agrees to renegotiate",
    "Judge sides with Microsoft in FTC injunction, unlocking final Activision battles",
    "US judge rules Microsoft deal to buy Activision can go forward",
    "Judge Blocks FTC From Preventing Microsoft's Activision Bid",
    "Microsoft Prevails Over FTC: US Judge Denies Bid to Block Activision Deal",
    "Microsoft-Activision deal can proceed, US court rules",
    "US judge greenlights $69 billion Microsoft-Activision deal, FTC may appeal verdict",
    "Microsoft wins U.S. court nod to buy Activision in loss for FTC",
    "Judge denies injunction in Microsoft's Activision Blizzard acquisition",
    "The Hurdles That Remain for $69 Billion Microsoft-Activision Deal",
    "U.S. federal Judge Corley finally rules on Microsoft's Xbox-ABK deal: Microsoft WINS",
    "Microsoft Gets the Green Light to Purchase Activision Blizzard in Victory Over FTC",
    "S judge rules Microsoft deal to buy Activision can go forward",
    "Activision Blizzard Stock Surges 11% After Judge Rules on Microsoft Deal",
    "Microsoft Wins its US Court Case Over its Activision Blizzard Acquisition",
    "Microsoft wins US court nod to buy Activision in FTC loss",
    "The FTC's case against Microsoft's Activision acquisition is not going well",
    "Judge Denies FTC's Bid to Block Microsoft-Activision Deal",
    "Microsoft can go forward with Activision Blizzard purchase after court rules against injunction",
    "Microsoft has won its Activision Blizzard acquisiton case with the FTC",
    "Federal Judge Rejects FTC Effort To Halt Microsoft-Activision Merger",
    "Microsoft wins latest legal battle against FTC over Activision Blizzard acquisition",
    "US judge denies FTC attempt to block Microsoft's Activision deal",
    "Microsoft Beats US Regulator FTC in Activision Blizzard Buyout Battle",
    "Microsoft wins FTC case, removing Xbox's biggest Activision Blizzard acquisition hurdle",
    "Judge Rejects F.T.C. Delay of $70 Billion Microsoft-Activision Deal",
    "Microsoft Wins against FTC: Activision Merger Can Move Forward after Court Ruling",
    "Microsoft Wins Court Case Against FTC To Buy Activision Blizzard",
    "Microsoft gets US approval to buy Activision Blizzard",
    "Microsoft Wins Court Battle Against FTC Over Activision Blizzard Acquisition",
    "Microsoft can close its Activision merger, federal judge rules",
    "US Judge rejects FTC's injunction request against Microsoft's Activision Blizzard deal",
    "Microsoft Wins US Court Approval to Acquire Activision Blizzard",
    "Judge Rejects FTC Move to Halt $69B Microsoft-Activision Deal",
    "FTC v Microsoft: Judge Corley denies preliminary injunction in big win for Xbox",
    "Microsoft wins bid against FTC injunction to buy Activision Blizzard",
    "Game-Changing Decision: Microsoft Clears Path for Activision Blizzard Deal",
    "Judge won't block Microsoft's $69B takeover of video games giant Activision",
    "Judge rules for Microsoft in FTC fight over Activision",
    "Microsoft Beats FTC's Request for Preliminary Injunction to Block Activision Blizzard Deal",
    "Microsoft-Activision Deal Allowed to Proceed, Rules Judge",
    "Microsoft has won its US court case to acquire Activision Blizzard",
    "Our statement on today's decision: https://twitter.com/... [image]",
    "Can Microsoft save COD. That is the question for me. Also selfishly, lol. https://twitter.com/...",
    "Judge on Microsoft x Activision (and Sony). [image]",
    "Does this mean Diablo is now owned by Microsoft?",
    "FTC has been denied their preliminary injunction.  Judge Corley rules in favor of Microsoft",
    "A major milestone: Update on the Microsoft deal",
    "Microsoft's Activision acquisition moves ahead as judge rejects FTC injunction request",
    "UK antitrust regulator ready to consider revisions to Microsoft's Activision purchase",
    "Microsoft victorious over FTC lawsuit to block Activision Blizzard buy",
    "UK CMA Agrees to Renegotiate with Microsoft",
    "Phil Spencer's internal memo talks about Activision acquisition and the win against FTC",
    "Activision Blizzard Stock Jumps After FTC Ruling",
    "Microsoft allowed to complete Activision Blizzard acquisition in the US",
    "UK regulator and Microsoft pause litigation in bid to reach agreement on Activision deal",
    "Judge Rules That Nintendo Switch Is A Competitor To Microsoft/Sony Systems",
    "UK Antitrust Agency Pauses Microsoft-Activision Appeal on FTC Court Loss in US",
    "Microsoft wins against FTC, clearing vital hurdle for Activision Blizzard acquisition",
    "Activision Deal Likely to Pass in UK as the CMA Stays Legal Battle for Further Negotiations",
    "Microsoft to modify Activision Blizzard deal to address CMA UK's concerns",
    "Microsoft wins FTC court battle over $69 billion Activision Blizzard buyout",
    "Microsoft has one major hurdle left in its Activision Blizzard deal",
    "Microsoft and CMA pause appeal battle to negotiate on Activision Blizzard deal",
    "Microsoft And UK CMA Agree To Pause Legal Battle Over Activision Blizzard Deal",
    "FTC Injunction Denied by Judge in Microsoft's Acquisition of Activision Blizzard",
    "Our statement on the mutual request with the CMA for a pause of our appeal in the UK: [image]",
    "“Cloud gaming? Never heard of it. Anyway let's talk” https://twitter.com/...",
    "Microsoft and UK regulators agree to pause their Activision battle to negotiate",
    "@mranthropology.bsky.social",
    "Intel Exiting the PC Business as it Stops Investment in the Intel NUC",
    "Intel will stop making its own NUC mini PCs",
    "Farewell NUCs? Intel Halts Investment in Mini PC Business",
    "Intel announces BIG change to mini PCs — say goodbye to its NUC computers",
    "Intel sunsets Next Unit of Compute (NUC) product line",
    "Intel Halts Direct Investment In Popular NUC Business, Exiting Direct Consumer PC Sales",
    "Intel Exits NUC Business, Will Rely on External Partners",
    "Intel confirms nuking its NUC computer business",
    "Intel wird keine NUCs mehr anbieten",
    "Intel Kills the NUC, Will Stop Selling PCs",
    "Intel To Stop Producing NUC Mini PCs",
    "Intel NUC Sees The End of Road, OEM Partners To Continue Offering Mini PC Line",
    "Intel Will No Longer Make NUC Mini Computers",
    "Intel to Stop Making its Excellent NUC PCs, Opting to Use Partners Instead",
    "No more NUCs: Intel seemingly confirms that its nifty mini PCs are canceled",
    "Intel will no longer make NUC PCs, will pivot to support partners instead",
    "Intel Ends Direct Investment in NUC Business: Future Development Relies on Ecosystem Partners",
    "[ServeTheHome] Intel Exiting the PC Business as it Stops Investment in the Intel NUC",
    "Intel stops its NUC business",
    "@meredithmeredith.bsky.social",
    "@susanrinkunas.bsky.social",
    "@evilrobert.newrosehotel.co",
    "Meta-provided Facebook chats led a woman to plead guilty to abortion-related charges",
    "Nebraska mom pleads guilty to giving daughter pills for an abortion and helping bury the fetus",
    "Mother Pleads Guilty To Giving Daughter Abortion Pills, Burning and Burying Dead Baby",
    "It was disgusting and I get annoyed that so many media outlets leave out the details.",
    "Nebraska Mom Pleads Guilty to Giving Abortion Pills to Her Teen Daughter",
    "Mac shipments grow 10%, as all major PC brands see downturns",
    "Global PC market is continuing to collapse for everybody but Apple",
    "PC Shipments Drop Again in Q2, IDC Says",
    "IDC: PC Sales Fell 13.4 Percent in Q2",
    "Mac sales remain strong even as PC market continues to slump",
    "Global PC Shipments Continue to Dwindle in Q2 2023, IDC Reports",
    "Apple's Mac Sales Surge in Q2 2023, PC Shipments Decline: IDC",
    "Global PC market decline eases as shipments drop 12% in Q2 2023",
    "PC market stuck in 18-month rut due to weak demand and shifting budget priorities",
    "Should leaders place bets on new PCs or generative AI?",
    "Apple's Mac market share jumped even though PC sales fell for the sixth consecutive quarter",
    "Global PC shipments decline eases in Q2, Apple outperforms on MacBook Air demand - Canalys",
    "Apple Defies the Odds: Mac Sales Rise Amidst PC Industry Decline",
    "PC sales keep falling around the globe, so this could be a great time to upgrade",
    "Mac shipments return to growth but Windows keeps plunging",
    "IDC, Canalys both confirm Mac sales up, PC sales not up",
    "Apple was the only PC maker to post shipments growth in Q2 2023",
    "Mac shipments surge 10.3% as PC market craters",
    "IDC reveals that in 2Q23 Apple was the only PC maker to deliver shipment and market share Growth",
    "Claude 2  —  We are pleased to announce Claude 2, our new model.",
    "Anthropic's Claude Is Competing With ChatGPT. Even Its Builders Fear AI.",
    "Anthropic releases Claude 2, its second-gen AI chatbot",
    "Anthropic Debuts ChatGPT Competitor Claude 2",
    "Sapphire Ventures Commits $1B-Plus To AI-Powered Tech Startups",
    "Anthropic launches Claude 2 amid continuing AI hullabaloo",
    "Claude 2.0, Anthropic's Latest ChatGPT Rival, Is Here — And This Time, You Can Try It",
    "Anthropic — the $4.1 billion OpenAI rival — debuts new A.I. chatbot and opens it to public",
    "What is Claude 2? How to access this ChatGPT competitor.",
    "Anthropic Launches Claude 2 With 100k Context Windows, File Upload Capability",
    "Anthropic releases upgrade Claude 2 AI chatbot with improved safety and coding ability",
    "Anthropic releases Claude 2, a more capable, less gullible AI chatbot",
    "ChatGPT alternative: OpenAI competitor Anthropic's “Claude 2” chatbot is live",
    "Google-backed Anthropic startup upgrades its Claude AI, better at coding",
    "Anthropic's ‘friendly’ AI chatbot, Claude, is now available for more people to try",
    "Anthropic unveils Claude 2, an AI model that produces longer, safer responses",
    "Anthropic's Claude 2 Is The Latest ChatGPT Competitor",
    "Anthropic announces the second major release of its Claude large language model",
    "Introducing AnthropicAI's Claude 2",
    "Anthropic Releases a New Version of Its ChatGPT Rival, Claude",
    "@agreenberg@infosec.exchange",
    "Mentor to ‘Silk Road’ Drug Trafficker Gets 20 Years in Prison",
    "Silk Road adviser ‘Variety Jones’ sentenced to 20 years in prison",
    "Top Silk Road Advisor ‘Variety Jones’ Sentenced to 20 Years in Prison",
    "Silk Road's Second-in-Command Gets 20 Years in Prison",
    "End of an Era at Google DeepMind Hints at New Future for AI",
    "AI Researcher Who Helped Write Landmark Paper Is Leaving Google",
    "Introducing Phone (2) ft. Casey Neistat",
    "The Nothing Phone 2 is official, with a US price of $599",
    "Nothing's flashy Phone 2 lands in the US for $599",
    "Nothing Phone 2 Released - a fairly-priced mobile phone with decent specs",
    "Nothing Phone (2): Everything you need to know",
    "Nothing Phone (2) features SD 8+ Gen 1, 6.7-inch OLED display, 50MP dual camera",
    "The Nothing Phone 2 and Its Flashy Lights Debut at $599",
    "Nothing Phone 2 comes to the US on July 17th for $599",
    "Nothing Phone (2) vs Nothing Phone (1): which is best to buy now?",
    "Nothing Phone (2) doubles down on the brand's minimalist, low-key aesthetic",
    "Nothing Phone (2) goes official for $599 in the US - ask us anything",
    "Nothing Phone 2 arrives in the US starting at $599",
    "Hands-On With the New Transparent Nothing Phone",
    "Nothing's Phone (2) is up for preorder, starting at $599",
    "The Nothing Phone 2 has me excited about midrange phones again",
    "The Nothing Phone (2) arrives and seeks harmony with its refined aesthetics and 2.0 OS",
    "Nothing Phone 2: Improved Specs and Enhanced Customization — at a Higher Price",
    "I've used the Nothing Phone 2.  Here's why you'll love it",
    "Sleek and Stylish Nothing Phone 2 Has Upgraded 50MP Cameras",
    "Nothing phone (2) hands-on: A welcome second coming",
    "Nothing Phone (2) Hands-On: A True Android Flagship?",
    "Nothing Phone (2) launch event live stream: how to watch",
    "Nothing Phone (2) Hands-On: First Impressions With A Few Key Details",
    "Nothing Phone 2: Price, availability, specifications, and more",
    "Watch the Nothing Phone (2) keynote: Introducing Phone (2) ft. Casey Neistat @ 16:00 BST",
    "Real-Time Avatar Calls for When You're Not Camera-Ready and More",
    "Meta now lets you make video calls using a cartoon avatar",
    "Meta is going to let you make video calls as your avatar",
    "Real-time avatars for calls coming to Meta products",
    "All that money wasted on the Metaverse, at least they got some use out of it? [embedded post]",
    "Cybersecurity professional accused of stealing $9M in crypto",
    "‘Can I cross border with crypto?’: Hacker turned to Google after $9M DeFi raid",
    "New York Computer Security Engineer Indicted in $9 Million DeFi Fraud",
    "Feds Charge Engineer in First-Ever Decentralized Exchange Hack Case",
    "Just In: US DoJ Charges Engineer in First Attack on a Smart Contract",
    "AI Safety and the Age of Dislightenment",
    "Nick Clegg Is Driving Meta's Case for Open-Sourced AI",
    "Video Game History Foundation",
    "@PlayHistory@oldbytes.space",
    "87% Missing: the Disappearance of Classic Video Games",
    "87% of classic games are out of print. That's a problem for gaming history.",
    "Survey of the Video Game Reissue Market in the United States",
    "ESA expects publishers to fix preservation problem",
    "Vanishing act: 87% of classic video games are no longer available commercially",
    "Almost all classic US video games ‘critically endangered’",
    "Video Game History Foundation estimates 87 percent of “classic” games now unavailable",
    "The Disappearance of Classic Video Games",
    "An Alarming 87 Percent Of Retro Games Are Being Lost To Time",
    "87% of older video games are currently impossible to buy anywhere reveals report",
    "87% of classic video games are ‘critically endangered’, says game history organisation",
    "Classic games are ‘critically endangered’ according to new study",
    "87% Missing: the Disappearance of Classic Video Games |  Video Game History Foundation",
    "Google's AR efforts face more turmoil as lead exec quits over ‘unstable commitment’",
    "Google's AR Software Leader Departs Amid Concerns Over Company's Commitment and Vision",
    "Mark Lucovsky Leaves Google, Calls Company “Unstable”",
    "A Google exec resigns with a damning note about its XR ambitions",
    "Google loses senior director on secretive Project Isis augmented reality effort",
    "Googler leading XR OS quits, citing 'Google's unstable commitment and vision' for AR",
    "Google's AR/VR Operating System Engineering Director Quits",
    "?? did we know G had an AR arm? was that a thing? https://twitter.com/...",
    "Wow, big loss for G. https://twitter.com/...",
    "What is happening at Google? https://twitter.com/...",
    "Apple launches an online store on China's WeChat app",
    "Apple launches online store on China's giant WeChat messaging app",
    "Apple working on how to revolutionize iPhone and iPad cases",
    "Apple Expands Retail Reach in China with Official Store Opening on WeChat",
    "Apple opens official online store on Tencent's WeChat",
    "Apple's full product lineup is now available on WeChat, China's massive super app",
    "Apple opens store on China's WeChat platform: Details inside",
    "Apple has Launched a new online Store on China's WeChat messaging App",
    "iPhone buyers in China can now purchase Apple devices on WeChat, a messaging platform",
    "Apple opens online store on Chinese WeChat app",
    "Apple Launches Online Store Through WeChat in China",
    "Apple Debuts Store on Chinese Super App WeChat",
    "Apple Launches Online Store on China's WeChat Platform",
    "Apple Store launches as mini-app on WeChat platform in China",
    "Apple opens store on China's WeChat platform",
    "Apple Opens Store on China's WeChat Platform",
    "HCA Healthcare reports breach of 11 million patients' personal data",
    "Privacy update  —  For Immediate Release … HCA Healthcare Reports Data Security Incident",
    "HCA Healthcare breach compromises 11M patients' personal data",
    "1,000+ Facilities Impacted by HCA Data Breach",
    "11M HCA Healthcare Patients Impacted by Data Breach",
    "HCA Healthcare data breach impacts several Tampa Bay area facilities. Here's what you should know",
    "Medical City parent company reveals patient data breach affecting 11 million",
    "Florida patients among 11 million affected by HCA Healthcare data breach",
    "11 Million Patients Impacted in Healthcare Data Breach",
    "Razer investigates potential breach involving its digital wallet",
    "5 Things to Know Before the Stock Market Opens Tuesday",
    "Personal Information of 11 Million Patients Stolen in Data Breach at HCA Healthcare",
    "Data for Potentially Tens of Millions of HCA Healthcare Patients for Sale on Breach Forum",
    "HCA Healthcare data breach impacted 11 million patients",
    "HCA Healthcare Data Leak Appears to Be Theft",
    "Millions of HCA Healthcare customers have data stolen - here's what you need to know",
    "Teen hacked Uber, Revolut and Grand Theft Auto maker, London court hears",
    "Lapsus$ member hacked Uber, Revolut and Grand Theft Auto maker",
    "British prosecutors say teen Lapsus$ member was behind hacks on Uber, Rockstar",
    "Amazon claims it isn't a “Very Large Online Platform” to evade EU rules",
    "Obscure internet boutique Amazon sues EU for calling it a Very Large Online Platform",
    "Amazon Challenges EU's ‘Large Online Platform’ Law",
    "Amazon says it's ‘unfairly singled out’ by new EU digital rules",
    "Amazon Files Legal Challenge to EU Digital Services Act",
    "Amazon launches first Big Tech challenge to EU online content rules",
    "Amazon joins Zalando in challenging very large online platform designation",
    "Amazon makes first Big Tech challenge to EU online content rules",
    "Amazon tells court it shouldn't have to police its platforms for hate speech and disinformation",
    "28% GST on online gaming ‘unconstitutional, irrational, egregious’, says industry",
    "India's online gaming industry hit with 28% tax",
    "‘Implementation of 28% GST rate will bring challenges to online gaming industry’",
    "Online gaming tax raised to 28% on net revenue, industry expresses shock",
    "Free Figma template of onboarding & activation designs",
    "Clop Crime Group Adds 62 Ernst & Young Clients to Leak Sites",
    "Shutterstock's generative AI way forward: 6-year training data deal with OpenAI",
    "Shutterstock expands deal with OpenAI to build generative AI tools",
    "Shutterstock to Provide OpenAI with Training Data in New Partnership Deal",
    "Stocks Making the Biggest Moves Midday: Shutterstock, Newell Brands, Zillow and More",
    "Meta will label government accounts on Threads",
    "Meta's Transparency Drive: Labels & Fact Checking on Threads",
    "When Threads might get ads as user base booms",
    "Meta planning to bring its branded content tools to Threads: report",
    "Meta's Instagram to bring branded content tools to Threads - Axios",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Internal applications: App-solutely customized for your organization",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Lightmatter: Next-gen computing built for AI.",
    "Clear Street: Today's financial infrastructure.",
    "Replit: From idea to software, fast.",
    "Adobe: Let’s create experiences that matter.",
    "Fathom: The leader in medical coding automation.",
    "PayPal: Opening opportunities for all.",
    "Techmeme: You might have heard of us...",
    "Tue. 07/11 - A Meaningful Anti-Tracking Law",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Jul 11-12VentureBeat TransformSan Francisco",
    "Jul 26Samsung Galaxy Unpacked \"Join the Flip Side\" media eventSeoul",
    "Jul 26Earnings: META, EBAY, Samsung Electronics",
    "Aug 2Earnings: DASH, QCOM, HOOD, PYPL",
    "Aug 3Earnings: AAPL, BKNG, SQ, NET",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Discord introduces new opt-in parental controls for teens",
    "Discord bans AI-generated child sex abuse material and teen dating",
    "Discord, the Teen-Favored Chat Service, Is Finally Adding Parental Oversight",
    "Discord adds Family Center, giving parents overview of teen activity",
    "New Family Center tool gives parents better insight into their teen's Discord usage",
    "How to Use Discord's ‘Family Center’ Safety Settings for Your Kids",
    "Discord is making it easier for parents to keep track of what their teens are up to in the app",
    "EU to green light Broadcom's VMware deal on Wednesday, source says",
    "Broadcom's $61 Billion VMware Deal Set for EU Approval",
    "FTC Court Ruling Clears Path for Microsoft to Buy Activision",
    "Microsoft Wins FTC Brawl Over $69B Activision Blizzard Deal as Merger Nears Close",
    "FTC Loses First Bid to Block Microsoft's Acquisition of Activision Blizzard",
    "Savvy Raises $30M in Funding",
    "SaaS Application Security Firm Savvy Exits Stealth Mode With $30 Million in Funding",
    "Lining Up The “El Capitan” Supercomputer Against The AI Upstarts",
    "Tuolumne is El Capitan's Little Brother with 200+ PetaFLOPS Performance",
    "El Capitan Installation Begins: First APU-based Exascale System Shaping Up For 2024",
    "Installation of El Capitan supercomputer begins at Lawrence Livermore National Laboratory",
    "Here Are the Best NVIDIA GeForce and AMD Radeon GPU Deals for Amazon Prime Day",
    "Interesting that Microsoft isn't mentioned in this article at all [embedded post]",
    "HealthTech startup Verifiable lands $27m in Series B funding",
    "Verifiable Raises $27M in Series B Funding",
    "Tumblr's Core Product Strategy",
    "tumblr tuesday: something something something, we win.",
    "@Techmeme no mention of #ActivityPub 😔",
    "Tumblr, all you have to do is be Tumblr! https://www.theverge.com/... [image]",
    "Tumblr's core product strategy",
    "Tumblr says it's going to ‘fix’ its ‘core experience’ to appeal to new users",
    "Tumblr says it's going to “fix” its “core experience” to appeal to new users",
    "Google DeepMind CEO Says Company Can Outpace Open Source AI despite Recent Pessimistic Memo",
    "Google DeepMind CEO Demis Hassabis sees LLMs talking to experts as “next era” of AI",
    "That Google memo about having ‘no moat’ in AI was real — and Google's AI boss disagrees with it",
    "Report: China to tighten rules around releasing generative AI tools",
    "China Might Require Licenses to Release Generative AI Platforms",
    "China's search engine pioneer unveils open-source large language model to rival OpenAI",
    "Amazon's confusing payment strategy in India",
    "China vs EU: Which is Leading the Way in Strict AI Regulation?",
    "China to Enforce Stricter Rules for Generative AI Content to Maintain Government Control",
    "China's Web Watchdog Wants to License Generative AI Use",
    "Tata Group To Take Over Wistron's iPhone Assembly Unit In Karnataka",
    "Tata Group all set to acquire Apples Indian Supplier Factory",
    "Tata Group may soon be first Indian firm to manufacture iPhone",
    "Tata Group Close to Seal Deal on Becoming First Indian iPhone Manufacturer",
    "Tata-assembled iPhones coming up; Down rounds for Indian startups here to stay?",
    "Tata Group will become the first India-native company to build the iPhone",
    "India-based BluSmart rapidly expands fleet to up Uber, Ola competition",
    "Bangladesh e-Government Computer Incident Response Team",
    "Bangladesh Government Website Leaks Personal Data",
    "Bangladesh government fixes website that leaked personal data of 50 million citizens",
    "Data leak due to technical flaws, can't avoid liability: Junaid Ahmed",
    "Site's weakness to blame for exposing citizens' data: Palak",
    "Updated article, now that the data is secured https://twitter.com/...",
    "Forcepoint government cyber unit to be acquired in $2.45B deal",
    "TPG to Buy Forcepoint Unit From Francisco Partners for $2.45 Billion",
    "TPG to buy Forcepoint unit from Francisco Partners",
    "TPG to Acquire Forcepoint's Government Cybersecurity Business Unit",
    "TPG to buy Forcepoint's government cyber unit in a deal valued at $2.45 billion",
    "Forcepoint To Sell Government Unit To TPG, Creating ‘Leader’ In Zero Trust Security",
    "TPG to Buy Forcepoint's Government Security Unit for $2.45B",
    "TPG to buy Forcepoint's public sector cybersecurity business for $2.45B",
    "TPG Buys Forcepoint Unit From Francisco Partners for $2.45 Billion",
    "Debate over ‘fake work’ and ‘lazy management’ in tech industry",
    "John Battelle's Search Blog",
    "Not Boring by Packy McCormick",
    "@themckenziest.bsky.social",
    "@taylorlorenz@mastodon.social",
    "Why the Early Success of Threads May Crash Into Reality",
    "Elon Musk Blames the Lawyers",
    "Taliban Endorses Twitter Over Threads",
    "Twitter traffic is ‘tanking’ as Meta's Threads hits 100 million users",
    "Threads Update Will Include Chronological Feed of Followers",
    "Twitter traffic sinks in wake of changes and launch of rival platform Threads",
    "User Traffic Drops on Twitter as Threads Surpasses 100M Users",
    "Musk calls Zuckerberg a “cuck” and then asks to compare penises",
    "Twitter CEO declares the winner of social media war",
    "Zuckerberg's Threads hits 100 million users- What's in it for Chancer?",
    "Linda Yaccarino says Twitter saw its ‘largest usage day’ despite users flocking to Threads",
    "‘Meta Loses More:’ Zuckerberg Takes Threads Fight to EU",
    "At Threads, No News Is Good News, For Now. But That's About To Change.",
    "On Twitter a Personal Endorsement Has Value",
    "Elon Musk jet-tracking account banned from Twitter arrives on Threads with request for Zuckerberg",
    "Twitter's New CEO Strikes Back at Meta's Threads. Why It Might Be Good News for Tesla.",
    "Taliban endorses Elon Musk's Twitter for freedom of speech and credibility over Meta's Threads app",
    "Meta's Twitter rival Threads hits 100 million users in record five days",
    "The Elon Musk private jet tracker resurfaces on Threads and immediately goads Mark Zuckerberg",
    "Twitter traffic really is tanking, Cloudflare reveals, but is anyone that surprised?",
    "Suspended Twitter account tracking Elon Musk's jet moves to Threads",
    "Twitter's traffic is taking a dive, according to Cloudflare's CEO.",
    "Why did the worst person for the job take over my favourite app lol [embedded post]",
    "we're quickly nearing the end of the simulation [embedded post]",
    "Techmeme posts I never expected to see for $200 Alex.  [embedded post]",
    "Twitter traffic tanking. [Image: Cloudflare DNS rankings over time]",
    "@fentasyl I propose a literal dick measuring contest 📏",
    "@brettdash_ @charliewrich Censorship pays them well",
    "Excruciating flop sweat vibes. https://twitter.com/...",
    "The Taliban endorsing Twitter is a sign we're on a sinking ship https://twitter.com/...",
    "Jim Cramer has said: “Whatever Twitter can do, Zuck can do better”. [video]",
    "@lindayacc I spent over 25 hours a day on Twitter all weekend to support you and all of us here",
    "Now we know why Twitter recently allowed male enhancement product ads on its platform [image]",
    "i can't imagine why this platform is having a hard time attracting advertisers [image]",
    "A @Techmeme headline for the history books [image]",
    "META'S TWITTER RIVAL THREADS OVERTAKES CHATGPT AS FASTEST-GROWING PLATFORM $META",
    "The censorship on Meta's new app is insane. They even want to control whom you follow. [image]",
    "Elon: Protects free speech Zuck: Protects brand speech https://twitter.com/... [image]",
    "zuck's meat was on his mind for 8 hours I'm crying [image]",
    "bro came back 8 hours later for this [image]",
    "A story that would seem insane to anyone from 2021 https://twitter.com/...",
    "@SOClALRATE This platform will protect anons for this reason particularly",
    "Zuck is actually doing it lmaooooo [image]",
    "damn even Mark Zuckerberg is mocking Elon Musk's tweets now [image]",
    "The Taliban Endorses Twitter Over Threads",
    "Taliban says Meta is Intolerant, so it is sticking with Twitter instead of using Threads.",
    "Elon Musk goes low against Zuckerberg as Twitter-Threads spat intensifies"
]