[
    "San Francisco Business Journal",
    "@profcarroll@federate.social",
    "@Gartenberg@mastodon.social",
    "@film_girl@mastodon.social",
    "@ashfurrow@masto.ashfurrow.com",
    "@GossiTheDog@cyberplace.social",
    "@Cdespinosa@mastodon.social",
    "@jamesthomson@mastodon.social",
    "Introducing Apple Vision Pro: Apple's first spatial computer",
    "Apple reveals Vision Pro, available for $3,499 “early next year”",
    "Apple reveals its Vision Pro mixed-reality headset, starting at $3,499",
    "Apple's $3,499 Vision Pro AR headset is finally here",
    "This is Apple Vision Pro, the mixed reality headset for spatial computing",
    "Apple's Vision Pro headset deserves to be ridiculed",
    "Apple Vision Pro $3,499 mixed-reality headset launches at WWDC after years of rumors",
    "Apple reveals Vision Pro AR headset at its worldwide developers conference",
    "Today's ‘Quordle’ Answers And Clues For Tuesday, June 6",
    "Apple Vision Pro Headset Supports Prescription Inserts for Glasses Wearers",
    "Apple's new VR headset will feature over 100 Apple Arcade games at launch",
    "Apple takes a big swing in a failed category with its Vision Pro ‘AR’ headset",
    "Apple Vision Pro: Technical Marvel with WTF Pricing",
    "Apple's $3,499 Vision Pro Headset Will Test Marketing Might",
    "Apple will make dev kits available to help developers build and test apps for Vision Pro headset",
    "Metaverse? Apple thinks $3,500 AR ski goggles are the betterverse",
    "Live: Expectations of Apple's headset set to meet reality",
    "Apple unveils the Vision Pro, its long-awaited $3,500 mixed reality headset",
    "Who wants to pay $3,500 for Apple's new goggles?",
    "With Vision Pro, Apple shows computing's future. But who's it for?",
    "Apple unveils Vision Pro AR headset, updates Macs",
    "Apple's ‘Vision Pro’ Headset Wants to Be the $3,499 Anti-Metaverse",
    "Apple: Vision Pro headset looks good but offers no new ideas for VR",
    "Meta's heated rivalry with Apple enters new phase as the tech giants go after headsets",
    "Apple's Vision Pro might be the future, but right now, it feels stuck in the past",
    "Apple unveiled its long-awaited augmented reality headset",
    "Apple launches into virtual reality with impressive new headset",
    "Apple Vision Pro: Everything you need to know",
    "Apple Unveils $3.5K ‘Vision Pro’ Goggles",
    "Meet Apple's AR/VR Vision Pro headset: Price, features, release date, and everything else to know",
    "Apple Announces Vision Pro, its “Spatial Computing” Headset",
    "Apple unveils long-awaited Vision Pro mixed-reality headset at WWDC",
    "Apple Vision Pro AR headset unveiled at WWDC 2023",
    "Fans React to Apple Vision Pro Announcement With Memes, Shock Over Price Point",
    "Apple unveils Vision Pro AR headset",
    "Apple Vision Pro: Apple's big bet on a brand-new platform starts at $3,499",
    "Apple Unveils $3,500 ‘Spatial Computing’ Headset",
    "Apple unveils its first AR/VR headset, the Vision Pro",
    "Apple Vision Pro price is $3,499 — and everybody had the same reaction",
    "Apple reveals $3,500 Vision Pro AR headset that puts Meta's top-tier goggles to shame",
    "Apple WWDC 2023: Can Vision Pro headset jump start AR, VR, metaverse for business?",
    "Apple announces $3,500 Vision Pro XR headset",
    "Apple Finally Reveals Long-Awaited AR Headset, Vision Pro, Priced At $3,500",
    "Apple unveils sleek, $3,500 ‘Vision Pro’ goggles. Will they be what VR has been looking for?",
    "Apple Reveals $3,499 Vision Pro Augmented Reality Headset",
    "Apple Is Coming Out With A New VR Headset",
    "Apple launches Vision Pro, a VR headset it hopes will be most important product since iPhone",
    "New Apple Vision Pro XR headset puts the Quest Pro to shame",
    "Apple announces Apple Vision Pro, its long-awaited VR headset",
    "Apple just announced its first major product since 2014: The Vision Pro for $3,499",
    "Apple just revealed its first major product in over 8 years — meet the $3,499 ‘Vision Pro’",
    "Tim Cook unveils Apple Vision Pro mixed reality headset",
    "Apple launches its virtual- and augmented-reality headset: Apple Vision Pro",
    "Vision Pro: Apple's new augmented reality headset unveiled",
    "Apple unveils Vision Pro ‘mixed reality’ headset",
    "Apple launches Vision Pro, its first-ever augmented reality headset",
    "So to watch a movie with the family everyone is going to need to own one?",
    "VisionPro must not have the processing power required to render dinosaur feathers I guess",
    "M2 chip coupled for R1 for sensing.",
    "“Facial Video” is the new euphemism for home made porn.",
    "Apple going no controllers is so beyond stupid. There's no way this is a good idea",
    "The reaction to the price of the Apple Vision Pro though! 😂😭 [video]",
    "should i buy a used car or an apple vision pro",
    "Bloomberg Terminal on Vision Pro when",
    "I am looking at two 32\" monitors and it's a field of vision problem.",
    "Apple just made folding phones seem like a bargain.",
    "Meanwhile at Meta [Mark Zuckerberg's Eiffel Tower photo]",
    "It is everything I hoped for. Talk to you in a few minutes on Twitter Spaces.",
    "whatever you do, don't look into their ey.....! [image]",
    "Ok I used it. It's good. Real good. More soon. [image]",
    "I can't wait to see the first one of these in Starbucks.",
    "going to wear a vision pro into molotov's",
    "apple invents an augmented reality headset and they're like “so you can run safari in it”",
    "More or less exactly as rumoured. [image]",
    "Apple is so much better at this than Facebook.",
    "Did any leak get the name Vision Pro right?",
    "💯🥽 #WWDC23 https://twitter.com/... [image]",
    "Man, Meta's Reality Labs team must not be feeling too great today",
    "The first Macintosh was $2,495. Adjusted for inflation from 1984 that equates to $7,300 today.",
    "new reaction image just dropped [image]",
    "We're all about to look like we're scuba diving through real life. 🤿 [image]",
    "Lordy, this vision pro presentation is making Meta look like dogshit.",
    "Microsoft Excel, Word, and Teams in Apple Vision Pro [image]",
    "For all-day usage, remove weedwacker, attach Apple headset [image]",
    "“We studied thousands of heads”",
    "Their new Jony Ive sounds a lot like their old Jony Ive.",
    "Everyone saying before they weren't going to get Apple's headset just changed their mind.",
    "This is the video camera from Minority Report! #WWDC23",
    "i am absolutely gonna be wearing these to da club [image]",
    "3499 price. Early next year (!) on https://apple.com/ and retail stores. So, 2024",
    "At this point, I can't imagine my life without Apple Vision Pro. I'm serious. [image]",
    "How many things has Zuck thrown and broken so far https://twitter.com/...",
    "Funny joke @gruber 😜 [image]",
    "Standing in line for Apple Glasses.",
    "Room dims as things are played: Magic Leap 2 has this feature too, I thought it was cool",
    "Ah - here's why the stock dropped. Menswear guy isn't a fan https://twitter.com/...",
    "Dictating Typing Typing on glass Typing on air Dictating",
    "Here's the battery pack [image]",
    "deleting the email like [image]",
    "The killer app for AR. Infinite monitors. [image]",
    "Yep, don't think all the reports were to sandbag on the cost here... This tech is nuts. #wwdc23",
    "Steve wouldn't have named it Vision Pro though...",
    "Introducing Apple Vision Pro",
    "Apple Vision Pro — Game devs and rivals offer their reactions",
    "Apple introduces Apple Vision Pro",
    "I Do Not Hate The Apple Vision Pro, The First ‘Human’ AR/VR Headset",
    "Apple Vision Pro first look: Can this be worth $3,500?",
    "Apple Vision Pro is superior to Meta Quest 3 but is that a reason to spend on it",
    "Apple Unveils Vision Pro Mixed Reality Headset",
    "Apple Vision Pro, a Spatial Computer Headset, Revealed",
    "Apple Shows Off $3,499 Vision Pro XR Headset at WWDC",
    "Apple Vision Pro Chip Specs #wwdc23 - M2 - New R1 chip for sensors [image]",
    "mfw watching #WWDC23 [image]",
    "Me, accepting GDPR popups next year: [image]",
    "What to make of Apple's intriguing $3,499 Vision Pro headset",
    "Apple announces new Vision Pro headset",
    "Apple Unveils Vision Pro AR/VR Headset, Its First Major New Product In Nearly A Decade",
    "WWDC23 highlights  —  Photos from the kickoff of Apple's 2023 Worldwide Developers Conference",
    "Apple sure kicked Meta's butt today, right?",
    "Apple Vision Pro: Apple's VR/AR Headset Revealed",
    "WWDC 2023: Apple announces partnership with Disney, Apple Vision Pro to run Disney Plus",
    "Disney+ will be on Apple Vision Pro from day one",
    "Apple Vision Pro news, price, specs, and everything we know about the VR headset",
    "WWDC: Apple introduces Vision Pro, its take on mixed reality",
    "Disney Plus is coming to Apple's Vision Pro headset",
    "Apple Vision Pro VR headset is revealed — and it will blow your mind",
    "Everything Apple Announced at WWDC 2023: Vision Pro VR Headset, New Macs, and More",
    "Apple Officially Reveals Vision Pro, Its New $3,499 Mixed Reality Headset",
    "Apple Vision Pro Will Have Custom Disney+ Content, Including Marvel's What If...?",
    "Apple and Disney partner for Apple Vision Pro Disney+ day-one launch",
    "Disney teases a deeply personal Disney+ integration with Apple Vision Pro",
    "Disney's Bob Iger Announces Major New Apple Partnership",
    "Disney Plus Will Be Available On Apple's Vision Pro At Launch",
    "Disney teases ‘deeply personal’ Disney+ integration with Apple Vision Pro",
    "Yeah, Apple just killed Meta and Oculus with this Disney partnership.",
    "International Business Times",
    "Apple Vision Pro vs. Meta Quest 3: What's the Difference?",
    "Apple Vision Pro Specs, Features & Details",
    "Apple Vision Pro: Here's everything you need to know",
    "Apple Headset Looks Sleek in Person But Battery Pack Stands Out",
    "Apple's Vision Pro Headset Is Finally Real And The Platform Looks Slick And Expansive",
    "Apple introduces Vision Pro, a mixed reality headset controlled by eyes, hands and voice",
    "Apple Vision Pro headset: Price, specifications, and everything you need to know",
    "Apple unveils the Vision Pro, it's $3,500 mixed reality headset",
    "Apple unveils mixed-reality Vision Pro headset priced at $3,499",
    "Here's a First In-Person Look at the Apple Vision Pro",
    "Meet your Digital Persona: Apple's Vision Pro users to get real-time animated avatars",
    "Apple Vision Pro is an AR/VR headset that'll cost more than $5,000 AUD",
    "The Apple Vision Pro just changed AR and VR forever",
    "Apple Vision Pro first look: A glimpse at the spatial computing future",
    "Apple Vision Pro is a mix of innovation, and year-2016 VR, for a hefty price. But...",
    "Apple enters mixed reality with $3,500 Vision Pro headset",
    "Apple Vision Pro: 6 things we love and 3 we don't",
    "Apple's Vision Pro is a Reality",
    "Apple Tips Vision Pro Augmented Reality Headset, With Sky-High $3,499 Price Tag",
    "Apple's Vision Pro headset seems too good to be real — because it basically is",
    "Apple's Vision Pro isn't the VR headset you were expecting, but it is the future — for rich people",
    "Apple Vision Pro looks amazing but... I don't want to live my life in a headset",
    "Apple Previews its First ‘Vision Pro’ AR Headset, and its Huge Price Tag",
    "Apple Vision Pro teleports you into the future (of sorts)",
    "Apple Unveils $3,500 Vision Pro AR Headset",
    "Apple unveils VR headset Vision Pro",
    "WWDC 2023: Will Apple's Vision Pro be a VR game changer?",
    "Apple to Facebook, Google, and Snap [image]",
    "got my new apple headset [image]",
    "This is crazy! #WWDC23 [image]",
    "First look at Joaquin Phoenix in Ridley Scott's ‘NAPOLEON’. (Shown at #WWDC23) [image]",
    "Apple Reveals ‘Vision Pro’ Headset and visionOS",
    "Apple Unveils Vision Pro AR Headset Priced at $3,500",
    "Apple Vision Pro: I Tried the New Mixed-Reality Headset",
    "Apple Vision Pro headset runs visionOS with a 3D-spatial user interface",
    "Apple Vision Pro headset will get its own App Store featuring apps for visionOS",
    "Apple's Pricey New Headset Is Not to Be Dismissed",
    "Apple's Vision Pro Headset Reinvents Personal Computing",
    "Sorry, Gamers—Apple's Vision Pro Headset Wasn't Made for You",
    "Apple to provide developers with Apple Vision Pro developer kits to build visionOS apps",
    "Apple details visionOS, the software that powers the Vision Pro headset",
    "Apple Vision Pro: release date, price, specs, and more",
    "VisionOS — Everything we know about the Apple Vision Pro's platform",
    "Apple's AR/VR Headset Has Its Own OS Called VisionOS",
    "visionOS will power the Apple Vision Pro headset — here are the first official details",
    "Someone needs to build a spatial code editor for visionOS",
    "The new OS is called visionOS. Not xrOS, lol. [image]",
    "“Exploring visionOS”. Going to take on my most challenging writing project yet. 🤗 [image]",
    "imagine seeing this in VR [image]",
    "Apple's Vision Pro headset uses iris scanning for logins with Optic ID",
    "Apple's Vision Pro Headset Uses ‘Optic ID’ Iris Scanning Authentication",
    "Apple announces new Optic ID biometrics for user authentication on Apple Vision Pro headset",
    "Apple about to murder WorldCoin too? Didn't think about that one.",
    "Apple Store is down ahead of 15-inch MacBook Air, Apple XR headset and more expected at WWDC",
    "WWDC 2023: Vision Pro, iOS 17 and everything else Apple announced today",
    "The features that didn't get discussed onstage at WWDC",
    "Factbox: Here's what Apple unveiled at WWDC: Vision Pro, 15-inch MacBook Air, OS updates",
    "Apple WWDC '23 Live Blog: recap of all the unveilings during Apple's keynote",
    "Vision Pro, iOS 17, 15\" MacBook Air: Everything you need to know from Apple WWDC 2023",
    "visionOS: everything you need to know about the Vision Pro's operating system",
    "Apple's Biggest Announcements at WWDC 2023: Vision Pro, Mac Pro, iOS 17, and More",
    "I've been waiting my whole life for iOS 17's new Journal app",
    "Apple's biggest reveals at WWDC23",
    "Apple WWDC 10 biggest announcements: Vision Pro, MacBook Air, iOS 17, and more",
    "Death Stranding Director's Cut and future Kojima games heading to Mac",
    "Apple's Vision Pro announcement at WWDC didn't mention the word “metaverse”",
    "5 best Apple WWDC 2023 announcements: Vision Pro, iOS 17, MacBook Air 15, and more",
    "Here are the most important new changes coming to your iPhone this fall",
    "Every hardware product Apple announced at WWDC today: Vision Pro headset, Mac Pro, more",
    "Microsoft Word, Excel, and Teams apps will be available for the Apple Vision Pro AR headset",
    "Apple debuts larger MacBook Air",
    "Apple WWDC 2023: The Biggest Announcements From the Keynote",
    "WWDC 2023 Recap: Vision Pro Headset, iOS 17 and Everything Else Apple Announced",
    "WWDC 2023: Everything you missed during the keynote",
    "Apple WWDC 2023 Live Updates: Apple Vision Pro VR Headset, iOS 17, New Macs, and more",
    "An example of great interaction between brands 😂 @McDonalds @AXE [image]",
    "AirDrop now works by bringing two devices together #WWDC23 [image]",
    "Huge software improvements to AirPods was not on my bingo card. But great!",
    "apple using better AI to make autocorrect not terrible would actually be a good thing if it works",
    "⌨️ It's about ducking time. Big autocorrect and typing predictions coming.",
    "- Here's a cool new Standby feature, with an accessory we'd love to sell you! [image]",
    "watchOS “Time in Daylight” also perfect to protect Dracula. #wwdc23",
    "Sorry but I've heard Jonny Ive say “aluminum” and you are no Jonny Ive.",
    "Mac pro with m2 ultra. Been waiting for this for keeping 10 tabs open in chrome.",
    "damn this new mac pro is a whole pixar studio in one cheesegrater box",
    "apple headset will make you jump off a building trying to catch bubbles.... just like reefer",
    "A new AR platform with a revolutionary product.... $AAPL",
    "The features that didn't get discussed onstage at #WWDC https://sixcolors.com/...",
    "the best part about apple vision pro is that it makes you look like a dick",
    "Ducking hell! Apple to tweak autocorrect that replaces one of the most common expletives",
    "Apple says it has fixed iPhone autocorrect with iOS 17",
    "Apple's iOS 17 adds Live Voicemail, StandBy and a Journal app",
    "iOS 17 Lets You Create a Voice That Sounds Like You",
    "The iPhone 8, 8 Plus, and X aren't getting iOS 17",
    "10 big upgrades coming to iPhones with iOS 17, unveiled at WWDC 2023",
    "You Can Download the iOS 17 Developer Beta on Your iPhone Right Now",
    "iOS 17 will transcribe your audio messages, customize contact posters",
    "Apple details iOS 17, iPadOS 17, macOS Sonoma, watchOS 10, and tvOS 17",
    "Apple just announced a ton of software features at WWDC. Here's everything new",
    "Apple Announces iOS 17 With StandBy Charging Mode, Better Autocorrect",
    "iOS 17 adds new look and big updates to Messages app — here's what's new",
    "With iOS 17, Apple introduces new journaling app, refreshes communication apps",
    "The best feature ever is getting even better. Source: https://www.apple.com/... [image]",
    "NameDrop allows for easy transfer of contact info. Very 1996 PalmPilot. [image]",
    "iOS 17 Includes Updated Phone, FaceTime, and Messages Apps",
    "iOS 17 iPhone StandBy: How to use and customize the smart display feature",
    "Apple announces iOS 17 with NameDrop, StandBy, Live Voicemail, and more",
    "Apple Shortening ‘Hey Siri’ to ‘Siri’ Across iPhone, Mac, and Other Devices",
    "Apple announces powerful new privacy and security features",
    "Apple didn't talk about it, but iOS 17 adds AirTag and Find My device sharing",
    "iOS 17 StandBy mode brings smart display-like features to iPhone",
    "12 Compelling Features Coming to Apple's Operating Systems in 2023",
    "Apple shows off new NameDrop feature coming with iOS 17",
    "WWDC 2023: A First Look at Messages in iOS 17",
    "iOS 17 beta 1 now available to developers: what you need to know on how to get it",
    "iOS 17 Adds Journal App, StandBy Smart Display Mode, Better Autocorrect",
    "iOS 17 announced at WWDC 2023: Here's what's coming to iPhone 15",
    "Apple announces NameDrop, a feature for seamless contact information sharing",
    "What's New In IOS 17 And When Is It Coming To Your IPhones [Top 10 Features]",
    "11 best iOS 17 features: StandBy mode, Journal app and more",
    "Apple unveils iOS 17 at WWDC 2023, here are the new features",
    "Apple Thoughtfully Introduces ‘StandBy’ Mode for iPhone's Lock Screen",
    "iOS 17 continues personalization push & makes big adds to Messages",
    "AirDrop in iOS 17 will let you share contact info by bringing two iPhones close together",
    "feel like this new Apple Journal app is basically Facebook-ish for an audience of one [image]",
    "iOS 17 makes iPhone more personal and intuitive",
    "Will my iPhone get iOS 17? Here's every supported model",
    "Apple introduces Journaling app for iOS",
    "US District Court for the District of Columbia",
    "U.S. Securities and Exchange Commission",
    "Press Release SEC Files 13 Charges Against Binance Entities and Founder Changpeng Zhao",
    "SEC Complaint Aims to Unilaterally Define Crypto Market Structure",
    "Plaintiff Securities and Exchange Commission (the “SEC” or the “Commission\") …",
    "SEC Sues Binance and CEO Zhao for Breaking US Securities Rules",
    "SEC Sues Crypto Exchange Binance Over U.S. Rule Violations",
    "SEC sues Binance and CEO Zhao over alleged mishandling funds, lying to regulators",
    "SEC claims BNB and BUSD are securities, including major tokens like SOL, ADA and MATIC",
    "SEC accuses Binance of lying to customers, operating in US illegally",
    "Solana, polygon, cardano and other tokens are securities, says SEC in Binance lawsuit",
    "SEC sues Binance, says it evaded US law with “extensive web of deception”",
    "Cryptocurrencies stumble after US files charges against Binance",
    "SEC charges Binance, CEO Zhao with 13 violations",
    "Crypto Prices Drop Amid SEC's Binance Prosecution",
    "Cry-pto: Feds bury Bitcoin exchange giant Binance in 13-count fraud lawsuit",
    "SEC Sues Crypto Exchange Binance and CEO Changpeng Zhao, Alleging Multiple Securities Violations",
    "SEC shakes crypto with Binance suit",
    "SEC sues Binance and CEO Changpeng Zhao for U.S. securities violations",
    "Crypto shares tumble as US regulator sues Binance",
    "Blow For Metaverse, SEC Classifies SAND And MANA As Securities",
    "Binance Executives Claimed to Operate as ‘Unlicensed Securities Exchange’: SEC Lawsuit",
    "US SEC sues Binance, founder Zhao alleging securities law violations",
    "SEC Quietly Removes Director William Hinman's Bio From Website",
    "Binance SEC Lawsuit Could Preview What Coinbase May Face",
    "SEC sues Binance and accuses crypto exchange of mishandling funds",
    "SEC sues Binance and founder Changpeng Zhao over securities law violations",
    "What the SEC's lawsuit against Binance means for crypto investors",
    "SEC sues Binance and CEO Changpeng Zhao",
    "Binance Is in Deep Trouble",
    "Binance Charged With Running Illegal Crypto Exchange in New SEC Complaint",
    "SEC comes for Binance and Changpeng Zhao",
    "SEC says crypto firm Binance mishandled funds, violated securities laws",
    "[DB] SEC Sues Binance and CEO Zhao of Breaking US Securities Rules: Bloomberg",
    "Our response to the SEC's complaint. https://www.binance.com/...",
    "SEC claiming SOL, ADA, MATIC, FIL, ATOM, SAND etc are all securities. [image]",
    "SEC filing calls BNB a security [image]",
    "both coley and brooks testified to SEC [image]",
    "A preview of what's next... We need to unite. https://twitter.com/...",
    "“From this account, Sigma Chain spent $11 million to purchase a yacht”",
    "Looks like SEC seeking to push Binance out of the US completely and to enforce a fine [image]",
    "Oh so another major crypto bro is a fraud, how shocking 😱😱 https://twitter.com/...",
    "binance be like “4”, 4x revenue from fees we get on the fud volume from SEC",
    "Tfw Binance employees know the going black market rate for firearms. https://twitter.com/...",
    "Strong together. https://twitter.com/...",
    "underappreciated part of this is that the quote comes from their chief COMPLIANCE officer",
    "The gears of justice grind slowly but they grind exceedingly fine. https://twitter.com/...",
    "Potential bankrun type situation 👀 https://twitter.com/...",
    "Binance Executive Controlled Bank Accounts Belonging to U.S. Wing in 2019-20: Reuters",
    "When it rains... https://www.reuters.com/...",
    "Who is Guangying Chen? 🤔 https://www.reuters.com/...",
    "Binance Hands Rising Star Teng Key Role to Replace CEO Zhao at Largest Crypto Exchange",
    "Richard Teng seen as potential successor to Binance's Changpeng Zhao -reports",
    "Binance poaches OKX exec Rachel Conlan to lead global marketing",
    "Ask not for whom carries the can, the can is carried by thee. https://www.bloomberg.com/...",
    "Apple Introduces New Mac Pro With M2 Ultra Chip, Available to Order Starting Today",
    "Apple announces Mac Pro with M2 Ultra, starting at $6,999",
    "Vision Pro and everything else Apple announced during the WWDC keynote",
    "This is the new Apple Silicon Mac Pro",
    "Apple unveils 15in MacBook Air, iOS 17 and revamped watchOS 10",
    "Apple Silicon Is the Mac Pro Upgrade You've Been Waiting For",
    "Maxed-out Apple Silicon Mac Pro costs 1/4 what a maxed Intel one did",
    "Apple Unveils M2 Ultra Chip as Most Powerful Apple Silicon Chip Yet",
    "Apple Announces New Mac Studio And The First Apple Silicon Mac Pro",
    "Apple Announces M2-Based 15-inch MacBook Air, Mac Studio, and Mac Pro",
    "Apple finally reveals new Mac Pro at WWDC 2023",
    "Apple just unveiled the mother of all Mac computers",
    "Apple refreshes the Mac Pro with its new M2 Ultra chip",
    "Apple unveils new Mac Pro and Mac Studio, completing Mac's Apple Silicon transition",
    "Apple Announces Brand-New Mac Pro with Apple Silicon and PCI Expansion",
    "Apple's Mac transition to Apple silicon complete after three years",
    "Apple Silicon Mac Pro debut finally ends transition away from Intel processors",
    "Apple surprise-launches new Mac Pro with Apple Silicon",
    "Apple unveils new M2 Ultra Mac Pro",
    "@MKBHD This is an insane update for MacStudio",
    "Apple introduces the 15‑inch MacBook Air",
    "Apple officially drops M2 13-inch MacBook Air price",
    "Apple Announces New MacBook Air With 15.3-inch Display and M2 Chip Starting at $1,299",
    "Apple launches new 15-inch MacBook Air",
    "Apple Cuts 13-Inch MacBook Air Price by $100 - but You Can Already Save More",
    "Apple MacBook Air 15-inch preview: Portable power",
    "Apple Confirms An Uninspiring Update To The MacBook Air",
    "Apple Unveils the 15-inch MacBook Air, the World's Thinnest Laptop with Exceptional Performance",
    "Apple lowers price of 13-inch MacBook Air with M2",
    "MacBook Air 15-inch M2 hands-on review: Bigger is better",
    "Apple Unveils 15-Inch MacBook Air at WWDC 2023",
    "15-inch MacBook Air with M2 chip tech specs",
    "The biggest Mac announcement at WWDC was about the old MacBook Air",
    "Apple unveil the 15-inch MacBook Air at WWDC 2023",
    "15-inch MacBook Air vs 13-inch MacBook Air — which is better?",
    "The MacBook Air gets bigger with new 15-inch model",
    "MacBook Air 2023: Everything you need to know",
    "Apple intros the 15‑inch M2 MacBook Air",
    "The MacBook Air 15-inch is official, and it's powered by M2",
    "Apple Debuts 15-Inch MacBook Air, Mac Studio With Faster Chip",
    "Apple's $1,299 15-inch MacBook Air is its largest to date",
    "Apple introduces 15-inch MacBook Air, its largest screened Air to date",
    "nm i hate my macbook pro, macbook air 15\" new best friend",
    "Apple announces new MacBook Air, Mac Studio and Mac Pro alongside M2 Ultra chip",
    "Apple refreshes the Mac Studio with the M2 Max and M2 Ultra",
    "Apple Announces New Mac Studio With M2 Max and M2 Ultra Chips",
    "Apple's M2 Ultra: Breaking the Limits of Performance and Efficiency",
    "Apple serves up a tasty new chip, introducing M2 Ultra",
    "Apple's M2 Ultra chip chases the Hollywood elite",
    "2023 Mac Studio tech specs",
    "Apple unveils new Mac Studio and finally brings Apple Silicon to Mac Pro",
    "The M2 Ultra Mac Studio is here with cores galore",
    "M2 Mac Studio 2023: Specs, price, release date, and everything you need to know",
    "Apple Unveils The M2 Ultra, A Monster Chip With 24 CPU Cores And Up To 76 GPU Cores",
    "Apple WWDC 2023: Apple launches new Mac Studio PC with M2 Max and M2 Ultra chips",
    "Apple reveals Mac Studio 2023 with huge M2 Ultra chip power",
    "Apple's new M2 Ultra chip offers even more ridiculous performance than before",
    "Apple announces the M2 Ultra chip and new Mac Studio.",
    "Apple's New Headset Makes Meta Look Like AR's BlackBerry",
    "Twitter US ad sales plunged 59%, and internal forecasts are grim, NYT reports",
    "How far have Twitter's advertising revenues fallen?",
    "Hate speech is driving advertisers away from Twitter",
    "Linda Yaccarino replaces Elon Musk as Twitter boss",
    "Best Crypto to Buy Now 5 June - Decentraland, Solana, The Sandbox",
    "Twitter's ad revenue continues decline under Musk",
    "Twitter's U.S. ad revenue drops 59%",
    "Twitter to recoup revenue by being everyone's Everything app. https://www.nytimes.com/...",
    "CISA orders govt agencies to patch MOVEit bug used for data theft",
    "Clop ransomware claims responsibility for MOVEit extortion attacks",
    "BA, Boots and BBC staff details targeted in Russia-linked cyber-attack",
    "New ways to reduce the chances of ransomware attacks",
    "Clop ransomware gang exploits the MOVEit Transfer vulnerability to steal data",
    "Clop … View infographic of “Ransomware Spotlight: Clop”  —  Clop (sometimes stylized as …",
    "MOVEit hack: BBC, BA and Boots among cyber attack victims",
    "British Airways, Boots staff data compromised by payroll cyber hack",
    "BBC staffers warned of payroll data breach. Other firms also affected by MOVEit vulnerability",
    "Zellis cyber attack: British Airways, BBC and Boots staff have data stolen in breach",
    "MOVEit Hack Damage Spreads to British Airways and BBC",
    "British Airways, BBC caught up in file transfer hack",
    "British Airways, Boots and BBC among companies hit by cyber security attack",
    "Russian hackers raid British Airways and BBC in cyber attack",
    "British Airways, Boots, BBC payroll data stolen in MOVEit supply-chain attack",
    "British Airways staff's details stolen in cyber breach hitting firms around the world",
    "Microsoft Links MOVEit Attack to Cl0p as British Airways, BBC Fall",
    "Group behind Clop ransomware exploiting MOVEit zero-day, says Microsoft",
    "Introducing watchOS 10, a milestone update for Apple Watch",
    "Apple Announces watchOS 10 With Widgets, Redesigned Apps, and More",
    "Apple commits to mental health with tracking on Watch and iPhone",
    "watchOS 10 for Apple Watch officially unveiled",
    "Apple WatchOS 10 Will Bring Widgets, Snoopy Comics to Your Watch Face",
    "watchOS 10 beta 1 now rolling out to developers",
    "Apple rethinks the Apple Watch with watchOS 10 update",
    "Will my Apple Watch get watchOS 10? Here's every supported model",
    "Widgets were the winning feature at WWDC 2023, and I'm here for it",
    "Apple unveils watchOS 10 with new features for mental health, vision health",
    "Apple unveils watchOS 10 — the biggest Apple Watch update in years",
    "New Apple Watch updates will turn your wearable into a cycling computer",
    "Apple revamps WatchOS with widgets, new fitness and health features, and more",
    "watchOS 10 arrives for Apple Watch, with widgets, new faces, and more workouts",
    "WatchOS 10 For Apple Watch: New Features Coming This Year",
    "Love the new cycling features for the apple watch. Time to get one",
    "All right, the @apple Watch upgrades are quite solid. Well done team. #WWDC23",
    "Free compensation benchmarking data from 3,000 startups",
    "Stack Overflow Moderator Letter",
    "Why I'm signing the Stack Overflow strike letter",
    "@chrismessina@mastodon.xyz",
    "@parismarx@mastodon.online",
    "macOS Sonoma brings all‑new capabilities for elevating productivity and creativity",
    "Apple debuts macOS 14 Sonoma",
    "Apple Releases First Beta of macOS 14 Sonoma to Developers",
    "macOS Sonoma drops support for another wide swath of Intel Macs",
    "macOS Sonoma Drops Support for These Macs",
    "'Death Stranding: Director's Cut' walking onto Mac",
    "Apple reveals macOS Sonoma with screensavers and widgets",
    "macOS Sonoma brings new Lock Screen with aerial wallpapers, here's how it works",
    "Apple's Updates to MacOS: Game Mode, Increased Privacy and Security, and Adjustable Widgets",
    "These Macs will get macOS 14 Sonoma in the fall",
    "Apple Announces macOS Sonoma With Desktop Widgets and More",
    "Apple's New macOS Sonoma: A New Era of Productivity and Creativity",
    "The 6 Best macOS Sonoma Features From WWDC 2023",
    "macOS 14 cheat sheet: Release date, name, features and more",
    "Five things to know about macOS Sonoma",
    "MacOS Sonoma Offers You Key Upgrades, Customizable Widgets",
    "macOS 14 Sonoma revealed at WWDC 2023 — widgets finally arrive",
    "Which Macs support macOS 14? Mostly only Apple Silicon models. Here's the list ...",
    "How to install macOS Sonoma beta on your Mac",
    "macOS Sonoma arrives with desktop widgets, improved video conferencing and Game Mode",
    "macOS 14 Sonoma officially announced at WWDC 2023",
    "macOS Sonoma drops support for these Macs",
    "macOS Sonoma adds Game Mode, a new design for desktop widgets, and more",
    "Apple Announces macOS Sonoma with Game Mode, Upgraded Widgets and More",
    "Twitter and Bluesky as web apps on Sonoma, with widgets in background.  Coolio.",
    "MacOS Sonoma wallpaper Has some windows XP vibes [image]",
    "Windows Vista lives on with MacOS Sonoma widgets. Yey! #WWDC2023 #WWDC23 [image]",
    "Next year's improvement to macOS Sonoma will be called macOS Napa. [image]",
    "Apple Webapps: “Please please please don't make us add third-party app stores” [image]",
    "tvOS 17 brings FaceTime and video conferencing to the biggest screen in the home",
    "tvOS 17 Lets You Use Your iPhone to Find a Lost Siri Remote",
    "FaceTime Launching on Apple TV With iPhone and iPad Camera Support",
    "You can now take FaceTime calls on your Apple TV 4K",
    "Apple TV hardware will get VPN access with tvOS 17",
    "Apple unveils updates for tvOS 17 and AirPods",
    "FaceTime on Apple TV with tvOS 17 is exactly three years overdue",
    "tvOS 17 announced with new Control Center, FaceTime, Continuity Camera support and more",
    "Apple just brought FaceTime to your TV with tvOS 17",
    "Apple Seeds tvOS 17 Beta to Developers [Download]",
    "FaceTime is coming to Apple TV",
    "Best New tvOS 17 Features to Try on Apple TV",
    "FaceTime comes to Apple TV",
    "ok is this tvOS update the secret star of the show lmao",
    "Finally some love for tvOS. Video conferencing with an iPhone as camera seems clunky though.",
    "tvOS gets stage time?! Pigs are flying.",
    "Personalized wealth management, built for tech people",
    "The power of digital customization: A guide for modern businesses, Part 2",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Adobe: Let’s create experiences that matter.",
    "Discord: Building something you actually use.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Character.AI: Build something smarter than you.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Replit: From idea to software, fast.",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "Mon. 06/05 - WWDC And The Apple Headset",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "HealthcareInfoSecurity.com",
    "Microsoft to pay $20 million FTC settlement over improperly storing Xbox account data for kids",
    "Microsoft to Pay $20 Million to Resolve FTC Kids' Privacy Case",
    "Microsoft Pays $20M to Settle FTC COPPA Complaint",
    "AirPods redefine the personal audio experience",
    "Apple unveils Adaptive Audio and says it'll improve AirPods' automatic switching",
    "AirPods Pro 2 Gaining ‘Adaptive Audio’ Feature That Dynamically Adjusts to Your Environment",
    "Apple Announces New Features for AirPods",
    "WWDC 2023: Apple introduces Adaptive Audio, Personalized Volume, more for AirPods",
    "Adaptive Audio and Personalized Volume on AirPods will adjust sound levels and ANC automatically",
    "AirPods users just got a huge free upgrade",
    "AirPods Pro owners are the secret winners of WWDC 2023 — here's why",
    "Adaptive Audio listening mode is coming to AirPods Pro 2",
    "Father's Day Gift Idea: The Best Deals on Premium True Wireless Noise Cancelling Earbuds",
    "AirPods Adaptive Audio tunes ANC and transparency based on your environment",
    "Your Apple AirPods just got a lot more adaptive and aware",
    "Apple AirPods get even better with Adaptive Audio and more",
    "iPadOS 17 brings new levels of personalization and versatility to iPad",
    "iPadOS 17 brings a raft of new features in better-than-expected update",
    "Apple is bringing its Health app to the iPad",
    "iOS 17 Can Automatically Clean Up Verification Codes That Clog Up Messages App",
    "Apple Announces iOS 17, iPadOS 17, watchOS 10, and macOS Sonoma",
    "Apple Announces iPadOS 17 With Custom Lock Screens and Interactive Widgets",
    "Will my iPad get iPadOS 17? Here's every compatible model",
    "iOS 17 and iPadOS 17 beta 1 now available",
    "iPadOS 17 System Requirements: Can your iPad Update?",
    "Apple Unveils iOS/iPadOS 17, watchOS 10, macOS Sonoma",
    "How to install iPadOS 17 beta on your iPad",
    "Apple's New iPadOS 17 and macOS Sonoma Will Make iPads and Macs So Much Better",
    "iPad users just got a massive free software upgrade",
    "iPadOS 17 announced at WWDC, coming with interactive widgets and more",
    "Apple reveals iPadOS 17 with customizable Lock Screen, Health app, more",
    "Apple iOS 17 Introduces StandBy, a Full-Screen Experience for When Your iPhone is Charging",
    "List of iPhone and iPad Models Compatible With iOS 17 and iPadOS 17",
    "iPadOS 17 announced with interactive widgets, Lock Screen customization, more",
    "I have to leave for a doctors appointment and you're talking about iPadOS 17? COME ON. #WWDC23",
    "India's Open Network for Digital Commerce Begins Facilitating B2B Transactions",
    "Kremlin: fake Putin address broadcast on Russian radio stations after ‘hack’",
    "‘Fake Putin’ announces Russia under attack as Ukraine goes on offensive",
    "Google extends the convenience of passkey authentication to a whole lot more users",
    "Passkey support for Google Workspace accounts rolling out",
    "After rollout across personal accounts, Google enables Passkeys for Workspace accounts",
    "Google rolls out passkey support for Workspace and Cloud accounts",
    "Google Workspace and Cloud get support for passkeys",
    "Carbon Health Launches AI Charting in Its EHR Across All Clinics and Providers",
    "More Personal Visits: Introducing AI-Enabled Hands-Free Charting",
    "r/Save3rdPartyApps on Reddit",
    "Reddit's plan to kill third-party apps sparks widespread protests",
    "Statement: Reddit's defenses of changes that could kill third-party apps",
    "Don't Let Reddit Kill 3rd Party Apps!",
    "What We Want  —  1. Lower the price of API calls to a level that doesn't kill Apollo …",
    "Thousands of Subreddits Set to ‘Go Dark’ Next Week in Protest Over API Pricing Changes",
    "A decentralized, ownerless Reddit is needed https://twitter.com/...",
    "Spotify will cut 200 jobs in its podcast unit",
    "Spotify lays off 200 employees, or about 2% of its workforce",
    "Spotify lays off 200 employees amid shift in podcast strategy",
    "Spotify combines podcast studios and shrinks workforce",
    "Spotify Laying Off 200 Employees in Its Podcast Division",
    "Spotify cuts 2 percent of its workforce, mainly in podcasts",
    "Spotify to layoff 2% of its workforce amid ‘strategic realignment’ drive"
]