[
    "@JohnSullivan@mastodonapp.uk",
    "How Fake AI Photo of a Pentagon Blast Went Viral and Briefly Spooked Stocks",
    "‘Verified’ Twitter accounts share fake image of ‘explosion’ near Pentagon, causing confusion",
    "A tweet about a Pentagon explosion was fake.  It still went viral.",
    "Pentagon explosion hoax goes viral after verified Twitter accounts push",
    "Fake viral images of an explosion at the Pentagon were probably created by AI",
    "Fake picture of explosion at Pentagon spooks Twitter",
    "‘Verified’ Twitter accounts push Pentagon explosion hoax",
    "AI photo of Pentagon explosion causes panic and stock market dip",
    "Fake Image Of Explosion Near Pentagon Went Viral—Even Though It Never Happened",
    "Pentagon Bomb Hoax Highlights Power of Artificial Intelligence - What Could It Mean For Crypto?",
    "Fake AI-generated image of explosion near Pentagon spreads on social media",
    "No, the Pentagon Didn't Blow Up Monday",
    "Fake image of Pentagon explosion goes viral",
    "Fake Pentagon attack hoax shows perils of Twitter's paid verification",
    "Blue Tick Accounts on Twitter Add Weight to Pentagon Explosion Hoax",
    "Market dips briefly after AI image of fake explosion near Pentagon goes viral",
    "FACT FOCUS: Fake image of Pentagon explosion briefly sends jitters through stock market",
    "Verified Twitter Account Pushes AI-Generated Image of Pentagon ‘Explosion’",
    "‘Verified’ Twitter Accounts Spread Pentagon Explosion Hoax",
    "Fake Pentagon explosion photo caused a real dip in the stock market",
    "Large Explosion near The Pentagon Complex in Washington D.C. - Initial Report",
    "pay-to-\"verify\" blue checks... 🥴 https://twitter.com/...",
    "Elon Musk carefully enabled this ⤵️ https://twitter.com/...",
    "New Twitter is fraud-friendly https://twitter.com/...",
    "Ah yes, no-one saw this coming. https://www.vice.com/...",
    "Russian propaganda now running with this lie. https://twitter.com/...",
    "This election season is gonna be hell with AI-assisted disinformation. https://twitter.com/...",
    "General Secretariat of the Council of the European Union",
    "@mattburgess@infosec.exchange",
    "A day of bad news for spyware makers",
    "Leaked EU files suggest Spain supports end-to-end encryption ban",
    "Spain Advocated for An All-Out Ban on End-to-End Encryption",
    "Proposal for a Regulation laying down rules to prevent and combat child sexual abuse",
    "Apparently Spain wants to ban E2E encryption. https://www.wired.com/...",
    "US District Court, District of Montana",
    "TikTok sues Montana over new law banning the app",
    "TikTok CEO Chew: Montana's ban on the app ‘unconstitutional’",
    "TikTok sues Montana to block ban, citing First Amendment",
    "TikTok Sues Montana, Calling State Ban Unconstitutional",
    "TikTok sues to stop Montana from enforcing its “unconstitutional” ban",
    "Tik Tok Sues Montana After State Passes Law Banning App",
    "TikTok CEO Says Oracle Has Begun Reviewing Its Source Code",
    "Take that: TikTok sues Montana over law banning social media site",
    "TikTok sues Montana to reverse state's ban of the app",
    "TikTok sues Montana to block state-wide ban",
    "TikTok challenges the US state of Montana over ban of its app",
    "TikTok files lawsuit against Montana over download ban",
    "Leave it to the feds: TikTok sues Montana",
    "TikTok sues Montana in bid to overturn statewide app ban",
    "TikTok Inc. v. Austin Knudsen",
    "TikTok sues Montana over statewide ban",
    "Montana is banning TikTok. But can the state enforce the law and fend off lawsuits?",
    "TikTok Sues State of Montana",
    "TikTok sues US state of Montana over law banning its use",
    "Montana TikTokers Sue Over App Ban",
    "TikTok Sues Montana Over Ban, Cites First Amendment",
    "TikTok's Lawsuit Against Montana Is a Test Case Amid National Ban Debate",
    "Montana TikTok Ban Signed Into Law, Goes Into Effect in 2024",
    "TikTok sues Montana over state-wide ban",
    "TikTok Files Lawsuit Against Montana, Calls State Ban Unconstitutional",
    "TikTok sued Montana over its statewide ban of the app",
    "TikTok sues Montana over law that bans app",
    "TikTok Challenges Montana's Decision to Ban the App",
    "TikTok Sues Montana, Claiming the App's Ban is Unconstitutional",
    "TikTok sues Montana after new law banning its app",
    "TikTok Sues Montana to Reverse App Ban",
    "TikTok hits Montana with federal lawsuit in attempt to dissolve ban",
    "TikTok, Citing First Amendment, Sues Montana Over Impending Ban",
    "TikTok Sues Montana Over Law Banning the App, Arguing It Violates First Amendment",
    "TikTok sues Montana after state became first to ban its app",
    "TikTok is suing Montana over statewide ban",
    "TikTok Sues Montana Over State's Ban of Its Service",
    "TikTok sues Montana over app ban",
    "Following UK antitrust order, Meta sells Giphy to Shutterstock for $53M after buying it for $400M",
    "Facebook owner Meta sells Giphy at a loss of more than $260m",
    "Meta Sells Giphy to Shutterstock in $53M Deal",
    "How Meta's Acquisition of Giphy Went South",
    "Giphy Sold by Meta for $53 Million to Shutterstock",
    "Shutterstock to Acquire GIPHY, the World's Largest GIF Library and Search Engine",
    "International Business Times",
    "Governance of superintelligence  —  Now is a good time to start thinking about the governance …",
    "OpenAI's Altman Wants International Body Akin To Nuclear Watchdog IAEA To Regulate AI",
    "ChatGPT's parent OpenAI wants humans to regulate AI, proposes a regulatory body",
    "Wangiri phone scam is reportedly back in Kenya",
    "The hype game becomes the regulatory capture game. https://openai.com/...",
    "“Open Source is great, as long as it doesn't exceed our latest released capability” 😂",
    "Does code have a governance body? https://twitter.com/...",
    "“future AI systems dramatically more capable than even AGI” 🤔 https://openai.com/...",
    "Max launches as HBO Max and Discovery+ mash-up with even more 4K",
    "Warner Bros Discovery relaunches HBO Max streamer as ‘Max’ in bid for broader audience",
    "New ‘Max’ Streaming Service Launches, Replacing HBO Max",
    "Max makes its debut in the U.S. to give subscribers 35K hours of content",
    "Warner Bros.' Max streaming service launches with new $20 4K tier",
    "The rebranded HBO Max service launches today, new 4K tier announced",
    "Max has way more 4K HDR movies than HBO Max did - here are 8 to watch first",
    "What's New in Max: 10 Key Changes as HBO Max Relaunches With Discovery Content, Enhanced Features",
    "HBO Max become Max today, 4K content gets major boost.",
    "Warner Bros. reveals Max: Rebranded HBO Max",
    "Max's Priciest Plan Will Have 1,000-Plus Movies and Episodes in 4K Ultra HD",
    "Here are Max's 220 movies and shows available in 4K at launch",
    "Most Expensive ‘Max’ Plan to Feature 1,000+ 4K Titles — See the List",
    "Warner Bros. says that Max will have over 1000 titles in 4K when it launches tomorrow",
    "HBO Max Is Now Just Max: Everything You Need To Know Including Programs, Pricing & More",
    "HBO Max is now just Max in the US",
    "why are all the streaming services blue now [image]",
    "Xi's Micron Ban Shows China's Limited Options to Hit Back at US",
    "Beijing Bans Micron as Supplier to Big Chinese Firms, Citing National Security",
    "More fraud over at Binance? You don't fucking say! https://www.reuters.com/...",
    "Google's AI-enabled flood forecasting goes global",
    "Google expands its AI-powered Flood Hub to 80 countries",
    "Google's AI-powered Flood Hub disaster alert system is now available in 80 countries",
    "Iosco calls on global regulators to be faster and bolder on crypto markets",
    "International watchdog launches consultation on crypto regulations",
    "Regulators Should Block Firms From ‘Combining’ Crypto Functions, Says IOSCO",
    "IOSCO proposes global standard for crypto regulation",
    "Iosco issues recommendations for crypto-asset regulation",
    "FTX filings hint at reboot, OKX exchange picks Paris as hub",
    "IOSCO Urges Global Regulators to Accelerate and Strengthen Oversight of Crypto Markets",
    "International Securities Regulator IOSCO Proposes Policy Recommendations for Crypto",
    "Global securities watchdog IOSCO call for crypto regulation standards",
    "International securities watchdog IOSCO proposes first set of rules for crypto sector",
    "IOSCO Presents Comprehensive Crypto Guidelines for Regulation",
    "Twitter brings up people's deleted past as another weird bug hits the platform",
    "A Twitter Bug Is Restoring ‘Deleted’ Tweets and Retweets",
    "Twitter users report deleted tweets return, won't delete",
    "Twitter bug seems to be randomly restoring deleted tweets",
    "Twitter bug sees deleted tweets resurrected for some users",
    "Everything is going well here at twitter dot com. https://www.theverge.com/...",
    "lol lmao good luck in EU courts Elon https://twitter.com/...",
    "Oh crap! Thanks to @jjvincent for the reporting on this. https://www.theverge.com/...",
    "How soon before our DM end up in our public timeline? https://artifact.news/...",
    "Introducing speech-to-text, text-to-speech, and more for 1,100+ languages",
    "Open-sourcing Massively Multilingual Speech to preserve language diversity: Meta",
    "MMS: Scaling Speech Technology to 1000+ languages",
    "Preserving the World's Language Diversity Through AI",
    "Meta's Massively Multilingual Speech to Redefine Boundaries of Language",
    "Meta's open-source speech AI recognizes over 4,000 spoken languages",
    "The Dire Defect of ‘Multilingual’ AI Content Moderation",
    "Meta's ChatGPT rival could make language barriers a thing of the past",
    "Meta's speech model can recognise over 4000 spoken languages: What this means",
    "Meta's Open Source AI Project Can Identify 4,000+ Spoken Languages",
    "Meta Open Sources Multi-Lingual Language Models to Maximize Inclusion",
    "1100 languages! And see where their speakers are concentrated https://twitter.com/... [image]",
    "We're open sourcing another new AI model today that we call Massively Multilingual Speech. …",
    "Adobe brings Firefly's generative AI to Photoshop",
    "Adobe is adding its Firefly AI into Photoshop later this year",
    "Adobe brings Generative AI to Photoshop",
    "Adobe to integrate AI into Photoshop amid fears of job losses and mass faking of images",
    "Adobe Photoshop just got even easier to use with Generative Fill AI edits",
    "Adobe integrates generative AI directly into Photoshop with new Firefly capabilities",
    "Adobe adds generative AI editing to Photoshop",
    "Adobe's Firefly Image Generator Is Going to Make Photoshop Much Easier to Use",
    "Photoshop is the first Adobe Creative Cloud app to get Firefly Generative AI",
    "Photoshop just got a massive upgrade thanks to Adobe Firefly generative AI",
    "Adobe just put generative AI into Photoshop — what you need to know",
    "Photoshop Now Lets You Use Text to Edit Your Photos Thanks to New AI Tools",
    "Photoshop powered by Firefly's generative AI",
    "Photoshop's New ‘Generative Fill’ Uses AI to Expand or Change Photos",
    "Adobe supercharges Photoshop with Firefly Generative AI",
    "Adobe Firefly turns Photoshop into effortless AI image generator",
    "Hong Kong Securities Regulator to Accept License Applications for Crypto Exchanges Starting June 1",
    "Hong Kong greenlights retail trading of cryptocurrency",
    "Hong Kong will not allow retail customers to trade stablecoins",
    "Hong Kong's Crypto Revolution: A New Hub In The Making",
    "Breaking: Hong Kong Allows Retail Investors Trade Bitcoin, ETH, Other Crypto",
    "No stablecoins for retail on regulated Hong Kong crypto exchanges https://apps.sfc.hk/... [image]",
    "Want to apply for a crypto license in Hong Kong? No knowledge required! [image]",
    "The first AI navigator for your entire network",
    "AI threatens Google and Amazon's future - How?",
    "Google boss Sundar Pichai warns AI is ‘too important not to regulate’",
    "Google Policy Agenda Reveals AI Regulation Wishlist",
    "Social Media and Youth Mental Health",
    "US Surgeon General says social media may be hazardous to teen health",
    "Surgeon General issues advisory that social media is contributing to youth mental health crisis",
    "Surgeon general issues advisory about social media risks for kids",
    "Car seats and baby formula are regulated. Is social media next?",
    "U.S. surgeon general: We need a safety-first approach for kids on social media",
    "Surgeon general issues urgent warning about kids and social media",
    "Social media is driving teen mental health crisis, surgeon general warns",
    "Social media risks for youth mental health highlighted in new surgeon general report",
    "Surgeon General: More Evidence Social Media Use is Bad for Kids",
    "I... I don't think we need to draw the line at teenagers, tbh. https://twitter.com/...",
    "Surgeon General's warning on social media. Better late than never. https://www.hhs.gov/...",
    "Global digital banking group Tyme garners $77.8m, Tencent elevates stake",
    "Tyme Raises $77.8M in Series C Funding",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "App Spotlight: Australian Public Holidays for Zoho CRM",
    "Google: Bring questions. Build answers.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "TikTok: Inspire creativity and bring joy.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "Adobe: Let’s create experiences that matter.",
    "Techmeme: You might have heard of us...",
    "Mon. 05/22 - Meta Hit With Biggest Ever GDPR Fine",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 22-25Dell Technologies WorldLas Vegas",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 24VIRTUAL: Sony Playstation PS5 and PS VR2 Games Showcase media event",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Alphabet-backed AI startup Anthropic raises $450 million as funding freeze thaws",
    "Builder.ai keeps on building, now with a fresh $250+ million",
    "QIA Leads $250 Million Funding Round for App Platform Builder.ai",
    "Microsoft-Backed Builder.ai Raises $250 Mn In Series D Funding Round Led BY QIA",
    "London AI firm bags $250m injection led by Qatari sovereign wealth fund",
    "London-Based Startup Builder.ai Raises $250 Million",
    "Qatar Investment Authority leads $250m funding in AI startup Builder.ai",
    "Very confusing country where Schemes are Good but Scams must be Stopped. https://twitter.com/...",
    "District Court Judge Tosses Shareholder Lawsuit against Musk over Twitter Buyout",
    "Judge Tosses Shareholder Cheating Lawsuit Against Elon Musk",
    "Exclusive: Reliance JioMart fires 1,000, a bigger layoff round likely",
    "JioMart layoff: Over 1,000 employees, including 500 executives, asked to resign; says report",
    "Reliance JioMart cuts 1,000 jobs and to eliminate thousands more, report says",
    "JioMart to lay off thousands to improve margins",
    "JioMart Fires 1,000 Employees, More Layoffs Likely",
    "Yelp Stock Surges as Activist Investor Pushes for Sale",
    "Yelp Soars Most Since August on Report of Activist Call for Sale",
    "Activist Investor Calls on Yelp to Sell Itself",
    "Zoom Raises Annual Sales Forecast in Sign Pandemic-Era Customers Here to Stay",
    "Zoom lifts annual forecasts even as growth slows from pandemic peaks",
    "Zoom Continues to Feel Pinch of Tightening Tech Budgets",
    "Zoom ends Q1 with 215,900 enterprise customers, touts AI strategy",
    "President Biden Announces Federal Communications Commission Nominees",
    "Biden picks new FCC nominee to fill seat that's been empty for over two years",
    "President Biden nominates a fresh face to break FCC deadlock",
    "Comcast Statement on FCC Nomination and Renominations",
    "FCC Nominee Anna Gomez is an FCC and NTIA Veteran",
    "WhatsApp to allow users to edit messages ... but only for 15 minutes",
    "WhatsApp will now let you edit messages. But there's a catch",
    "The Morning After: WhatsApp finally lets you fix your message typos",
    "Now You Can Edit Your WhatsApp Messages",
    "Wish you could tweak that text? WhatsApp is letting users edit messages",
    "Can I edit a WhatsApp message? How the new edit feature works and when it is being released",
    "You can now edit that regrettable WhatsApp message — with one caveat",
    "WhatsApp users are getting another great messaging upgrade",
    "What's that? Oops ... WhatsApp allows users to reword texts",
    "Whatsapp message editing adds clarity to chats",
    "How to edit sent WhatsApp messages",
    "WhatsApp chat typo can now be edited easily in 15 mins: Heres how",
    "WhatsApp now allow you to edit sent messages",
    "WhatsApp Introduces Edit Message Feature to Avoid Sending Wrong Messages",
    "How to edit messages in WhatsApp",
    "WhatsApp finally lets you edit messages, but you have to be fast",
    "WhatsApp finally lets you edit sent messages. Here's how to do it",
    "How to edit sent messages on WhatsApp: Know process, time limit, and more",
    "WhatsApp's message editing feature now rolling out globally!",
    "WhatsApp to allow users to edit messages within 15 minutes",
    "WhatsApp will let you edit messages within a 15-minute window",
    "WhatsApp finally lets you edit sent messages",
    "WhatsApp chat edit feature now rolling out, check how to use it",
    "Message Editing feature joins WhatsApp on Android, get it now!",
    "WhatsApp testing ability to edit messages, similar to iMessage and Telegram [U: Available now]",
    "Meta is giving users 15 minutes to edit WhatsApp messages",
    "Editable WhatsApp messages are coming to help you fxi silly typos",
    "Now you can edit your WhatsApp messages",
    "WhatsApp now lets you edit your messaging nightmares - here's how to do it",
    "WhatsApp Users Can Now Edit Messages For Up to 15 Minutes",
    "You can finally edit messages on WhatsApp",
    "You can edit messages on WhatsApp, Finally!",
    "WhatsApp Will Now Let You Edit Your Sent Messages for up to 15 Minutes After Hitting ‘Send’",
    "You can now edit your WhatsApp messages up to 15 mins after they're sent!  😅",
    "Why Stepn NFTs on iOS Are Worth the Extra Apple Tax",
    "Apple Pay Integration Breaks New Ground for Web3 Gaming App, STEPN",
    "Web3 Move-to-Earn App STEPN Integrates Apple Pay for In-Game Purchases",
    "Stepn launches in-app NFT marketplace with Apple Pay integration",
    "You Can Now Buy Stepn NFTs on iOS—But You'll Have to Pay the Apple Tax",
    "Stepn Integrates Apple Pay To Enable Direct NFTs Purchase",
    "Apple Pivots Toward Greater Acceptance of Web3, Again",
    "Web3 Lifestyle App STEPN Integrates Apple Pay for In-Game Purchases",
    "STEPN Secures Landmark Integration With Apple, GMT Price Explodes Over 8%",
    "Massive for crypto apps - congrats ⁦@Stepnofficial⁩! https://www.theblock.co/...",
    "European Data Protection Board",
    "Real Facebook Oversight Board",
    "@profcarroll@federate.social",
    "Facebook hit with record €1.2 billion GDPR fine for transferring EU data to US",
    "Meta's $1.3 Billion Fine Is a Strike Against Surveillance Capitalism",
    "Our Response to the Decision on Facebook's EU-US Data Transfers",
    "Meta Fined $1.3 Billion for Violating E.U. Data Privacy Rules",
    "1.2 billion euro fine for Facebook as a result of EDPB binding decision",
    "How Meta got caught in tensions between the US and EU",
    "Irish watchdog opposed €1.2bn Meta fine, saying it would have no ‘meaningful dissuasive effect’",
    "Meta hit with record-breaking $1.3 billion fine over Facebook data transfers to the US",
    "TechScape: Warnings of a ‘splinternet’ were greatly exaggerated - until now",
    "Meta fined record $1.3 billion and ordered to stop sending European user data to US",
    "Facebook given record $1.3 billion fine, given 5 months to stop EU-US data flows",
    "noyb win: € 1.2 billion fine against Meta over EU-US data transfers",
    "Meta slapped with record $1.3 billion EU fine over data privacy",
    "EU hits Meta with record €1.2B privacy fine",
    "EU slaps Meta with $1.3 billion fine for moving data to US servers",
    "E.U. slaps Meta with record $1.3 billion fine for data privacy violations",
    "Meta Fined Record €1.2 Billion in EU Over US Data Transfers",
    "Meta: Facebook owner fined €1.2bn for mishandling data",
    "European regulators signal they are fed up with Facebook",
    "The EU's $1.3 billion blockbuster Meta fine shows it's the de facto global tech regulator",
    "Regulatory Agencies Slap Record $1.3 Billion Fine Against Meta Due to Data Transfers",
    "How many billions can Meta's Facebook pay the EU? And does it even matter?",
    "EU Fines Meta Record €1.2bn; New Twitter CEO Reassures Top Ad Group",
    "Meta Fine, Not Fine  —  DATA PROTECTIONDATA PROTECTION BY DESIGNDATA STRATEGYTECH TRENDS",
    "Europe's Meta Ruling Tangles Web",
    "DPC fine should be a wake-up call for government",
    "Facebook owner Meta expected to face record fine over transfer of European data to US servers",
    "Meta fined $1.3 billion for transferring user data from the EU to the US",
    "Meta to fight “unjustified” record $1.3 billion GDPR fine",
    "EU Regulators Hit Meta with Record $1.3 Billion Fine for Data Transfer Violations",
    "Meta fined a record $1.3 billion over EU user data transfers to the U.S.",
    "Meta Hit With $1.3B Record-Breaking Fine for GDPR Violations",
    "Meta hit with a record-breaking $1.3 billion fine over data privacy breaches",
    "Facebook owner Meta hit with record €1.2bn fine over EU-US data transfers",
    "Facebook Fined $1.3 Billion for Violating EU Data Privacy Rules",
    "Meta slapped with €1.2 billion fine by EU over GDPR breaches",
    "Facebook to be fined £648m for mishandling user information",
    "Record Meta fine masks Europe's privacy struggle",
    "Meta fined $1.3 billion for violating European data privacy rules",
    "Facebook Ordered to Suspend Data Transfers to US From Europe",
    "European watchdog fines Meta $1.3 billion over privacy violations",
    "Meta Fails Yet Again To Protect Users Data in Major New €1.3b GDPR Order",
    "Meta hit with $1.3 billion fine over Facebook's EU-US data transfers",
    "Facebook owner Meta fined €1.2bn for mishandling user information",
    "ps this was missed by all press reports and Facebook in its blog posts. https://twitter.com/...",
    "The fact these privacy rules don't apply to the EU's own governments is also very funny",
    "EU upset about the WW part of the WWW. https://twitter.com/...",
    "@om Regulation is the friend of the incumbent. Especially US regulation.",
    "Meta data is the new oil - https://twitter.com/...",
    "The clock counter on Facebook is now ticking. #GDPR https://www.tickcounter.com/ ... [image]",
    "This is quite the graph.... https://twitter.com/... [image]",
    "EDPB binding decision on Fb data flows has now been published: https://edpb.europa.eu/...",
    "It's always fun when reporters don't respect embargoes.",
    "Tornado Cash Sanctions Key to Drop in Crypto Hacks Last Quarter: TRM Labs",
    "‘Not over yet’: Tornado Cash attack rages on with $1m in jeopardy",
    "TORN Price gets Lift After Tornado Cash Attacker Proposes to Reverse Governance Attack"
]