[
    "Activision's Bobby Kotick says he made ‘a bad decision’ not bringing Call of Duty to Switch",
    "Microsoft CEO says he wants to end Xbox exclusives but blames Sony",
    "Crunch time in FTC fight against Microsoft deal to buy Activision",
    "Sony's PlayStation chief says publishers hate Xbox Game Pass",
    "Microsoft CEO Says Call of Duty to ‘100%’ Stay on PlayStation",
    "Microsoft CEO claims he'd ‘love to get rid of console exclusives entirely’",
    "Microsoft CEO Satya Nadella Says $75 Billion Activision Deal Won't Block Competition",
    "Microsoft CEO defends Activision deal, says he wants games across platforms",
    "Microsoft CEO Nadella tells a judge his planned Activision takeover is good for gaming",
    "Microsoft CEO would “love” to drop Xbox exclusives but can't because of Sony",
    "Microsoft CEO: If It Were Up To Me, I'd Get Rid of Exclusives",
    "Microsoft, Activision CEOs expected to urge US judge to allow $69 billion merger",
    "Not Supporting the Switch Was “a Bad Decision on My Part” - Activision CEO",
    "Microsoft's CEO Wants To Get Rid Of Console Exclusives Entirely",
    "Microsoft CEO Comments on Console Exclusivity",
    "Microsoft CEO Satya Nadella blames Sony for console game exclusives",
    "Microsoft CEO Says He Would “Love” To Get Rid Of Xbox Exclusives But Can't Because Of Sony",
    "Sony's Deal For Call Of Duty Only Includes One More Game",
    "Satya Nadella wants to remove all game exclusivity: ‘I have no love for that world’",
    "Microsoft CEO Wants To “Get Rid” Of Console Exclusives",
    "Activision would likely ditch Microsoft takeover if FTC pauses deal",
    "Activision CEO wouldn't put Call of Duty, other titles on Xbox Game Pass",
    "Microsoft's Lineup of Exclusive Games Draws Fire From Deal Foes",
    "Activision Will Be Jilted if Microsoft Deal Blocked, CEO Kotick Says",
    "Sony court documents removed after redacted details spotted",
    "Sony Accidentally Revealed How Deeply Loyal Call Of Duty Players Are",
    "FTC documents reveal how much money Sony makes from Call of Duty",
    "Sony Made A Truckload Of Cash From Call Of Duty Players In 2021",
    "The Risks of Cutting Off China",
    "Leaked PlayStation intel reveals shocking number of Call of Duty players only play CoD",
    "Sony Accidentally Reveals Major PlayStation Game Budgets",
    "Sony accidentally reveals trade secrets by using sharpie marker",
    "Call Of Duty's Worth to PlayStation May Have Been Revealed by Sony",
    "Sony's secrets: Poor redactions show first-party development costs",
    "Sharpie scanning goof reveals major PlayStation budgets and revenues",
    "Sony accidently reveals confidential Call of Duty player and revenue data",
    "Sony accidentally reveals budgets for Horizon Forbidden West, The Last of Us Part 2",
    "The Last of Us Part 2 and Horizon Forbidden West cost Sony over $200m to develop each",
    "Sony Knew Call of Duty Was a Major Revenue Driver, But Still Didn't See It as a Threat",
    "A staggering number of PlayStation users only play Call of Duty and literally nothing else",
    "Sony just spilled confidential Playstation information because of a Sharpie",
    "Sony's Confidential PlayStation Secrets Just Spilled Because of a Sharpie",
    "@danilo.redeem-tomorrow.com",
    "Is Minecraft subreddit shutting down?",
    "Official Minecraft Subreddit Shuts Down, Says ‘We No Longer Feel Reddit Is An Appropriate Place’",
    "Minecraft Will No Longer Use Reddit In Light Of The API Changes",
    "Minecraft Developer Mojang Quits Reddit Citing API Change, Protests",
    "The huge Minecraft subreddit will no longer get any official messages from Mojang",
    "Fresh Blow To Reddit As Minecraft Makers Walk Out",
    "Minecraft's developers are stepping away from Reddit. …",
    "What was that shit Spez said? “Redditors will get over it”? https://www.reddit.com/...",
    "So Long, and Thanks for All the Feedback",
    "Transparency and brand safety on Google Video Partners",
    "Did Google mislead advertisers about TrueView skippable in-stream ads for the past three years?",
    "Google may have misled dozens of advertisers and violated its own guidelines - report",
    "YouTube is about to get VERY aggressive with ad blockers",
    "Google says report claiming violations of its own video ad standards is inaccurate",
    "New Research Suggests that Google Has Misled Advertisers Over Video Ad Placement",
    "Do Google's video ads violate its standards? A new report claims the tech giant “misled” buyers.",
    "Google accused of mis-selling ads on third-party websites for years",
    "Google reportedly violates its own standards in third-party ad deals 80% of the time",
    "Google refutes claims it violated its own guidelines and misled advertisers",
    "Google's Ad Scam Eerily Similar To Facebook's Metric Inflation Scam",
    "Google accused of misleading its advertisers on over 80% of ad placements",
    "YouTube ads accused of primarily serving on low-quality websites, Google denies",
    "Study Says Google Violated Own Ad Standards, Could Face Refunds",
    "Google In Hot Water: Billions At Stake As YouTube Ads Found To Violate Terms Of Service",
    "Google Misled Advertisers About Video Ads, Study Says",
    "Online Hate and Harassment: The American Experience 2023",
    "‘Dramatic increase’: Online harassment rates surge by 51% in a year, ADL report reveals",
    "‘I have over 30 threats to rape, kill, or assault me’: Being a doctor on social media",
    "Over half of Americans have faced online hate, survey finds",
    "New Report Suggests That Hate Speech is Up on Twitter Under Elon Musk",
    "Over half of Americans report targeted online harassment - ADL survey",
    "Most Americans Have Been Harassed Online: Survey",
    "More than half of Americans have experienced online hate and harassment, report finds",
    "More than 50 percent of Americans report facing online harassment, hate: survey",
    "@dangillmor@mastodon.social",
    "@EshuMarneedi@mastodon.social",
    "Data suggests Reddit protests negatively affected traffic, advertiser engagement",
    "Reddit is telling protesting mods their communities ‘will not’ stay private",
    "Twitter's New Chief Eases Into the Hot Seat",
    "Twitter's new chief working on plans to bring advertisers back to platform - FT",
    "love how nobody's business plan is “make the site good” https://twitter.com/...",
    "Introducing Proton Pass - Protecting your passwords and online identity",
    "Proton Pass end-to-end encrypted password manager is here and free for everyone",
    "Proton Pass: Free Password Manager for iOS, Android and More",
    "Proton Pass  —  Free and fully encrypted password manager to keep your login credentials safe.",
    "Proton's Password Manager Is Now Available for Everyone",
    "Proton's password manager Proton Pass comes out of beta",
    "Proton's encrypted password manager is now available to everyone.  - The Verge",
    "ProtonMail Developer Launches Free, Encrypted Password Manager",
    "Proton's got a new password manager with email masking and more",
    "Proton launches its password manager Proton Pass, now available for download",
    "Proton Pass password manager leaves beta: here is our take",
    "Proton's new password manager has just landed for all users",
    "Proton Pass, the free password manager from Proton Mail, is out of beta",
    "Save 80% Off ‘Proton Pass Plus’ Password Manager Forever! [Limited Time Deal]",
    "Proton Pass password manager launches with a deal that's just too good to pass up",
    "Proton Pass free password manager emerges from beta",
    "Proton Pass password manager is out of beta and available for free",
    "ChatGPT creator sued for data theft in $3 billion class-action lawsuit",
    "OpenAI, maker of ChatGPT, hit with proposed class action lawsuit alleging it stole people's data",
    "OpenAI sued for allegedly ‘stealing’ data from millions",
    "ChatGPT maker OpenAI hit with class-action lawsuit over alleged data theft",
    "OpenAI Hit With Class Action Over ‘Unprecedented’ Web Scraping",
    "ChatGPT Data Harvesting ‘Reminiscent’ of Clearview AI, Lawsuit Claims",
    "Together on AI  —  We all believe in the power of AI.  And we all recognize the dangers.",
    "The AI Arms Race and Why We Need to Come Together Now",
    "Case 3:23-cv-03199  —  Plaintiffs P.M., K.S., B.B., S.J., N.G., C.B., S.N., J.P., S.A. …",
    "ChatGPT maker OpenAI faces a lawsuit over how it used people's data",
    "Binance Dropped by Paysafe for Euro Deposits and Withdrawals",
    "Binance Loses European Banking Partner Paysafe",
    "Binance Faces Another Blow as EUR Banking Partner Halts Support in September",
    "Binance's EUR banking partner announces plan to halts support",
    "Binance's European banking partner to withdraw support - CoinDesk",
    "Here's When Binance Users Have to Provide New Banking Details for EUR Deposits",
    "Binance's European Banking Partner Paysafe Withdraws Support",
    "Binance EUR Banking Partner to Halt Support of the Crypto Exchange in September",
    "Putting trust at the center of the next digital assets innovation cycle",
    "Mastercard Unveils Multi-Token Network (MTN)",
    "Mastercard Building Ethereum-Based Blockchain App Store for Regulated Financial Apps",
    "Local Government Federal Credit Union offerings",
    "Mastercard Ventures into Tokenized Bank Deposits with Multi-Token Network Pilot",
    "Mastercard Launches Digital Assets and Blockchain Initiative",
    "Mastercard UK To Test Tokenized Bank Deposits",
    "Putting trust at the center of the next digital assets innovation cycle.  Mastercard",
    "@zackwhittaker@mastodon.social",
    "Spy app LetMeSpy spied on: hackers leak victim and user data going back years",
    "LetMeSpy Phone-Tracking App Hacked, Revealing User Data",
    "Mobile spyware app LetMeSpy breached",
    "This hidden spyware app was hacked revealing thousands of users' data — was it on your phone?",
    "LetMeSpy App Hacked, Sensitive Victim and User Data Leaked",
    "Ironic: LetMeSpy Spyware Hackers Were Hacked (by Hackers)",
    "This top mobile phone spying app says it has been hacked, with thousands of users at risk",
    "Miscreants leak texts and info siphoned by Android stalkerware app LetMeSpy",
    "Data stolen in hack of spyware provider LetMeSpy",
    "LetMeSpy data leak reveals users of digital stalking software",
    "Android Users, Beware! Major Security Breach Reported Via Stealth App",
    "What secret phone-tracking app was recently hacked?",
    "LetMeSpy, a stalkerware app spying on thousands, says it was hacked",
    "Micron to Introduce GDDR7 Memory in 1H 2024",
    "Micron's stock rises as CEO says memory chip market has bottomed out",
    "Chip maker Micron beats estimates on demand from booming AI, easing glut",
    "Can the coming AI boom help Micron outrun negative China effects?",
    "Micron Technology, Inc. Reports Results for the Third Quarter of Fiscal 2023",
    "Chipmaker Micron beats revenue estimates on demand from booming AI",
    "Live news: Micron upbeat on revenue prospects but warns on impact of China ban",
    "Micron Earnings May Disappoint. The Outlook Is More Important.",
    "Micron is ‘at the bottom of this deep downturn,’ but ‘China complicates the recovery plan’",
    "@ravirockks@infosec.exchange",
    "@kimzetter@infosec.exchange",
    "@metacurity@infosec.exchange",
    "SEC notice to SolarWinds CISO and CFO roils cybersecurity industry",
    "WSJ News Exclusive | FTX Begins Talks on Reboot Amid Regulatory Crackdown on Crypto Exchanges",
    "FTT Flies 45% On Rumors Of FTX Planned Relaunch",
    "FTX reboot on the way: CEO holds talks with ‘interested parties’ — Report",
    "Failed Crypto Exchange FTX Looks to Make a Comeback",
    "FTX would take the first steps to restart its operations",
    "FTT jumps as much as 33% on news of potential FTX ‘reboot’",
    "FTX ‘Reboot’ Talks Begin and Send FTT Token Soaring 15%",
    "Crypto Exchange FTX Puts a Pause on Anthropic Stake Sale",
    "FTX Reportedly Seeking to Relaunch",
    "FTX engages in talks to bring back international crypto exchange",
    "FTX invites investors to register interest to restart rebranded exchange - report",
    "FTX begins talks to relaunch international cryptocurrency exchange - WSJ",
    "FTX Begins Talks on Rebooting Flagship International Crypto Exchange",
    "Massachusetts man is offloading 2,200 vintage Z80 computers on eBay one at a time",
    "Why 2,000 Ancient PCs Mysteriously Appeared on eBay",
    "2,200 Forgotten Vintage Computers Are Being Liberated From a Barn in Massachusetts",
    "Apple seeks to fend off EU antitrust charge triggered by Spotify at hearing",
    "Apple argues no more changes necessary to App Store policy in Spotify EU antitrust case",
    "Apple in standoff with EU over treatment of music streaming rivals",
    "TSMC sending more workers to speed up building of new Arizona plant",
    "TSMC sends more Taiwanese workers to finish Arizona plant",
    "TSMC's Arizona headache and a surprise chip deal in Japan",
    "TSMC (Taiwan Semiconductor) to send hundreds more workers to speed U.S. plant construction",
    "Free compensation benchmarking data from 3,000 startups",
    "The AI behind unconnected content recommendations on Facebook and Instagram",
    "Meta releases clues on how AI is used on Facebook and Instagram",
    "How AI Influences What You See on Facebook and Instagram",
    "Meta Offers A Glimpse Into the Black Box of AI Ranking",
    "Meta explains how its AI decides what you see on Facebook and Instagram",
    "Meta's system cards show how AI powers content recommendations on Facebook and Instagram",
    "Meta really wants to explain its AI recommendation algorithms to you",
    "Meta expects recommendation models ‘orders of magnitude’ bigger than GPT-4. Why?",
    "Celestial AI Raises $100M in Series B Funding",
    "Photonics To Make Celestial HBM3 Memory Fabric",
    "Celestial AI's $100M raise shines light on AI computing wall",
    "Personalized wealth management, built for tech people",
    "App Spotlight: Phone and Email Verifier for Zoho CRM",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Replit: From idea to software, fast.",
    "Lightmatter: Next-gen computing built for AI.",
    "Figma: Make design accessible to everyone.",
    "Adobe: Let’s create experiences that matter.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Techmeme: You might have heard of us...",
    "Wed. 06/28 - Who Needs A Mac Pro?",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Worldcoin launches in Germany and integrates with Okta's Auth0 platform",
    "Typeface, which is building generative AI for brands, raises $100M at a $1B valuation",
    "Typeface Raises $100M in Series B Funding",
    "AI startup Typeface valued at $1 bln after Salesforce-led fundraise",
    "Typeface lands $100M for its generative AI content creation engine",
    "Typeface Raises $100 Million To Set Up AI ‘Content Factories’ For Enterprises",
    "Generative AI startup Typeface raises $100M to customize enterprise content creation",
    "Silicon Valley Business Journal",
    "Oracle is no longer buying Intel processors for its data centers",
    "Oracle Increases Ampere's Momentum with New Database Support",
    "Oracle spending ‘billions’ on Nvidia chips this year",
    "Building Momentum for the Sustainable Cloud",
    "Chip startup Ampere pitches climate-friendly data centers",
    "US tech ban and strong demand for AI chips in China is fuelling NVIDIA GPU smuggling",
    "Oracle extends its flagship database to Ampere's computing chips",
    "Oracle Expands Database to Ampere Chips, Dealing a Blow to Intel",
    "Oracle spending billions on Nvidia chips this year, Ellison says (Huge AMD News)",
    "Oracle spending billions on Nvidia chips this year, Chairman Larry Ellison says",
    "TuSimple to Explore Strategic Alternatives for its U.S.-based Operations",
    "TuSimple prepares to exit US autonomous trucking market",
    "TuSimple may sell US business as it turns attention to Asia",
    "Visa to Acquire Pismo for US$ 1 billion",
    "Visa Buys Brazilian Techfin Pismo For $1 Billion",
    "Visa to Acquire Core Banking Platform Pismo for $1 Billion",
    "Visa Buys Brazilian Fintech Pismo for $1 Billion",
    "Visa to acquire Brazilian fintech Pismo for $1 billion in cash",
    "Visa to Buy Brazilian Payments Provider Pismo for $1 Billion",
    "Visa to acquire Brazilian startup Pismo for $1B",
    "Snowflake and Databricks are putting the data stored in their services to work",
    "Databricks injects array of AI tools into Lakehouse",
    "Databricks reinforces commitment to truly open data lakehouses with Delta Lake 3.0",
    "Databricks Unveils Lakehouse AI - A Platform For Building Generative AI Models",
    "Databricks Introduces New Generative AI Tools, Investing in Lakehouse AI",
    "Databricks Data + AI Summit 2023 Keynote Recap: LakehouseIQ, Delta Lake 3.0, and More!",
    "Databricks Unleashes New Tools for Gen AI in the Lakehouse",
    "Leveraging Data in Snowflake and Databricks for Optimal Results",
    "What is Delta Lake in Databricks?",
    "Databricks Offers Data Unity Option With New Delta Lake Release",
    "Databricks adds federation, generative AI front end and development tools to its lakehouse",
    "Databricks continues generative AI push, launches LakehouseIQ, Lakehouse AI tools",
    "Databricks Data + AI Summit: LakehouseIQ, Lakehouse AI and everything announced",
    "Introducing Lakehouse Federation Capabilities in Unity Catalog",
    "Snowflake, Databricks set to collide over AI",
    "Databricks Delta Lake 3.0 to counter Apache Iceberg tables",
    "Databricks builds a data mesh with the launch of Lakehouse Federation",
    "What's New with Data Sharing and Collaboration on the Lakehouse",
    "Lakehouse AI: A Data-Centric Approach to Building Generative AI Applications",
    "What's new with Unity Catalog at Data and AI Summit 2023",
    "Introducing LakehouseIQ: The AI-Powered Engine that Uniquely Understands Your Business",
    "Introducing Materialized Views and Streaming Tables for Databricks SQL",
    "Databricks' Delta Lake 3.0 bridges compatibility gaps with Apache Iceberg and Hudi",
    "🎉 Announcing Slang.ai's $20M in funding",
    "Slang.ai Raises $20M in Series A Funding Led by Homebrew",
    "Slang.ai Closes $20 Million Led By Homebrew to Empower Restaurants and Retailers with Voice AI",
    "Slang taps AI to answer phone calls for brick-and-mortar businesses",
    "Generative AI Voice Startup Slang.ai Raises $20M to Answer Phones at Restaurants and Retailers",
    "Slang.ai raises $20M to bring the power of voice AI to retailers and restaurants",
    "ChatGPT developer OpenAI to locate first non-US office in London",
    "ChatGPT maker OpenAI to open London office in major UK tech boost",
    "OpenAI opens first international office in London",
    "OpenAI's first global office will be in London, the company says",
    "OpenAI brings the competition to DeepMind's doorstep with new London office",
    "ChatGPT owner OpenAI to open first foreign office in UK",
    "OpenAI Picks London for 1st International Office",
    "OpenAI reveals location of its first international outpost",
    "Excited to announce OpenAI's first international expansion with a new office in London!  🇬🇧 🚀 …",
    "Announcing OpenAI London office: https://openai.com/...",
    "Bridging the gap: How Binance overcomes barriers to global crypto adoption",
    "Reclusive Binance co-founder Yi He speaks on SEC case",
    "Binance's Yi He sheds light on relationship with CZ, tells Bloomberg she's no Caroline Ellison",
    "DoorDash, Shifting Business Model, Will Offer Drivers Hourly Pay",
    "Introducing DoorDash's Biggest App Updates in a Decade",
    "DoorDash offers delivery workers hourly rate, but there's a catch",
    "DoorDash Adds Hourly Pay Option for Gig Economy Drivers",
    "DoorDash Introduces Hourly Minimum Wage Option for Dashers",
    "DoorDash updates to include a minimum hourly wage for drivers",
    "DoorDash introduces ‘Earn by Time’ option in select cities",
    "DoorDash Workers Can Finally Get Paid Hourly, But Only During Deliveries",
    "DoorDash will start offering couriers an hourly rate while they're fulfilling orders",
    "DoorDash introduces a slew of new features, including an ‘Earn by Time’ option for delivery people",
    "ECB welcomes European Commission legislative proposals on digital euro and cash",
    "Brussels unveils plans for a digital euro promising complete privacy",
    "The case for a digital euro",
    "European Commission aims for universal acceptance with digital euro proposal",
    "European Union Moves Forward on CBDC, Digital Euro Framework Released",
    "EU proposes to establish legal framework for potential digital euro",
    "Leaked Draft Reveals EU Commission's Plans for Digital Euro: A Closer Look at the CBDC",
    "Digital euro proposal from European Commission seeks universal approval",
    "Digital Euro System Now Underway in Europe, EU Commission Says It 'Won't Replace Cash'",
    "Europe moves closer to creating the digital euro—but privacy fears persist",
    "European Commission Publishes Proposals to Preserve Cash and Create Digital Euro Framework",
    "Privacy fears dominate launch of digital euro plan",
    "EU's plan to dominate global markets with digital euro",
    "ECB expresses support for European Commission's digital euro proposal",
    "EU could move step closer to digital euro this October, Lagarde says",
    "EU Wants Digital Euro to Complement Cash, Not Replace It",
    "EC stresses privacy in digital euro plan",
    "EU Moves Ahead With Push to Create Digital Euro for Payments",
    "EU moves closer to launching digital euro",
    "Mairead McGuinness: EU must win people's trust for digital euro",
    "EU publishes draft bill for digital euro and cash payments",
    "EU to take one giant leap towards digital euro",
    "EU Publishes Digital Euro Bill Featuring Privacy Controls, Offline Guarantee",
    "I-T Department To Knock On Social Media Influencers' Doors",
    "What Shein Influencer Backlash Can Teach Us About Taking On Opportunities",
    "How nano influencers on Instagram make money with under 10,000 followers",
    "Shein's charm offensive is off to a rocky start",
    "Shein sent American influencers to China. Social media users are furious",
    "Influencers Gas Up Shein After Sketchy Factory Tour: No Slave Labor Here!",
    "How Shein's influencer trip to a Chinese factory backfired",
    "Shein invites influencers to China to showcase its ESG efforts, but backfires",
    "They only invited people with zero critical thinking, eating this propaganda up! [video]",
    "what the hell is a confidence activist [image]",
    "You come to me, the day of my daughter's Shein influencer trip",
    "Google reportedly gives up on making AR glasses—for the third time",
    "Apple Glasses won't face competition from Google Iris smart glasses",
    "Google might bid adieu to ‘Project Iris’ augmented reality glasses: Report",
    "Google is said to have scrapped its augmented reality headset Iris",
    "Google Has Reportedly Killed its ‘Iris’ AR Glasses Project",
    "Google Kills ‘Project Iris’ Augmented Reality Glasses Project",
    "Apple Vision Pro is so good, Google trashed its next-gen Iris Glasses",
    "Google reportedly ends ‘Iris’ augmented reality glasses project",
    "Google ditching its plan to make AR glasses really doesn't matter: here's why",
    "Google Abandons Augmented Reality Glasses Project Iris to Focus on AR Software",
    "Google canceled its Apple Vision Pro rival that might have been even better",
    "Google refocuses AR strategy after ‘Iris’ shutdown",
    "Iris is the latest Google AR/VR project headed for the graveyard",
    "Google reportedly cans AR glasses hardware project",
    "Google kills off its Apple Vision Pro competitor",
    "Google has apparently killed its AR glasses - and that's good news for Apple",
    "Google's “Project Iris” goes to the graveyard",
    "Google won't be rivalling Apple Vision Pro as it scraps plans for Iris AR glasses",
    "Google is no longer building its own augmented reality glasses",
    "Google killed its AR glasses to work on AR devices from Samsung, others",
    "Google shuts down its AR headset Project Iris: Here's what it plans to do next",
    "Vote now: Google kills off its AR glasses (again). Is this the right decision?",
    "Report: Google canceled its AR Glasses hardware early this year",
    "Google building Android XR software, killed Iris AR glasses: Report",
    "Google has reportedly killed its Project Iris augmented reality glasses",
    "Google's next-gen AR glasses join the Google graveyard",
    "Looks like Google might have canceled its new AR glasses",
    "Google reportedly killed its AR glasses project",
    "[Rumor] Google Reportedly Killed Its AR Glasses Project"
]