[
    "Apple's Vision Pro headset may not come with a top strap in the box",
    "Apple “insider” reveals list of upcoming devices including the second-gen Watch Ultra",
    "Apple's fall roadmap reportedly revealed, including a 30-inch iMac and a M3 MacBook",
    "Rumor | M3 MacBook Pros of all sizes appear on new 2024 Apple product roadmap",
    "Apple Vision Pro still has a way to go",
    "Secondary overhead strap for $3,499 Apple Vision Pro headset could be sold separately",
    "Gurman: Apple working on a new iMac with a display larger than 30 inches",
    "Apple Has Finally Unveiled the Vision Pro.  Here's What It's Launching Next",
    "Twitter's tech rivals are mimicking Elon Musk's playbook — even Mark Zuckerberg",
    "We've reached peak tech bro, with billionaires suggesting cage fights and bench-press contests",
    "Musk will train if Las Vegas martial arts cage match takes hold",
    "Musk Says Cage Match With Zuckerberg ‘Might Actually Happen’",
    "@ianbetteridge@writing.exchange",
    "Truly, we live in the stupidest possible times. https://www.washingtonpost.com/ ...",
    "It's working, he's cool now https://twitter.com/...",
    "Feds seize notorious and shuttered hacking site BreachForums",
    "BreachForums seized by FBI three months after arrest of alleged admin",
    "Data Breach at New BreachForums: 4,000 members' data leaked",
    "Law enforcement seizes domains owned by “Pompompurin” and one currently owned by DataBreaches",
    "American TikTok user data stored in China, video app admits",
    "Some LastPass users are locked out of their accounts after trying to reset their authenticator app",
    "@Techmeme This company is a dumpster fire 🔥",
    "@Techmeme Who in their right mind still uses LastPass in 2023?",
    "@lauren@mastodon.laurenweinstein.org",
    "LastPass users locked out due to MFA resets",
    "LastPass users furious after being locked out due to MFA resets",
    "The iPad was meant to revolutionize accessibility",
    "@tananarivedue.bsky.social",
    "Lol, jack wants to be the new w3 for social. This is hilarious at best. https://twitter.com/...",
    "Moderation in a public commons",
    "Amazon fuels the future of AI with $100M support for generative startups",
    "The FTC-Sony Case Against The Microsoft Activision Deal Is Very Bad",
    "Xbox Says That The Console War Is Just A Social Construct",
    "Day two of Microsoft's FTC trial: Court documents point to new Xbox in 2028",
    "Xbox FTC Trial Day 2: In Which the Head of Xbox Explains Mergers to the FTC",
    "FTC vs. Xbox: Sony ‘uses revenue’ from Microsoft's games to block games from coming to Xbox",
    "Microsoft says it looked at acquiring Zynga but opted to go bigger with Activision",
    "Microsoft Concedes Xbox Lost The Console Wars But Is It Gaming The FTC?",
    "Has Xbox lost the console wars?",
    "The Elder Scrolls 6 Still ‘Five+ Years Away’, PlayStation Version Undecided",
    "Starfield exclusivity was the last straw for Microsoft, led to $7.5 billion ZeniMax buyout",
    "Todd Howard says Bethesda will talk about Starfield on Steam Deck “down the road”",
    "Here are some of the biggest revelations from the Microsoft vs FTC hearing",
    "Microsoft says Starfield was going to be a PS5 exclusive before it bought Bethesda",
    "Phil Spencer Gives Clue on When The Elder Scrolls 6 Will Release",
    "Microsoft Executive Vows to Keep ‘Call of Duty’ on Sony Consoles",
    "The Elder Scrolls 6 Doesn't Have Confirmed Platforms Yet, Is 5-Plus Years Away",
    "Microsoft acquired Bethesda after hearing Starfield would be exclusive to PlayStation",
    "Elder Scrolls VI Xbox Exclusivity Undecided, Bethesda Bought to Stop Sony Getting Starfield",
    "Microsoft Bought Bethesda To Stop Starfield Becoming A PS5 Exclusive",
    "Bethesda's upcoming Indiana Jones game will only be available on Xbox and PC",
    "Sony Planned to Make Starfield a PlayStation Exclusive Before Microsoft Acquired Bethesda",
    "Starfield's Potential PS5 Exclusivity Prompted Microsoft to Acquire Bethesda",
    "Phil Spencer says before Bethesda purchase, Microsoft heard Starfield could skip Xbox",
    "Starfield could have been a PS5 exclusive, says Xbox exec",
    "Xbox Was Worried It Would Lose Starfield Prior To Bethesda Acquisition",
    "Starfield was almost a PS5 exclusive before Microsoft bought Bethesda",
    "I should kept Twitter until Microsoft offered to buy my Twitter account. https://twitter.com/...",
    "Phil Spencer Confirms Starfield Was Potentially Going to Skip Xbox Prior to ZeniMax Acquisition",
    "Personalized wealth management, built for tech people",
    "Apollo Global leads debt investment in chipmaker Wolfspeed, media report",
    "Apollo Leads $2 Billion Private Financing for Semiconductor Firm Wolfspeed",
    "Son Of Stadia: Google May Resurrect Parts Of Tech For Instant YouTube Games",
    "Google's next gaming play might be mini ‘Playables’ in YouTube",
    "YouTube is planning to expand into online gaming with ‘Playables’: Report",
    "YouTube Playables: Online Games Are Coming to YouTube",
    "Online games will appear on YouTube: Google is testing it right now",
    "YouTube could host mobile and desktop video games",
    "Google is reportedly testing a product to play games via YouTube",
    "Just like nobody asked for, YouTube is reportedly testing in-app and in-site gaming",
    "YouTube is reportedly testing online games for mobile and desktop",
    "Google is reportedly bringing instantly playable online games to YouTube",
    "YouTube explores online gaming for its platform",
    "YouTube is testing an online-games offering",
    "youtube is testing an online gaming product, internally called “playables” https://www.wsj.com/...",
    "WSJ News Exclusive |  Google's YouTube Is Testing an Online-Games Offering",
    "Free compensation benchmarking data from 3,000 startups",
    "Effective scheduling is key to workforce optimization",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Character.AI: Build something smarter than you.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Fathom: The leader in medical coding automation.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "PayPal: Opening opportunities for all.",
    "Replit: From idea to software, fast.",
    "Techmeme: You might have heard of us...",
    "(Portfolio Profile) The Player's Lounge",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "New Technologies and Jobs in Europe",
    "Who could have known?! https://twitter.com/...",
    "Draft EU plans to allow spying on journalists are dangerous, warn critics |  Surveillance",
    "@irwinfletcher.bsky.social",
    "@stephenjudkins.bsky.social",
    "@summeremacs@fashionsocial …",
    "Why Has Mastodon Adoption Stalled?",
    "messages on mastodon tend to be too elaborate.  as well as some very tone-deaf ui choices",
    "I can honestly say that I've had the exact opposite experience since I've migrated to Mastodon.",
    "Ya this is all about right https://blog.bloonface.com/...",
    "Thoughtful post on why Mastodon adoption may have slowed: https://blog.bloonface.com/...",
    "@wezm@mastodon.decentralised.social",
    "This is a good read: https://blog.bloonface.com/...",
    "@summeremacs@fashionsocial.host",
    "It didn't fail, it was impossible, the wrong idea. more later... https://blog.bloonface.com/...",
    "7 months later and about 25% have dropped off it seems https://blog.bloonface.com/... [image]",
    "IBM Is in Talks to Buy Apptio for as Much as $5 Billion",
    "IBM nears deal to buy software company Apptio for $5 billion: WSJ",
    "IBM nears $5 billion deal for software provider Apptio: Report",
    "Truly the sign of a great business whose best days are ahead of it. https://twitter.com/...",
    "The Flex Report (June 2023)",
    "Flex Report: Tech Industry Deep Dive",
    "‘The war on remote work is not over.’ But one group in particular is heading back to the office.",
    "Study: Small Companies Are More Flexible with Hybrid Work",
    "Amazon to invest $15 billion more in India, says CEO Andy Jassy",
    "Amazon commits to $15 billion India investment, says Chief Executive Andy Jassy",
    "Amazon to take its India investment to $26 billion by 2030",
    "What Amazon, Google, And Microsoft Announced After PM's ‘Hi-Tech Handshake’",
    "Amazon CEO Andy Jassy says ready to invest $15 billion more in India",
    "Modi in US: Amazon CEO Andy Jassy commits to $15 billion investment in India",
    "Amazon to invest $15b more in India",
    "Amazon Plans To Invest Another $15 Billion in India By 2030",
    "EU and Meta set to face ultimate online content test",
    "Meta CEO Mark Zuckerberg and OpenAI CEO Sam Altman support EU AI Act",
    "EU, Meta agree to July stress test on EU online content rules",
    "EU welcomes Meta plans for tough content rules",
    "Meta agrees to July ‘stress test’ on new EU content rules",
    "AI chip giant Nvidia ‘extremely likely’ to invest in Europe, says CEO Jensen Huang",
    "EU official visits Twitter headquarters to ‘stress test’ its ability to handle content moderation",
    "Twitter is willing to comply with EU's Digital Services Act, says Breton",
    "International Business Times",
    "Musk vs Zuckerberg: Cage fight or not, an AI duel is in the offing",
    "Khai Wu, Mark Zuckerberg's MMA Trainer, Talks Potential Cage Fight With Elon Musk",
    "Roundup: Imploding subs and a billionaire cage match",
    "Elon Musk, Mark Zuckerberg ‘dead serious’ about cage fight, UFC boss says",
    "Instagram's Twitter Competitor Launching in Mid-July: Report",
    "Elon Musk Vs. Mark Zuckerberg In MMA Fight - How Will This Shake The Crypto, Metaverse Arena?",
    "Why in the world are Elon and Zuck planning to punch each other?",
    "Elon Musk, Mark Zuckerberg ‘Dead Serious’ About UFC Fight: 'Let's Go Full MMA'",
    "sanely? so who's running it https://twitter.com/...",
    "@petergyang It's a totally new text based app",
    "@SlugtalesNews @alexeheath Jack's Blue Sky is my choice. Can't wait.",
    "I have a feeling this might be the Twitter-killer. https://twitter.com/...",
    "@alexeheath So Instagram is not only TikTok but also Twitter?",
    "Some more reporting on the Fediverse aspect of this app: [image]",
    "IRL admits 95% of its app users fake, will shut down",
    "Was he featured in Forbes https://twitter.com/...",
    "Another unicorpse. Who's keeping a list? https://www.theinformation.com/ ...",
    "Barely scratching the surface... https://twitter.com/...",
    "Katie wins the year with unicorpse https://twitter.com/...",
    "New tech fraud just dropped! 🍿 https://twitter.com/...",
    "Another Frank! https://twitter.com/...",
    "Why do so many startups funded by SoftBank end up imploding like a submersible? ↓ [image]",
    "19 out of 20 “users” were not 🤯 https://twitter.com/...",
    "Such negativity—why not say 5% are real? https://twitter.com/...",
    "Social app IRL, which raised $200 million, shuts down after CEO misconduct probe"
]