[
    "@chris@mstdn.chrisalemany.ca",
    "@javahippie@freiburg.social",
    "Threads, Instagram's ‘Twitter Killer,’ Has Arrived",
    "Adam Mosseri says Meta's Threads app won't have ActivityPub support at launch",
    "Meta's Threads is a true threat to Musk-owned Twitter, analysts say",
    "Instagram Will Now Let You Add Up to Three Collaborators on Posts and Reels",
    "Threads Is a Real Threat. How It Could Beat Twitter.",
    "Meta's new Threads app kicks Twitter while it's down",
    "We tried Threads, Meta's new Twitter rival. Here's what happened",
    "A Look at the Threads UI, and Features Coming to the Twitter Alternative App",
    "Instagram Launch of Twitter Rival ‘Threads’ Expected on Thursday",
    "Dead on arrival  —  https://www.platformer.news/ ...  [image]",
    "threads feels corporate. all the brands came in with tons of followers",
    "If you needed a reason to join threads, this is it [image]",
    "IG famous people posting on threads like “morning coffee ❤️” I can't do this??????????",
    "@georgebsocial @TimSweeneyEpic yea, I agree. I don't like typing / sharing things on a mobile app",
    "lol Zuck just can't help himself [image]",
    "A well executed animation like this pull to refresh in Threads just feels sooooo good. 😚 [video]",
    "threads quite quickly giving linkedin energy [video]",
    "first post i seen on threads. already wanna kms [image]",
    "lol threads currently using the “you have no control over what you see model” [image]",
    "good morning to everyone except for da bomb",
    "Wait so Rabois, Marc and everyone else are going to have to re-block me 😂😂😂",
    "Okay this app is pretty cool but WHY IS THE TEXT SO SMALL",
    "Oh look.  The drama of Twitter is already here.  Hahahah.",
    "Can't get enough of your threads 🎶",
    "How do you work this fuckin thing",
    "Our boss: What's your social strategy for Threads?  Us:",
    "Excellent threads, @lewishamilton.",
    "Great job with this app @zuck !  Love how well it works and how simple it is.",
    "Someone check on the bird app 😈",
    "Me trying to navigate my Threads feed of people I don't follow on Instagram.",
    "me opening any other app right now...",
    "please help make this the first viral threads tweet",
    "I know it's called threads but can we please leave the spool emoji on twitter 🧵",
    "More engagement from 3k followers on here than 5m on Twitter.  Hmmmm",
    "Sorry I'm late, I was threading",
    "Threads hits 5M signups in the first four hours",
    "@luis_in_brief@social.coop",
    "@GossiTheDog@cyberplace.social",
    "Meta Won't Offer Threads App in the EU on Regulatory Concerns",
    "Instagram's Threads bursts out of the gate with more than 23 million sign ups",
    "Meta Made Clear Quest Pros For Some Employees Who Worked On It",
    "How Brexit allowed UK to get Instagram Threads before EU",
    "Zuckerberg uses Threads to say Twitter has missed its chance",
    "Meta Threads hands on: A cleaner, friendlier Twitter",
    "The Morning After: Meta's Twitter rival, Threads, is finally here",
    "Zuckerberg Aims to Make Threads a 1-Billion Member App",
    "How to find Threads badge on Instagram",
    "Explainer: Understanding the ‘ticket’ for Threads on Instagram and how users can sign up",
    "Meta's Twitter Alternative ‘Threads’ Now Available",
    "7 of Twitter's most followed users have jumped onto Threads: ‘May this platform have good vibes’",
    "Here are 4 things you can't do on Threads, an Instagram app",
    "Instagram's Threads: all the updates on the new Twitter competitor",
    "Head of Instagram says placing ads within Threads is “not a priority right now”",
    "Threads, Meta's Twitter competitor, is now live",
    "Instagram Unveils Threads App, a Major Threat to Musk's Twitter",
    "A bunch of things not on Threads yet",
    "Meta's Threads hits app stores, but no EU launch in sight",
    "The Instagram Threads launch countdown jumped forward and is now targeting 7PM ET",
    "Download Threads by Instagram app for Android and iOS",
    "Zuckerberg's Twitter clone Threads is live.  Here's what you need to know.",
    "Meta's Threads app launches in 100 countries, hitting 10 million users in 7 hours",
    "5 Things to Know Before the Stock Market Opens Thursday",
    "Execs Say 10M Joined Threads in First 7 Hours",
    "How to sign up for Threads - the new social media app on the block",
    "Instagram launches Twitter-like social networking app called Threads",
    "Digiday+ Research Briefing: Instagram hopes Threads will overtake Twitter as top messaging app",
    "Mark Zuckerberg's Twitter Killer Is Shockingly Viable. Oh No.",
    "Zuckerberg Under Fire in China After Report of Quest Sale Talks",
    "Mark Zuckerberg's Sneak Attack: Twitter Rival Threads Launches Earlier Than Expected",
    "What you need to know about Threads, Instagram's new Twitter killer app",
    "Meta's Threads Is Here. What It Is and How to Use It",
    "Mark Zuckerberg just released Threads, Meta's new rival to Twitter. Here's how to sign up",
    "Meta Launches Instagram Threads, its Twitter Killer",
    "Instagram's Twitter competitor, Threads, is available now",
    "Meta's Threads app is here to challenge Twitter",
    "Instagram Launches Threads, a Text-Based ‘Conversation’ App, in Challenge to Elon Musk's Twitter",
    "Welcome To ‘Threads,’ Facebook's Twitter Killer",
    "Meta's Twitter competitor Threads won't support ActivityPub at launch",
    "Instagram's Twitter clone, Threads, is available to download again",
    "i hope every body finds the social media home they truly deserve",
    "[Image: Spider-Man Pointing at Spider-Man]",
    "Must confess to a deep love of fashion & architecture",
    "logging into threads to get my class action privacy settlement in 5-10 years",
    "Here's a first look at Instagram Threads on the web! 👀 [image]",
    "Elon Musk on Instagram August 21, 2018 [image]",
    "threads first impressions It's good Really good Elons in trouble",
    "Gosh. Yuk. Hmmmm. Really, Threads? [image]",
    "Meta's new app was built entirely using this keyboard: [image]",
    "Threads has been available for 30 minutes and people are already roasting Zuckerberg [image]",
    "Zuck is already using his new app to pitch himself on podcasts [image]",
    "the fact that it will eventually work with decentralized social media apps is really intriguing.",
    "Threads will 100% only be a thing people use for maybe a month",
    "This is getting ridiculous [image]",
    "Did Meta just launch a new social media website without a website?",
    "It turns out, building an Instagram account is now 100x more valuable",
    "This and how you have to give it access to your contacts means NFW. https://twitter.com/...",
    "Folks, Instagram images preview on Threads [image]",
    "Users in EU can view threads on Threads, but can't sign up. https://www.threads.net/...",
    "Sad to inform the social media interns at brands are at it already [image]",
    "threads feels like for designers, by designers so far https://www.threads.net/...",
    "this is how you return from an 11-year twitter hiatus. https://twitter.com/...",
    "Mark Zuckerberg's first tweet in 11 years and he's trolling Twitter 🙃 https://twitter.com/...",
    "Rolling out now in 100+ countries. Learn more 👇 https://about.instagram.com/ ...",
    "Seeing former Twitter employees use Threads is chefs kiss.",
    "Let's do this. Welcome to Threads. 🔥",
    "Not followers 10k FRIENDS 🥹",
    "the priority is the mobile apps, but we are working on www",
    "Zuck you need to be actively shitposting on here to make that happen.  LFG!",
    "Not my style personally, but I'm sure there will be plenty of entertaining content here...",
    "Hope your shoulder is healing.  Can't wait for your next fight!",
    "Excited about my buddy @zuck 's new venture.  Threads...happy to be here.",
    "Bosses joining Threads like:",
    "Ugh I'm ALWAYS a very early adopter and 2303439 feels way late 🥺🥺",
    "Credit where it's due, they pioneered the format and have done great work",
    "There are so many great little design touches in threads.  Really great.",
    "You can start with @rourkery and @briansw but theres more folks ❤️",
    "It's so over, we're so back",
    "Congrats on the launch @zuck!  Needed this space.",
    "Anyone think this can become bigger than twitter!?",
    "We are definitely focusing on kindness and making this a friendly place.",
    "At this rate Twitter will be reduced to just a bunch of...threads",
    "Twitter = tweets Mastodon = toots Bluesky = skeets Threads = threats",
    "So is each post a ‘Stitch’?",
    "Waiting for my friends to join me [image]",
    "Meta launches Instagram Threads in a direct challenge to Twitter",
    "@rwaddilove@techhub.social",
    "If You Want to Delete Threads, You'll Need to Delete Your Entire Instagram Account",
    "How to Delete or Deactivate Your Threads Account",
    "Want to Delete Your Threads Profile? Then Delete Your Instagram Account, Says Meta",
    "What is Threads? How to sign up and how it differs from Twitter",
    "Threads feed of people you follow ‘on the list’; can't delete your profile; more",
    "You can't delete your Threads profile without deleting your whole Instagram",
    "Does deleting Threads account delete your Instagram too?",
    "Deleting your Threads profile will also kill your Instagram account",
    "Threads: how do I sign up and is it any different to Twitter?",
    "Don't be so quick to jump on Meta's Threads hype train: read this first!",
    "Meta Launches Threads, Betting Instagram Mojo Can Take on Twitter With New App",
    "What is Instagram Threads? First Impressions and How To Use It",
    "Deleting The New Threads App Will Also Delete Your Instagram",
    "WATCH: How to set up Instagram Threads",
    "Threads: Meta's Twitter Rival Has Arrived",
    "Twitter competitor Threads won't let you delete your account unless you also delete Instagram",
    "Meet Meta's Twitter rival: Here are 9 cool things about Threads",
    "Meta: You can't delete your Threads profile without deleting Instagram",
    "Twitter's biggest rival, Threads, is official and live in 100 countries",
    "Meta launches Instagram Threads to dethrone Twitter",
    "Meta Threads briefly went live earlier than planned",
    "@Techmeme This is similar to Google, Microsoft and others.  One account for multiple services.",
    "I'm muting this but here's a screenshot [image]",
    "This is the bit where someone says, “I told you so!” https://techcrunch.com/...",
    "https://techcrunch.com/... *laughs maniacally*",
    "NEW: @meta WILL ELIMINATE YOUR INSTAGRAM ACCOUNT IF YOU DELETE YOUR THREADS ACCOUNT [image]",
    "You can't delete threads by itself. https://techcrunch.com/...",
    "Guess I'm stuck with this app...",
    "Meta will nuke your Instagram account if you delete Threads profile",
    "Threads profile can only be deleted by deleting Instagram account, Meta says",
    "Threads: Ten million join Meta's Twitter rival, Zuckerberg says",
    "Meta's Threads passed 20 million users within 12 hours, and it's not slowing down",
    "Instagram's Twitter Copycat Threads Meets Pent-Up Demand",
    "Meta takes aim at Twitter with Threads app, millions join",
    "Instagram's Threads app already has over 25 million registered accounts.",
    "Meta's Rival to Twitter Already Has 10 Million Users. What to Know About Threads.",
    "Threads app surges to 10M users, Zuckerberg says of Twitter rival",
    "10 million join Threads in under 10 hours, boosted by Instagram integration",
    "Threads app: Meta's Twitter rival logs five million users in first four hours after going live",
    "Threads gained 10 million new users in seven hours",
    "Mark Zuckerberg gloats over Threads' 10 million signups",
    "Ten million flock to Meta's rival to Twitter, says Zuckerberg",
    "10 million users joined Meta's Threads in just 7 hours. It took Twitter 780 days to do that",
    "Threads, Meta's answer to Twitter, surpasses 10 Million users in just seven hours",
    "10 million people joined Threads in the first 7 hours, Zuckerberg claims",
    "Instagram's Twitter killer Threads smashes 10 million user milestone hours after launch",
    "Zuckerberg's Twitter rival Threads reaches 10M users in 7 hours",
    "Threads reaches 10 million registrations in first 7 hours",
    "Millions flock to Instagram Threads, Elon Musk laughs at it",
    "It took 7 hours for Threads to reach 10 million users",
    "Twitter Competitor Threads Hits 5 Million Sign-Ups In 4 Hours, Meta CEO Mark Zuckerberg Says",
    "As Twitter Falters, Threads Surpasses 5 Million Sign Ups on Day One",
    "Threads: Five million join new Meta app in matter of hours",
    "Welp, @FabrizioRomano is on Threads. It's for real [image]",
    "10 million sign ups in seven hours 🤯",
    "Threads just passed 2 million sign ups in the first two hours.",
    "Just passed 5 million sign ups in the first four hours...",
    "Arriving on Threads like...",
    "And here I was just a few hours ago putting rocket ship emojis on the 5 million post ...",
    "@amethyst@haunted.computer",
    "@jaredwhite@indieweb.social",
    "Standard protocol: In a post-Twitter world, Mastodon and Bluesky need to get on the same page",
    "Threads/Twitter: copycat app hits Elon Musk where it hurts",
    "Everything you need to know about the new Twitter-like app called ‘Threads’",
    "Does Threads work on desktop? Web app explained",
    "Meta takes on Twitter with Instagram-made Threads app",
    "Meta's Twitter rival is here, and it is off to a flying start",
    "Instagram Threads memes are so funny it will make Elon Musk cry",
    "Meta has unveiled an app called Threads to rival Twitter",
    "[Explained] Instagram Threads: What is it, How is it Different from Twitter",
    "Threads, Meta's Twitter rival, is tracking you in all sorts of ways",
    "Interoperability Will Be Key To Meta's Threads Success",
    "Instagram Threads: All you need to know about the new Twitter rival app",
    "Millions sign on for Meta's Threads - here's how it is fighting Twitter + get the app",
    "Is NFT Twitter Dead? Influencers Swarm Over to Zuckerberg's Twitter Rival - Threads",
    "Twitter rival Threads crosses 10 mn users within hours of launch",
    "Hands-on with Threads - Instagram's promising Twitter rival misses key features",
    "Special Episode: Meta's Twitter Rival Arrives, with Adam Mosseri",
    "Instagram Threads signs up 5m people in its first four hours",
    "SamMobile is now available on Threads, and you can follow us",
    "Threads and Bluesky. [video]",
    "@jkottke@saturation.social",
    "@chopaganda@shakedown.social",
    "How to get verified on Threads",
    "Threads using decentralised protocol clear victory for our cause: Mastodon CEO",
    "Meta on the Fediverse: Thread or Opportunity",
    "Everything you need to know about Threads, Instagram's Twitter clone",
    "How many days will it take for FB's Threads app to have more users than Mastodon?",
    "Hey @mosseri, quick question.  What button do I press so I only see the people I follow?",
    "Zuck doing this to Elon during Cancer season is top shelf petty.",
    "What to know about Threads",
    "International Business Times",
    "Threads, Koo, Bluesky: best Twitter alternatives you can try",
    "‘Goodbye Twitter’: Users say they're ditching the app for Mark Zuckerberg's Threads",
    "Threads Had Big Launch Energy. Twitter Is Under Pressure",
    "Threads App Trending On Twitter: Hilarious Meme Fest Begins; Elon Musk Joins Fun [Reactions]",
    "PlayStation and Other Gaming Titans Flock to Twitter Rival Threads",
    "Analysts Are Optimistic About Zuckerberg's Twitter Rival, Launching July 6",
    "in case there's anyone still here, here's what it's like over there https://www.ft.com/...",
    "is this a place where we capitalize words y/n",
    "lol remember when we all hated meta / facebook and now we're back at it with the new shiny toy",
    "Which one cooler?  🧵🪡 A. Threader B. Threadist C. Threadhead D. Threadmate",
    "The pitch meeting for Threads: “It's Twitter but swap nazis for brands.”",
    "@DrYohanJohn@fediscience.org",
    "@timnitGebru@dair-community.social",
    "@emilymbender@dair-community.social",
    "CFTC Concludes Former Celsius CEO Mashinsky Broke Rules Before Firm's Collapse: Report",
    "CFTC Mulls Filing Fresh Case Against Celsius Network, Former CEO Mashinsky: Report",
    "Celsius and former CEO Mashinsky broke US rules, CFTC concludes: Bloomberg",
    "Celsius ex-CEO ‘broke rules’, Valkyrie refiles for Bitcoin ETF, Fink backs crypto",
    "Celsius, Ex-CEO Alex Mashinsky Broke CFTC Rules: Bloomberg",
    "Bankrupt Lending Firm Celsius Moves $70 Million in Altcoins to Swap for Bitcoin and Ether",
    "CEL falls after Celisus Network and its former CEO found guilty",
    "Celsius And Ex-CEO Mashinsky Violated US Regulations, CFTC Rules",
    "CFTC Finds Former Celsius CEO Mashinsky Broke Number Of US Rules",
    "CFTC accuses Celsius of misleading investors, may file a lawsuit",
    "Crypto Daily Roundup: Larry Fink says ‘Crypto is Digitizing Gold’",
    "CFTC Concludes Bankrupt Crypto Lender Celsius Broke Rules, Lawsuit Coming?",
    "CFTC to find Celsius and Former CEO Mashinsky violated US rules, Bloomberg reports",
    "CFTC Finds Celsius And Alex Mashinsky Guilty Of Breaking US Rules",
    "CFTC investigators conclude ex-Celsius CEO Mashinsky broke US rules: Report",
    "CFTC Investigators Conclude Crypto Lender Celsius, Ex-CEO Broke Rules",
    "Our Plan for a Sustainably Open Social Network",
    "Decentralized Twitter Rival Bluesky Announces $8M Fundraise, Paid Services",
    "Bluesky starts selling domains to avoid advertising",
    "Purchase and Manage Domains Directly Through Bluesky",
    "Bluesky begins offering custom domains in its bid to remain ad-free",
    "This is a pretty reasonable and inoffensive first paid service.  [embedded post]",
    "turns out taylor swift wasn't as savvy as we all thought huh [image]",
    "Great story on Tom Brady & FTX https://www.nytimes.com/...",
    "A Too Good To Check classic. [image]",
    "Cryptocurrencies went from the future of finance to the future of celebrity lawsuits",
    "@fawfulfan@mastodon.social",
    "@twwilliams@curmudgeon.cafe",
    "What could go wrong? [embedded post]",
    "[Invitation] Galaxy Unpacked July 2023: Join the Flip Side",
    "Samsung will unveil its new foldables on July 26th",
    "Samsung to Hold Next Galaxy Unpacked Event on July 26",
    "Exactly When Samsung Will Launch Galaxy Z Flip5, Galaxy Z Fold5",
    "Samsung to introduce its Galaxy Z Fold 5 and Z Flip 5 on July 26 to global markets",
    "Galaxy Z Fold 5 and Z Flip 5: Samsung confirms unveiling date, official images leak",
    "You can now pre-reserve Galaxy Z Flip 5, Fold 5, Tab S9, and Watch 6 in India",
    "Pre-order Galaxy Z Fold 5, Flip 5, Tab S9, or Watch 6 and Receive $50 Credit in the US",
    "Galaxy Unpacked 2023 Set for July 26: Join The New Flip Side",
    "Watch the Samsung Galaxy Unpacked - Journey to Seoul advertisement [KM]",
    "Samsung Galaxy Unpacked 2023 confirmed: Here's what's launching",
    "Samsung Galaxy Z Fold 5 and Flip 5 preorder reservations are live: book yours now!",
    "The Samsung Galaxy Z Flip 5 and more are confirmed to be landing on July 26",
    "Samsung confirms Galaxy Unpacked date; Galaxy Z Fold 5, Flip 5 launching on July 26",
    "Samsung Galaxy Z Fold 5 rumored price drop — how low could it go?",
    "Samsung Electronics to hold Galaxy Unpacked event on July 26",
    "Where to watch Samsung's July 26 Galaxy Unpacked event",
    "Samsung's summer foldable event officially streams on July 26th",
    "Samsung Unpacked Confirmed for July 26: ‘Join the Flip Side’",
    "The Galaxy Buds could be a no-show at Samsung Unpacked",
    "Introducing Superalignment  —  We need scientific and technical breakthroughs to steer …",
    "OpenAI is forming a team to rein in superintelligent AI",
    "OpenAI commits to ‘superalignment’ research",
    "OpenAI launches ‘superalignment’ team to tackle superintelligence risks head-on",
    "ChatGPT maker to dedicate a fifth of compute power to preventing ‘rogue’ AI",
    "OpenAI forms a new team to ensure safe development of Superintelligent AI",
    "OpenAI creates a new team to tackle ‘superintelligent’ AI systems",
    "OpenAI introduces team dedicated to stopping rogue AI",
    "OpenAI bets on new Superalignment team to stop AI going rogue",
    "*blank stare* 🥴🥴🥴🥴 https://twitter.com/...",
    "Four years to save humanity from its own creation... the race is on... https://twitter.com/...",
    "so many grandiose sounding yet vacuous words in one blog post https://twitter.com/...",
    "OpenAI has gone off the deep end. https://openai.com/...",
    "I had to read the mind-numbing word “superalignment” and now so do you. https://twitter.com/...",
    "My alignment is bigger than yours. https://twitter.com/...",
    "“we aim to make sure god has good morals” https://twitter.com/...",
    "How droll. What we really need is a superduperalignment team. https://twitter.com/...",
    "Guys, time to drop a new buzzword https://twitter.com/...",
    "Introducing Superalignment",
    "openai: Superintelligence is coming in 10 years.",
    "OpenAI: Introducing Superalignment",
    "Introducing Superalignment - OpenAI blog post",
    "Introducing Superalignment by OpenAI",
    "In NYC, companies will have to prove their AI hiring software isn't sexist or racist",
    "NYC law governing AI-based hiring tools goes live",
    "New York employers must now tell applicants when they encounter AI",
    "America's first law regulating AI bias in hiring takes effect this week",
    "New York City Targets AI Use in Hiring: Anti-Bias Law Explained",
    "AI hiring tools to be audited for sexism and racism under New York law",
    "Spotify is booting legacy subscribers still paying via Apple's App Store",
    "Spotify is removing App Store payment option for legacy subscribers",
    "Spotify cutting off remaining customers paying through the App Store",
    "Spotify stops accepting payments that were set up through Apple's App Store",
    "Spotify kicks off legacy subscribers still paying through the App Store",
    "How to update your Spotify payment method",
    "You won't be able to pay for your Spotify with App Store payment soon",
    "Spotify subscribers: You can't pay through App Store any more",
    "Grandfathered Spotify Premium subscribers can no longer pay via the App Store",
    "Spotify Subscribers No Longer Allowed to Pay Through App Store",
    "Spotify Stops Accepting Payments Set Up Via Apple's App Store",
    "Venture Spending Drops by Almost Half in US",
    "Global VC deals slipped further in Q2 | Pitchbook",
    "So hard to believe it's just -50% [embedded post]",
    "Free compensation benchmarking data from 3,000 startups",
    "Air Force colonel says it took AI 10 minutes to complete a task that can take humans days",
    "Pentagon is testing whether AI can plan response to an all-out war",
    "@Techmeme @KatrinaManson 😂",
    "@danielschuman@mastodon.social",
    "@maxleibman@mastodon.social",
    "Twitter silently removes login requirement for viewing tweets",
    "Meta and Twitter's Social Media Fight Begins. Sorry Musk, Zuckerberg Wins Round One.",
    "Why Meta Platforms Was Rising Today",
    "Talk about flippity-floppity!!  —  https://techcrunch.com/...",
    "L, and I cannot stress this enough, OL.  [embedded post]",
    "they figured out what another microservice does [embedded post]",
    "hahahahahahhahahahahahahahhahhahahahaha hahahahahahahahaa https://techcrunch.com/...",
    "Phew. Glad the Very Special Emergency was resolved quickly. https://twitter.com/... [image]",
    "Personalized wealth management, built for tech people",
    "Talent redeployment: Ensure good talent grows with your company's needs",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Replit: From idea to software, fast.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Lightmatter: Next-gen computing built for AI.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Fathom: The leader in medical coding automation.",
    "Techmeme: You might have heard of us...",
    "Wed. 07/05 - Twitter Chaos: The Real Fireworks",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Jul 11-12VentureBeat TransformSan Francisco",
    "Jul 26Samsung Galaxy Unpacked \"Join the Flip Side\" media eventSeoul",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "FIS Sells Worldpay Stake to GTCR For $18.5 Billion",
    "FIS agrees sale of majority stake in Worldpay at $18.5bn valuation",
    "Fidelity National to Sell Majority Stake in Worldpay for $12 Billion",
    "FIS to sell stake in merchant business to GTCR in $18.5 bln deal",
    "Apple chip production unaffected by Chinese sanctions, but things could get much worse",
    "China Says Critical Metals Curbs ‘Not Targeting’ Any Country",
    "After TSMC, NXP Semiconductors says no material impact from Chinese export curbs",
    "GT Voice: US, its allies need to listen to China's warning on key materials exports",
    "China says it told the U.S. and Europe about the export controls in advance",
    "Taiwan chip giant sees no production hit from China curb on rare metals",
    "@mikedewar@mastodon.online",
    "Mastercard AI-powered tool to help banks fight fraud",
    "Ethereum NFT royalties hit 2-year low as Bored Ape floor price falls below 30 ETH",
    "Blur founder defends platform amid NFT market slump",
    "Blur founder denies NFT exchange drags down prices",
    "Declining Royalty Payments: Nansen Study Highlights NFT Creator's Concerns",
    "It gets funnier by the day that they tried to brand this shit “web3” [embedded post]",
    "Thinking of getting into NFTs now https://twitter.com/...",
    "Twitter receives money transmitter licenses in three US states",
    "Microsoft on TeamsPhisher: ‘Nothing to see here’",
    "New tool exploits Microsoft Teams bug to send malware to users",
    "Vimeo Announces Departure of Anjali Sud as CEO, Appointment of Adam Gross as Interim CEO",
    "ZIRP was nuts [embedded post]",
    "BREAKING: Vimeo is still around https://twitter.com/...",
    "@danilo.redeem-tomorrow.com",
    "Gfycat.com shuts down on September 1 and all Gifs will be taken down",
    "Gfycat is shutting down on September 1st.Time to save all your Gfycat GIFs. …",
    "Gfycat, the Snap-owned GIF hub, shuts down on September 1",
    "Prepare for a meme massacre: Snap snuffs out Gfycat in September",
    "ChatGPT's explosive growth shows first decline in traffic since launch",
    "ChatGPT's Success Hits a Speed Bump With Decreasing Traffic",
    "ChatGPT's Website Traffic Dipped for the First Time Since Its Launch,",
    "Karkhana.io digitizes the manufacturing process",
    "Actively exploited vulnerability threatens hundreds of solar power stations",
    "Critical RCE Vulnerability Puts 330,000 Fortinet Firewalls at Risk",
    "Munich's EGYM takes on $225 million via Jared Kushner's Affinity Partners as it eyes an IPO",
    "Generative AI Games Raise Copyright Ownership Concerns",
    "Fairphone 4—the repairable, sustainable smartphone—is coming to the US",
    "Murena Fairphone 4 debuts in the US with deGoogled operating system",
    "The Fairphone 4 has made its way to the US, but with a twist",
    "The modular Fairphone 4 is now available in the US, but there's a big catch",
    "Fairphone 4: A Phone For Those Who Care About Sustainability, Not Megapixels",
    "Fairphone 4—the repairable, sustainable smartphone, is coming to the US",
    "The environmentally conscious Fairphone 4 is finally coming to the US",
    "Fairphone is coming to America"
]