[
    "OpenAI rolls out web browsing and plugins to all ChatGPT Plus users",
    "OpenAI rolling out ChatGPT plugins to Plus users",
    "OpenAI brings 70+ ChatGPT plugins and web search to all ChatGPT Plus users",
    "Introducing New Features in ChatGPT",
    "How to Turn on ChatGPT's New Beta Web Browsing and Plugins Features",
    "International Business Times",
    "@ampersarnie@mastodon.social",
    "Twitter says it will restrict access to some tweets before Turkey's election",
    "Twitter under fire for perceived censorship ahead of election in Turkey",
    "Twitter succumbs to Erdoğan's pressure, silences key voices in Turkey on election eve",
    "Twitter Restricts Content in Turkey Ahead of Elections",
    "Why Turkey's Election Is All About the Economy",
    "Turkey Decides Erdogan's Future In Knife-edge Vote",
    "Earthquakes and the economy leave Turkey's Erdogan facing his toughest election battle in years",
    "Turkey elections: how likely is an information blackout?",
    "An Erdogan Loss in Turkey Would Stir Relief in the West and Anxiety in Moscow",
    "@Techmeme There's nothing fishy about that, at all.",
    "Elon Musk, free speech champion https://www.forbes.com/...",
    "Free speech king Elon Musk strikes again! https://twitter.com/...",
    "this whole Twitter free speech thing is going just as you might expect https://twitter.com/...",
    "Free speech absolutist seems super sensitive today https://twitter.com/...",
    "Snapchat influencer launches an AI-powered ‘virtual girlfriend’ to help ‘cure loneliness’",
    "This AI girlfriend made $72k in a week",
    "AI is about to take parasocial influencer relationships to the next level",
    "Amazon optimizes delivery network for speedier delivery, lower costs",
    "Amazon Workers Launch Battle to Unionize in Britain",
    "Forget ChatGPT. These Are the Best AI-Powered Apps.",
    "Co-Writing with Opinionated Language Models Affects Users' Views",
    "Biometric data is the new oil. https://www.context.news/...",
    "Pakistan's political turmoil over Imran Khan's arrest, explained",
    "Pakistan Ex-PM Imran Khan Calls For Nationwide Protests",
    "Pakistan PM Orders Those Involved In Violence Tracked Down And Arrested",
    "Former Pakistan PM Imran Khan granted bail, leaves court",
    "‘Support democracy. No question of martial law’ says Pakistan army amid unrest",
    "Imran Khan, the Pakistani politician taking on the army",
    "New York AG fines companies that spammed FCC with fake anti-net neutrality comments",
    "Three Companies Faked Millions of Comments Supporting 2017 Repeal of ‘Net Neutrality’ Rules",
    "Free compensation benchmarking data from 3,000 startups",
    "‘Android 14’ was mentioned once during the I/O 2023 keynote",
    "You Don't Need an HDR Display to See Android 14's ‘Ultra HDR’ Photos",
    "Five trends that may change the course of Generative AI models",
    "The future of how AI is made and used is at a crossroads. https://www.technologyreview.com/ ...",
    "15 of the best, funniest picket signs from the writers' strike",
    "The better way to manage your contacts and deepen relationships",
    "Turn product data into revenue without engineers",
    "10 simple ecommerce email ideas to improve ROI in 2023 (Part 1)",
    "Google: Bring questions. Build answers.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Adobe: Let’s create experiences that matter.",
    "Fathom: The leader in medical coding automation.",
    "Stripe: Help us build universal payments.",
    "TikTok: Inspire creativity and bring joy.",
    "Yelp: Connect people with great local business.",
    "Discord: Building something you actually use.",
    "Airtable: What will you make?",
    "Techmeme: You might have heard of us...",
    "(Bonus) Apple II History With Laine Nooney",
    "May 17Earnings: CSCO, Tencent, TTWO",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "JioCinema vs Hotstar and other OTTs compared: Which to subscribe and which to skip",
    "JioCinema Unveils Subscription Plan For Premium Content To Take On Netflix, Other OTT Rivals",
    "JioCinema Premium subscription plan launched: Here's everything about it",
    "Indian billionaire Ambani's JioCinema unveils pricing in fight with Netflix, Disney",
    "JioCinema Premium subscription plan launched in India: check out price, list of HBO shows and more",
    "JioCinema makes SVoD debut with HBO, WB shows",
    "JioCinema Premium subscription plan launched as HBO shows arrive on the platform",
    "No more freebies: Ambani's JioCinema to now charge premium subscription for HBO and other content",
    "Almost 1 Crore Indians Have Quit Disney+Hotstar OTT In Last 180 Days! JioCinema Impact?",
    "India's CCI probes Google over alleged anti-competitive in-app payment fees. All details inside",
    "Google faces antitrust compliance review in India following Match Group complaint",
    "Report: Indian Regulator Investigating Google's Fees for In-App Payments",
    "Google In CCI Net Again: Competition Watchdog Begins Probe Into New Billing Policy",
    "CCI probes Google's user choice billing system",
    "Google's New A.I. Search Engine Should Leave the Media Very Worried",
    "Google, Generative Search, And The Web's Uncertain Future",
    "As AI consumes search, what will be left for us humans?",
    "AI is coming to Google, whether you like it or not.  Here's what to watch.",
    "Foxconn accelerates drive for in-house EV chips",
    "Inside the Italian Mafia's Encrypted Phone of Choice",
    "Y'all gonna retract all this in 6 months or nah https://twitter.com/...",
    "*potentially removing jobs. Fixed it for you. https://twitter.com/...",
    "Google's Big Generative AI Experiment Is a Test for Humanity",
    "Apple Headset's Capabilities Said to ‘Far Exceed’ Those of Rival Devices",
    "Apple Defies its Own Rules with Forthcoming Mixed-Reality Headset",
    "Apple Headset Mass Production Won't Happen Until the Fall: Report",
    "Apple bracing for potential mixed reality headset ‘production issues’",
    "The Apple VR headset is still rumored to be launching at WWDC in June",
    "WSJ: The Apple headset expected in June is not a finished product",
    "Apple is ‘already anticipating production issues’ ahead of Reality Pro launch",
    "Can Apple's new mixed-reality headset save VR?",
    "Binance leaves Canada due to stricter crypto rules",
    "Binance Pulls Out of Canada Amid Tougher Crypto Regulation",
    "Binance to Close Business In Canada",
    "Binance Withdraws from Canadian Market due to New Regulations",
    "Binance Quits Canada Citing Unfavorable Regulatory Climate",
    "Binance pulling out of Canada, says doing business there untenable",
    "Binance to Withdraw From Canadian Market Due to Regulatory Climate",
    "Binance will “proactively withdraw” from Canada",
    "Binance to Close Canadian Shop Citing Recent Regulatory Changes",
    "Binance to Exit Canada After Country Imposes New Crypto Rules",
    "Binance pulls out of Canada amid new crypto regulations",
    "World's Biggest Crypto Exchange Binance is Leaving Canada",
    "Binance Set To Leave Canadian Market Due To Unfavorable Regulatory Landscape",
    "Binance pulls out of Canada amid tightening crypto regulations",
    "Binance pulls out of Canada, cites incompatibility with local market conditions",
    "Breaking: Binance Will Proactively Withdraw From The Canadian Crypto Marketplace",
    "Binance Exits Canadian Market Due to New Regulations",
    "Binance calls it quits in Canada, blames new rules",
    "Will Binance Exit U.S. Next After Canada? | Coingape",
    "Binance To Withdraw From the Canadian Marketplace",
    "Binance announces exit from Canada",
    "Binance Says Farewell to Canada Following New Guidance Implementing Restrictions on Exchanges",
    "Binance to stop serving Canadian market, blames new stablecoin guidance",
    "Binance halting operations in Canada",
    "I remember when Binance “exited” the United States https://twitter.com/... https://twitter.com/...",
    "Tessera and Escher Will Cease All Operations",
    "Paradigm-Backed NFT Startup Tessera Shuts Down",
    "Fractional NFT project Tessera to shut down amid challenging crypto market",
    "“Collective NFT ownership” 🤷‍♂️ https://twitter.com/...",
    "San Francisco Business Journal",
    "@Noupside@saturation.social",
    "Twitter Conspiracy Bozos Are Freaking Out Over Elon's WEF-Friendly CEO Pick",
    "New Twitter CEO Linda Yaccarino says she is excited to help to transform Twitter",
    "Linda Yaccarino thanks Musk for opportunity, shares excitement to ‘build Twitter 2.0’",
    "Twitter's new CEO is Musk's first step in admitting Twitter Blue failure",
    "Right-wing Twitter worried Musk's CEO pick could return Twitter to its roots",
    "Twitter's New CEO Says She's ‘Excited’ to Transform Platform",
    "Linda Yaccarino profiled: Media supremo will attempt to get Musk's Twitter to fly right",
    "Linda Yaccarino Speaks Out on Twitter After Becoming Social Platform's New CEO",
    "Meet the new Twitter boss, same as the old Twitter boss",
    "Linda Yaccarino: an advertising veteran enters the wild world of Musk's Twitter",
    "Elon Musk Appoints Linda Yaccarino as Twitter's New Chief",
    "Elon Musk picks NBCU's Linda Yaccarino as new Twitter CEO",
    "HOT TAKE: Twitter Has a New CEO",
    "From dealing with Musk to fixing Twitter Blue: what's in the next CEO's in-tray?",
    "Elon Musk is Stepping Down as Twitter CEO, Names Replacement",
    "Twitter Under Elon Musk Is Starting to Look Like SpaceX",
    "Linda Yaccarino Leaves NBCUniversal Amid Talks to Become Twitter CEO",
    "Elon Musk finally finds someone “stupid enough” to take the job as Twitter CEO",
    "NBCUniversal's Linda Yaccarino resigns, named Twitter CEO",
    "Elon Musk to Step Down as Twitter CEO, To Move to Exec Chair and CTO",
    "Five questions new Twitter CEO Linda Yaccarino will have to answer",
    "4 things to know about new Twitter CEO Linda Yaccarino",
    "Elon Musk names NBCU ad chief Linda Yaccarino as Twitter CEO",
    "Musk Installs NBCU's Linda Yaccarino to Be His Adult in the Room",
    "Who Is Linda Yaccarino And Why Is Elon Musk's New Twitter CEO So Divisive?",
    "Musk names ex-NBCUniversal exec as new Twitter CEO",
    "Elon Musk names NBCU ad exec Linda Yaccarino new Twitter CEO",
    "Elon Musk picks former NBCUniversal exec to be the new CEO of Twitter",
    "Former NBCU Ad Exec Linda Yaccarino Is Twitter's New CEO",
    "Elon Musk Picked Who to Run Twitter?",
    "Elon Musk finally finds ‘someone foolish enough to take the job’ of Twitter CEO",
    "Linda Yaccarino leaves NBCUniversal, adding fuel to the Twitter CEO fire",
    "What to know about Twitter's new CEO Linda Yaccarino",
    "NBCUniversal says Yaccarino to depart amid reports of Twitter CEO role",
    "Who is Linda Yaccarino, Elon Musk's pick as the new Twitter CEO?",
    "Twitter's new CEO is Linda Yaccarino, a longtime ad exec for NBCU",
    "Elon Musk's pick for Twitter CEO may be the win he needs",
    "RUMOR: Elon Musk To Step Aside At Tesla And Twitter",
    "Elon Musk appoints Linda Yaccarino as Twitter CEO",
    "Meet Twitter's New CEO: Advertising Exec Linda Yaccarino",
    "Musk Picks Ad Exec Linda Yaccarino As Twitter CEO",
    "Elon Musk names Linda Yaccarino new Twitter CEO",
    "Elon Musk picks NBC advertising executive as next Twitter CEO",
    "Elon Musk Officially Announces New Twitter CEO",
    "Who Is The New Twitter CEO Linda Yaccarino",
    "Musk's new Twitter CEO could heal damaged brand, advocates say",
    "NBCUniversal ad exec Linda Yaccarino will be the new Twitter CEO",
    "Elon Musk names Linda Yaccarino as new Twitter CEO",
    "Elon Musk appoints new Twitter CEO, NBCU's Linda Yaccarino",
    "Musk Taps Linda Yaccarino As Twitter CEO Replacement",
    "Elon Musk Names Former NBC Exec Linda Yaccarino as New Twitter CEO",
    "Linda Yaccarino is Twitter's new CEO: What to know about Elon Musk's pick",
    "Linda Yaccarino says she's inspired by “provocative leadership.” Elon Musk's Twitter fits the bill",
    "Elon Musk finds new Twitter CEO",
    "Meet Twitter's (now confirmed) incoming CEO Linda Yaccarino who just quit NBCUniversal",
    "Twitter's new CEO is an NBCUniversal executive with deep ad industry ties",
    "New Twitter CEO rumoured to be NBC's Linda Yaccarino",
    "Elon Musk names Linda Yaccarino as Twitter CEO",
    "Linda Yaccarino Exits NBCUniversal Amid Twitter Talks; Mark Lazarus Assumes Oversight of Ad Sales",
    "Elon Musk to Step Down as Twitter CEO in Six Weeks",
    "Tesla Shares Print Mild Gains as Elon Musk Is Set to Step Down as Twitter CEO",
    "Elon Musk Confirms Linda Yaccarino as New Twitter CEO",
    "Who is Linda Yaccarino, reportedly Twitter's next CEO?",
    "Twitter CEO Favorite Linda Yaccarino Leaves NBCU",
    "NBCUniversal ad chief leaves as Twitter speculation swirls",
    "Linda Yaccarino is Twitter's new CEO: Here's what to know",
    "Linda Yaccarino Exits NBCUniversal, Mark Marshall Named Interim Ad Sales Chief",
    "Twitter Is Getting A New CEO As Musk Decides To Step Aside",
    "Elon Musk's reported Twitter CEO pick Linda Yaccarino leaving NBCUniversal ‘effective immediately’",
    "Elon Musk says he has found new Twitter CEO",
    "Twitter's new CEO is probably this NBC exec",
    "Elon ‘I Hate Advertising’ Musk Names NBC Ad Exec as Twitter CEO",
    "A New Twitter CEO Won't Change Who Calls the Shots",
    "Elon Musk says he has found a new CEO for Twitter.",
    "New Twitter CEO May Be Linda Yaccarino",
    "Twitter's new CEO could be a top NBCUniversal female exec, report says",
    "New Twitter CEO rumored to be ex-TV exec as Elon Musk steps down",
    "Where Does Dogecoin Stand Under Twitter's New CEO Linda Yaccarino's Reign?",
    "Tesla Investors Cheer Elon Musk Stepping Down as Twitter CEO. Why They Shouldn't.",
    "Who is Linda Yaccarino, the possible female CEO of Twitter?",
    "Elon Musk Has Found His Replacement for Twitter CEO",
    "Elon Musk Picks Linda Yaccarino as Next Twitter CEO",
    "Twitter Chief Elon Musk to Pass on Mantle to New CEO, Takes CTO Role",
    "Twitter's getting a new CEO and it might be this advertising exec",
    "Elon Musk names Linda Yaccarino as new Twitter chief",
    "How Will Twitter Change Under a New CEO?",
    "New Twitter CEO Yaccarino A Dogecoin Lover? Profile Reveals A Surprise",
    "NBCU's Linda Yaccarino in Talks for Twitter CEO",
    "As soon as @LindaYacc is ready, we will do a Spaces where you can ask us anything",
    "It's a COO or CMO role at the very most https://twitter.com/...",
    "Hopefully included in the orientation packet. https://twitter.com/... https://twitter.com/...",
    "He sent these two tweets back to back... https://twitter.com/...",
    "Oh Linda. How did you not see this coming? https://twitter.com/...",
    "The anti Italian bias being displayed toward the new twitter ceo is sickening",
    "Love to see it https://twitter.com/...",
    "Flashback: Elon Musk Calls CEO a ‘Made-Up Title’ https://www.wsj.com/...",
    "Congratulations to new Twitter CEO (and future Congressional witness) @lindayacc",
    "She's an absolute force: https://twitter.com/...",
    "RIP Free Speech https://twitter.com/...",
    "This is so **stupid*** https://twitter.com/...",
    "when you've lost cat turd 2... https://twitter.com/...",
    "a right wing Comcast executive https://twitter.com/...",
    "@JoannaStern So was that a “funding secured” sort of tweet? Hopefully it gives her leverage.",
    "Looks like Kara was right. https://www.wsj.com/... https://twitter.com/...",
    "クラウド .境の誤設 定によるお ; 客様情報 .の漏 …",
    "Toyota: Car location data of 2 million customers exposed for ten years",
    "Toyota Japan exposed millions of vehicles' location data for a decade",
    "Data of more than 2M Toyota customers exposed in ten years-long data breach",
    "Toyota mishandled user data by publishing over 2 million user info online",
    "Security News This Week: Toyota Leaked Vehicle Data of 2 Million Customers",
    "Toyota apologizes for data exposure of more than 2 million vehicles in Japan",
    "Toyota Admits Decade-Long Data Leak Affecting 2.15 Million Customers",
    "Cloud system error left Toyota customer data exposed for ten years",
    "Toyota has been exposing cloud customer data publicly for a decade due to human error",
    "Toyota reveals potential location breach involving two million vehicles",
    "Toyota accidentally exposed millions of customers' data for nearly a decade",
    "The locations of over 2 million Toyota cars were exposed for 10 years",
    "Toyota Data Breach Exposed Location Data of 2 Million Customers for a Decade",
    "Toyota Exposed Auto Location of 2M Japanese Customers",
    "Toyota exposed car location data of 2 million drivers for 10 years — what you need to know",
    "Toyota: Data on more than 2 million vehicles in Japan were at risk in decade-long breach",
    "Toyota Japan Exposed Data on Millions of Vehicles For a Decade",
    "Vehicle data of over 2 million Toyota users been publicly available in Japan since a decade"
]