[
    "@jamesthomson@mastodon.social",
    "@Gartenberg@mastodon.social",
    "@film_girl@mastodon.social",
    "@ashfurrow@masto.ashfurrow.com",
    "@GossiTheDog@cyberplace.social",
    "@Cdespinosa@mastodon.social",
    "Introducing Apple Vision Pro: Apple's first spatial computer",
    "Apple reveals Vision Pro, available for $3,499 “early next year”",
    "Apple's Vision Pro headset deserves to be ridiculed",
    "This is Apple Vision Pro, the mixed reality headset for spatial computing",
    "Apple reveals its Vision Pro mixed-reality headset, starting at $3,499",
    "The Apple Vision Pro headset will cost $3,499, out early 2024",
    "Apple's $3,499 Vision Pro AR headset is finally here",
    "Apple Vision Pro $3,499 mixed-reality headset launches at WWDC after years of rumors",
    "Apple reveals Vision Pro AR headset at its worldwide developers conference",
    "Apple's new VR headset will feature over 100 Apple Arcade games at launch",
    "Apple Unveils Vision Headset in Search of Post-iPhone Future",
    "Apple Vision Pro: Technical Marvel with WTF Pricing",
    "Metaverse? Apple thinks $3,500 AR ski goggles are the betterverse",
    "With Vision Pro, Apple shows computing's future. But who's it for?",
    "Who wants to pay $3,500 for Apple's new goggles?",
    "Apple's ‘Vision Pro’ Headset Wants to Be the $3,499 Anti-Metaverse",
    "Apple unveils the Vision Pro, its long-awaited $3,500 mixed reality headset",
    "Apple adds Game Mode for Mac among other gaming features",
    "Apple unveils Vision Pro AR headset, updates Macs",
    "Apple: Vision Pro headset looks good but offers no new ideas for VR",
    "Apple Unveils Vision Pro AR Headset Priced at $3,500",
    "Here's a First In-Person Look at the Apple Vision Pro",
    "Live: Expectations of Apple's headset set to meet reality",
    "Apple Unveils Vision Pro AR/VR Headset, Its First Major New Product In Nearly A Decade",
    "Apple unveils sleek, $3,500 ‘Vision Pro’ goggles.  Will they be what VR has been looking for?",
    "Meet Apple's AR/VR Vision Pro headset: Price, features, release date, and everything else to know",
    "Apple unveils Vision Pro AR headset",
    "Silicon Valley Business Journal",
    "Apple unveiled its long-awaited augmented reality headset",
    "Apple announces $3,500 Vision Pro XR headset",
    "Apple Unveils $3,500 ‘Spatial Computing’ Headset",
    "Apple launches into virtual reality with impressive new headset",
    "Apple Vision Pro: Apple's big bet on a brand-new platform starts at $3,499",
    "Apple Announces Vision Pro, its “Spatial Computing” Headset",
    "Apple unveils long-awaited Vision Pro mixed-reality headset at WWDC",
    "Apple Vision Pro: Everything you need to know",
    "Vision Pro: Apple Finally Unwraps Ambitious, Long-Rumored VR Headset at WWDC",
    "Apple Vision Pro AR/VR Headset Ships Early 2024 For $3500",
    "Apple uncovers its clever VR glasses in the biggest new launch since the iPhone",
    "Apple Reveals $3,499 Vision Pro Augmented Reality Headset",
    "Apple announces mixed reality headset Vision Pro",
    "Apple launches Vision Pro, a VR headset it hopes will be most important product since iPhone",
    "Apple launches its virtual- and augmented-reality headset: Apple Vision Pro",
    "Apple Vision Pro AR headset unveiled at WWDC 2023",
    "EyeSight on Apple Vision Pro makes wearing a headset slightly more human",
    "Fans React to Apple Vision Pro Announcement With Memes, Shock Over Price Point",
    "Apple Unveils the Mixed Reality Headset ‘Vision Pro’",
    "Apple just revealed its first major product in over 8 years — meet the $3,499 ‘Vision Pro’",
    "Apple unveils Vision Pro ‘mixed reality’ headset",
    "Apple Unveils $3.5K ‘Vision Pro’ Goggles",
    "Tim Cook unveils Apple Vision Pro mixed reality headset",
    "Apple Reveals ‘Vision Pro’ Mixed Reality Headset at WWDC 2023",
    "Apple Announces Vision Pro, Its Mixed Reality Headset",
    "Apple Announces Vision Pro, A Spatial Computer For Your Eyes",
    "Apple reveals Vision Pro AR headset, arrives early next year for $3,500",
    "Apple Vision Pro: A $3500 Leap into Spatial Computing or Just Another Super Expensive Gadget?",
    "Apple unveils its first AR/VR headset, the Vision Pro",
    "Apple Vision Pro price is $3,499 — and everybody had the same reaction",
    "Apple Unveils $3,500 ‘Vision Pro’ AR/VR Headset During WWDC Keynote, Will Launch in US Early 2024",
    "Apple unveils $3,499 Apple Vision Pro mixed-reality headset — here's what it is and how it works",
    "Apple reveals $3,500 Vision Pro AR headset that puts Meta's top-tier goggles to shame",
    "Apple Is Coming Out With A New VR Headset",
    "Apple Vision Pro AR headset revealed at WWDC 2023, priced at $3,499 for early 2024 launch",
    "New Apple Vision Pro XR headset puts the Quest Pro to shame",
    "Apple's Mixed-Reality Headset, Vision Pro, Is Here",
    "Apple launches Vision Pro, its first-ever augmented reality headset",
    "Apple Vision Pro is here and we're never leaving the house — here's a list of everything it can do",
    "Apple Officially Reveals Vision Pro, Its New Mixed Reality Headset",
    "Meet Apple Vision Pro: the human virtual reality headset!",
    "Apple Unveils Vision Pro Virtual Reality Headset, Its First Major Device Launch In Nearly A Decade",
    "Apple just announced its first major product since 2014: The Vision Pro for $3,499",
    "Apple announces Vision Pro AR and VR headset - here's everything we know",
    "Apple Finally Reveals Long-Awaited AR Headset, Vision Pro, Priced At $3,500",
    "Apple announces Apple Vision Pro, its long-awaited VR headset",
    "So to watch a movie with the family everyone is going to need to own one?",
    "VisionPro must not have the processing power required to render dinosaur feathers I guess",
    "M2 chip coupled for R1 for sensing.",
    "“Facial Video” is the new euphemism for home made porn.",
    "In Canada, the sales tax on the Vision Pro is the price of a Quest 3",
    "deleting the email like [image]",
    "This is just a great way to parent, that won't affect your children negatively at all [image]",
    "Ok I used it. It's good. Real good. More soon. [image]",
    "Mom? Mom? Mom! Mom are you spatially computing again? [image]",
    "should i buy a used car or an apple vision pro",
    "Apple just made folding phones seem like a bargain.",
    "Bloomberg Terminal on Vision Pro when",
    "I am looking at two 32\" monitors and it's a field of vision problem.",
    "me in 2010: wow 2023 will be so futuristic me in 2023: [image]",
    "It is everything I hoped for. Talk to you in a few minutes on Twitter Spaces.",
    "whatever you do, don't look into their ey.....! [image]",
    "I can't wait to see the first one of these in Starbucks.",
    "going to wear a vision pro into molotov's",
    "apple invents an augmented reality headset and they're like “so you can run safari in it”",
    "More or less exactly as rumoured. [image]",
    "Apple is so much better at this than Facebook.",
    "Did any leak get the name Vision Pro right?",
    "💯🥽 #WWDC23 https://twitter.com/... [image]",
    "Man, Meta's Reality Labs team must not be feeling too great today",
    "The first Macintosh was $2,495. Adjusted for inflation from 1984 that equates to $7,300 today.",
    "new reaction image just dropped [image]",
    "We're all about to look like we're scuba diving through real life. 🤿 [image]",
    "Lordy, this vision pro presentation is making Meta look like dogshit.",
    "Microsoft Excel, Word, and Teams in Apple Vision Pro [image]",
    "For all-day usage, remove weedwacker, attach Apple headset [image]",
    "“We studied thousands of heads”",
    "Their new Jony Ive sounds a lot like their old Jony Ive.",
    "Everyone saying before they weren't going to get Apple's headset just changed their mind.",
    "This is the video camera from Minority Report! #WWDC23",
    "i am absolutely gonna be wearing these to da club [image]",
    "3499 price. Early next year (!) on https://apple.com/ and retail stores. So, 2024",
    "At this point, I can't imagine my life without Apple Vision Pro. I'm serious. [image]",
    "How many things has Zuck thrown and broken so far https://twitter.com/...",
    "Funny joke @gruber 😜 [image]",
    "Standing in line for Apple Glasses.",
    "Introducing Apple Vision Pro",
    "Apple introduces Apple Vision Pro",
    "The best AI features Apple announced at WWDC 2023",
    "Apple Shows Off $3,499 Vision Pro XR Headset at WWDC",
    "Apple Unveils Vision Pro, Its First XR Headset",
    "Apple Vision Pro is superior to Meta Quest 3 but is that a reason to spend on it",
    "Apple Vision Pro, a Spatial Computer Headset, Revealed",
    "Apple Vision Pro is Company's First Spatial Computer, Packs 23 Million Pixels Across Two Displays",
    "Apple Vision Pro Chip Specs #wwdc23 - M2 - New R1 chip for sensors [image]",
    "mfw watching #WWDC23 [image]",
    "Me, accepting GDPR popups next year: [image]",
    "Apple Reveals ‘Vision Pro’ Headset and visionOS",
    "Apple Vision Pro headset runs visionOS with a 3D-spatial user interface",
    "Apple Vision Pro headset will get its own App Store featuring apps for visionOS",
    "Sorry, Gamers—Apple's Vision Pro Headset Wasn't Made for You",
    "Apple's AR/VR Headset Has Its Own OS Called VisionOS",
    "Microsoft Word, Excel, and Teams are all coming to Apple's new Vision Pro headset",
    "Apple details visionOS, the software that powers the Vision Pro headset",
    "visionOS is Apple's latest operating system",
    "Apple Vision Pro: release date, price, specs, and more",
    "VisionOS — Everything we know about the Apple Vision Pro's platform",
    "WWDC 2023: Apple Vision Pro headset with visionOS announced; know all about Apple's big bet",
    "visionOS will power the Apple Vision Pro headset — here are the first official details",
    "Someone needs to build a spatial code editor for visionOS",
    "The new OS is called visionOS. Not xrOS, lol. [image]",
    "“Exploring visionOS”. Going to take on my most challenging writing project yet. 🤗 [image]",
    "imagine seeing this in VR [image]",
    "Digital Photography Review",
    "Five ways Vision Pro is different from anything Apple—or anyone—has ever made",
    "Apple announces new Vision Pro headset",
    "Apple sure kicked Meta's butt today, right?",
    "WWDC 2023: Apple announces partnership with Disney, Apple Vision Pro to run Disney Plus",
    "Disney+ will be on Apple Vision Pro from day one",
    "Disney Plus is coming to Apple's Vision Pro headset",
    "Apple and Disney partner for Apple Vision Pro Disney+ day-one launch",
    "Apple Vision Pro news, price, specs, and everything we know about the VR headset",
    "Disney+ will be available on the Apple Vision Pro at launch",
    "Everything Apple Announced at WWDC 2023: Vision Pro VR Headset, New Macs, and More",
    "WWDC: Apple introduces Vision Pro, its take on mixed reality",
    "Apple enters AR/VR headset market with Vision Pro",
    "Apple Reveals Vision Pro AR Headset, & No, You Probably Cannot Afford It",
    "Disney Plus Is Coming to Apple Vision Pro on Day One",
    "Apple Vision Pro Will Have Custom Disney+ Content, Including Marvel's What If...?",
    "Disney teases ‘deeply personal’ Disney+ integration with Apple Vision Pro",
    "Disney teases a deeply personal Disney+ integration with Apple Vision Pro",
    "Disney's Bob Iger Announces Major New Apple Partnership",
    "Disney Plus Will Be Available On Apple's Vision Pro At Launch",
    "Apple's Vision Pro headset uses iris scanning for logins with Optic ID",
    "Apple's Vision Pro Headset Uses ‘Optic ID’ Iris Scanning Authentication",
    "Apple announces new Optic ID biometrics for user authentication on Apple Vision Pro headset",
    "Apple's Optic ID will let you log in to the Vision Pro headset with your eyes",
    "Optic ID Is The Vision Pro's Twist On Face ID Security",
    "For just $3500! https://twitter.com/...",
    "International Business Times",
    "A closer look at Apple's $3,499 Vision Pro headset",
    "Apple's Vision Pro Headset Is Finally Real And The Platform Looks Slick And Expansive",
    "I Do Not Hate The Apple Vision Pro, The First ‘Human’ AR/VR Headset",
    "Apple Vision Pro headset: Price, specifications, and everything you need to know",
    "Apple unveils the Vision Pro, it's $3,500 mixed reality headset",
    "Apple unveils mixed-reality Vision Pro headset priced at $3,499",
    "Meet your Digital Persona: Apple's Vision Pro users to get real-time animated avatars",
    "Apple Vision Pro first look: A glimpse at the spatial computing future",
    "Apple enters mixed reality with $3,500 Vision Pro headset",
    "Apple's Vision Pro is a Reality",
    "Apple Tips Vision Pro Augmented Reality Headset, With Sky-High $3,499 Price Tag",
    "Apple's Vision Pro headset seems too good to be real — because it basically is",
    "Apple's Vision Pro isn't the VR headset you were expecting, but it is the future — for rich people",
    "Apple unveils VR headset Vision Pro",
    "The Apple Vision Pro just changed AR and VR forever",
    "Apple Vision Pro: 7 things you need to know about the mixed-reality headset",
    "Apple Vision Pro looks amazing but... I don't want to live my life in a headset",
    "Apple Previews its First ‘Vision Pro’ AR Headset, and its Huge Price Tag",
    "Apple Vision Pro: 6 things we love and 3 we don't",
    "Apple Vision Pro teleports you into the future (of sorts)",
    "Apple's new Vision Pro sparks hopes for VR/AR in Canada",
    "Apple's new Vision Pro MR debuts to a global audience",
    "Apple Vision Pro: Pioneering Virtual Reality, Straight from Cupertino's Innovation Lab",
    "Apple to Facebook, Google, and Snap [image]",
    "This is crazy! #WWDC23 [image]",
    "this says all you need to know about apple vs meta [image]",
    "First look at Joaquin Phoenix in Ridley Scott's ‘NAPOLEON’. (Shown at #WWDC23) [image]",
    "got my new apple headset [image]",
    "Apple Store is down ahead of 15-inch MacBook Air, Apple XR headset and more expected at WWDC",
    "WWDC 2023: Vision Pro, iOS 17 and everything else Apple announced today",
    "Factbox: Here's what Apple unveiled at WWDC: Vision Pro, 15-inch MacBook Air, OS updates",
    "The features that didn't get discussed onstage at WWDC",
    "Apple WWDC 10 biggest announcements: Vision Pro, MacBook Air, iOS 17, and more",
    "WWDC 2023 Recap: Vision Pro Headset, iOS 17 and Everything Else Apple Announced",
    "Every hardware product Apple announced at WWDC today: Vision Pro headset, Mac Pro, more",
    "Apple's New Headset and Other Takeaways From WWDC 2023",
    "Apple WWDC '23 Live Blog: recap of all the unveilings during Apple's keynote",
    "Apple debuts larger MacBook Air",
    "Apple's Vision Pro announcement at WWDC didn't mention the word “metaverse”",
    "Apple's Biggest Announcements at WWDC 2023: Vision Pro, Mac Pro, iOS 17, and More",
    "5 best Apple WWDC 2023 announcements: Vision Pro, iOS 17, MacBook Air 15, and more",
    "I've been waiting my whole life for iOS 17's new Journal app",
    "Apple's biggest reveals at WWDC23",
    "Death Stranding Director's Cut and future Kojima games heading to Mac",
    "Here are the most important new changes coming to your iPhone this fall",
    "Microsoft Word, Excel, and Teams apps will be available for the Apple Vision Pro AR headset",
    "Hideo Kojima impressed with Apple's gaming tech, will bring future games to Mac",
    "An example of great interaction between brands 😂 @McDonalds @AXE [image]",
    "The features that didn't get discussed onstage at #WWDC https://sixcolors.com/...",
    "AirDrop now works by bringing two devices together #WWDC23 [image]",
    "Huge software improvements to AirPods was not on my bingo card. But great!",
    "apple using better AI to make autocorrect not terrible would actually be a good thing if it works",
    "⌨️ It's about ducking time. Big autocorrect and typing predictions coming.",
    "- Here's a cool new Standby feature, with an accessory we'd love to sell you! [image]",
    "watchOS “Time in Daylight” also perfect to protect Dracula. #wwdc23",
    "Sorry but I've heard Jonny Ive say “aluminum” and you are no Jonny Ive.",
    "Apple says it has fixed iPhone autocorrect with iOS 17",
    "iOS 17 Lets You Create a Voice That Sounds Like You",
    "The iPhone 8, 8 Plus, and X aren't getting iOS 17",
    "You Can Download the iOS 17 Developer Beta on Your iPhone Right Now",
    "10 big upgrades coming to iPhones with iOS 17, unveiled at WWDC 2023",
    "Apple's iOS 17 adds Live Voicemail, StandBy and a Journal app",
    "Apple just announced a ton of software features at WWDC. Here's everything new",
    "How to tell friends you got home safe with iPhone's new Check In feature",
    "iOS 17 adds new look and big updates to Messages app — here's what's new",
    "iOS 17 will transcribe your audio messages, customize contact posters",
    "iOS 17: These five new features make us eager to upgrade",
    "Apple's NameDrop Lets You Share Contact Details in One Click",
    "Apple Unveils iOS 17 for the iPhone at WWDC 2023",
    "With iOS 17, Apple introduces new journaling app, refreshes communication apps",
    "iOS 17 Messages adds emoji tapbacks, stickers, audio message transcription, more",
    "The best feature ever is getting even better. Source: https://www.apple.com/... [image]",
    "NameDrop allows for easy transfer of contact info. Very 1996 PalmPilot. [image]",
    "iOS 17 Includes Updated Phone, FaceTime, and Messages Apps",
    "Which iPads support iPadOS 17? Here's the list ...",
    "Apple Shortening ‘Hey Siri’ to ‘Siri’ Across iPhone, Mac, and Other Devices",
    "Apple didn't talk about it, but iOS 17 adds AirTag and Find My device sharing",
    "iOS 17 StandBy mode brings smart display-like features to iPhone",
    "Apple announces powerful new privacy and security features",
    "iOS 17 Adds Journal App, StandBy Smart Display Mode, Better Autocorrect",
    "iOS 17 isn't an exciting update but does have one stand-out feature",
    "Apple is putting AirPlay in hotels",
    "iOS 17 introduces StandBy feature to show glanceable information while an iPhone is charging",
    "13 Best iOS 17 Features: Live Voicemail, NameDrop, Journal App and More",
    "iOS 17 Announced with New Features for FaceTime, Phone, Messages, & More",
    "Apple announces NameDrop, a feature for seamless contact information sharing",
    "These iOS 17 features require an iPhone 12 or newer",
    "AirDrop in iOS 17 will let you share contact info by bringing two iPhones close together",
    "Apple Revamps iPhone Software With Journaling App, StandBy Mode",
    "Apple announces new landscape ‘StandBy’ mode for iOS 17 lock screen on iPhone",
    "Apple introduces a dedicated ‘Journal’ app to log your daily experiences",
    "iOS 17 announced at WWDC 2023: Here's what's coming to iPhone 15",
    "iOS 17 continues personalization push & makes big adds to Messages",
    "feel like this new Apple Journal app is basically Facebook-ish for an audience of one [image]",
    "iOS 17 makes iPhone more personal and intuitive",
    "Apple Announces iOS 17, iPadOS 17, watchOS 10, and macOS Sonoma",
    "Apple will let you create stickers from your own photos and videos",
    "Apple's new Journal app is coming to iPhone: Everything you need to know",
    "Apple introduces Journaling app for iOS",
    "Apple's new ‘Journal’ app will help you kickstart a daily diary habit",
    "US District Court for the District of Columbia",
    "U.S. Securities and Exchange Commission",
    "Press Release SEC Files 13 Charges Against Binance Entities and Founder Changpeng Zhao",
    "Plaintiff Securities and Exchange Commission (the “SEC” or the “Commission\") …",
    "SEC Sues Binance and CEO Zhao for Breaking US Securities Rules",
    "SEC Complaint Aims to Unilaterally Define Crypto Market Structure",
    "SEC Sues Crypto Exchange Binance Over U.S. Rule Violations",
    "SEC claims BNB and BUSD are securities, including major tokens like SOL, ADA and MATIC",
    "SEC sues Binance, says it evaded US law with “extensive web of deception”",
    "SEC charges Binance, CEO Zhao with 13 violations",
    "Crypto Prices Drop Amid SEC's Binance Prosecution",
    "Cry-pto: Feds bury Bitcoin exchange giant Binance in 13-count fraud lawsuit",
    "SEC shakes crypto with Binance suit",
    "SEC accuses Binance of lying to customers, operating in US illegally",
    "Solana, polygon, cardano and other tokens are securities, says SEC in Binance lawsuit",
    "Binance Executives Claimed to Operate as ‘Unlicensed Securities Exchange’: SEC Lawsuit",
    "SEC Quietly Removes Director William Hinman's Bio From Website",
    "SEC sues Binance and CEO Changpeng Zhao",
    "SEC sues Binance and founder Changpeng Zhao over securities law violations",
    "Binance Charged With Running Illegal Crypto Exchange in New SEC Complaint",
    "SEC Sues Crypto Exchange Binance and CEO Changpeng Zhao, Alleging Multiple Securities Violations",
    "What the SEC's lawsuit against Binance means for crypto investors",
    "SEC sues Binance and CEO Changpeng Zhao for U.S. securities violations",
    "Crypto shares tumble after U.S. SEC charges Binance with securities law violations",
    "Crypto Exchange Platform Binance, CEO Zhao Accused Of Commingling Funds",
    "Binance Is in Deep Trouble",
    "SEC sues Binance and accuses crypto exchange of mishandling funds",
    "US SEC sues Binance, founder Zhao alleging securities law violations",
    "TRON's Justin Sun, Cardano's Charles Hoskinson side with Binance in SEC case",
    "Top crypto tweets of the day - June 5th",
    "[DB] SEC Sues Binance and CEO Zhao of Breaking US Securities Rules: Bloomberg",
    "Our response to the SEC's complaint. https://www.binance.com/...",
    "SEC claiming SOL, ADA, MATIC, FIL, ATOM, SAND etc are all securities. [image]",
    "SEC filing calls BNB a security [image]",
    "both coley and brooks testified to SEC [image]",
    "A preview of what's next... We need to unite. https://twitter.com/...",
    "“From this account, Sigma Chain spent $11 million to purchase a yacht”",
    "Looks like SEC seeking to push Binance out of the US completely and to enforce a fine [image]",
    "Oh so another major crypto bro is a fraud, how shocking 😱😱 https://twitter.com/...",
    "binance be like “4”, 4x revenue from fees we get on the fud volume from SEC",
    "Tfw Binance employees know the going black market rate for firearms. https://twitter.com/...",
    "Binance Exposed For Allegedly Controlling U.S. Affiliate's Bank Accounts",
    "When it rains... https://www.reuters.com/...",
    "Binance Hands Rising Star Teng Key Role to Replace CEO Zhao at Largest Crypto Exchange",
    "Richard Teng seen as potential successor to Binance's Changpeng Zhao -reports",
    "Binance poaches OKX exec Rachel Conlan to lead global marketing",
    "Ask not for whom carries the can, the can is carried by thee. https://www.bloomberg.com/...",
    "Apple introduces the 15‑inch MacBook Air",
    "Apple Announces New MacBook Air With 15.3-inch Display and M2 Chip Starting at $1,299",
    "Apple Cuts 13-Inch MacBook Air Price by $100 - but You Can Already Save More",
    "Apple launches new 15-inch MacBook Air",
    "Apple MacBook Air 15-inch preview: Portable power",
    "Apple Confirms An Uninspiring Update To The MacBook Air",
    "Apple Unveils 15-Inch MacBook Air at WWDC 2023",
    "Hands on with the new 15-inch MacBook Air [Gallery]",
    "Apple introduces new 15-inch MacBook Air",
    "MacBook Air 2023: Everything you need to know",
    "MacBook Air 15-inch M2 hands-on review: Bigger is better",
    "Apple unveil the 15-inch MacBook Air at WWDC 2023",
    "15-inch MacBook Air with M2 chip tech specs",
    "The biggest Mac announcement at WWDC was about the old MacBook Air",
    "15-inch MacBook Air vs 13-inch MacBook Air — which is better?",
    "Apple Announces The 15-Inch MacBook Air At WWDC 2023",
    "Apple's M2-powered 15.3-inch MacBook Air is now official",
    "Apple's 15-inch MacBook Air confirmed at WWDC 2023",
    "Apple MacBook Air 15-inch (M2, 2023) hands-on: Is bigger better?",
    "Apple introduces world's thinnest 15-inch laptop the new Macbook Air",
    "The new Apple 15.3″ MacBook Air is here",
    "Apple intros the 15‑inch M2 MacBook Air",
    "Apple Debuts 15-Inch MacBook Air, Mac Studio With Faster Chip",
    "The MacBook Air 15-inch is official, and it's powered by M2",
    "Apple's $1,299 15-inch MacBook Air is its largest to date",
    "nm i hate my macbook pro, macbook air 15\" new best friend",
    "Apple Introduces New Mac Pro With M2 Ultra Chip, Available to Order Starting Today",
    "Apple unveils 15in MacBook Air, iOS 17 and revamped watchOS 10",
    "Apple Silicon Is the Mac Pro Upgrade You've Been Waiting For",
    "Maxed-out Apple Silicon Mac Pro costs 1/4 what a maxed Intel one did",
    "Apple Announces M2-Based 15-inch MacBook Air, Mac Studio, and Mac Pro",
    "Apple Unveils 15-Inch MacBook Air, Mac Pro With M2 Ultra Chip",
    "Apple just unveiled the mother of all Mac computers",
    "Mac Pro with M2 Ultra first look: boy, that's a big chip",
    "Apple launches the M2 Ultra chip powering the new Mac Pro and Mac Studio",
    "Apple Announces New Mac Studio And The First Apple Silicon Mac Pro",
    "Apple Unveils M2 Ultra Chip as Most Powerful Apple Silicon Chip Yet",
    "Apple M2 Ultra Powering Mac Pro Mac Studio",
    "All the Mac news from WWDC 2023: Mac Pro, Mac Studio, and M2 Ultra",
    "Mac Pro 2023  —  Mac Pro, now featuring M2 Ultra, combines the unprecedented performance …",
    "Apple Debuts New Mac Studio and Mac Pro",
    "Apple unveils new Mac Pro and Mac Studio, completing Mac's Apple Silicon transition",
    "Apple announces rack-mountable Mac Pro with Apple silicon",
    "Apple finally reveals new Mac Pro at WWDC 2023",
    "This is the new Apple Silicon Mac Pro",
    "Mac Pro: Apple finally updates its most powerful computer",
    "The new Mac Pro brings PCI expansion to Apple Silicon for the first time",
    "Apple Announces New Mac Pro with M2 Ultra",
    "Apple Announces Brand-New Mac Pro with Apple Silicon and PCI Expansion",
    "Apple's Mac transition to Apple silicon complete after three years",
    "Apple Silicon Mac Pro debut finally ends transition away from Intel processors",
    "Apple surprise-launches new Mac Pro with Apple Silicon",
    "@MKBHD This is an insane update for MacStudio",
    "Apple refreshes the Mac Studio with the M2 Max and M2 Ultra",
    "Apple's M2 Ultra chip chases the Hollywood elite",
    "Apple WWDC 2023: Apple launches new Mac Studio PC with M2 Max and M2 Ultra chips",
    "Apple Unveils The M2 Ultra, A Monster Chip With 24 CPU Cores And Up To 76 GPU Cores",
    "Apple unveils new Mac Studio and finally brings Apple Silicon to Mac Pro",
    "M2 Mac Studio 2023: Specs, price, release date, and everything you need to know",
    "Apple Announces New Mac Studio With M2 Max and M2 Ultra Chips",
    "The M2 Ultra Mac Studio is here with cores galore",
    "Apple Mac Studio Update at WWDC: M2 Ultra Option Debuts",
    "Apple Announces The M2 Ultra SoC - 24 Core CPU, Up To 192GB Unified Memory",
    "(PR) Apple introduces M2 Ultra SoC with 24 CPU and 76 GPU cores, 192GB of memory",
    "A Fully Loaded Mac Pro with M2 Ultra Costs Just $11,800",
    "Apple debuts M2 Ultra with up to 192GB of memory",
    "How to pre-order Apple's new Mac Studio with M2 Max and M2 Ultra chips",
    "Twitter US ad sales plunged 59%, and internal forecasts are grim, NYT reports",
    "Twitter CEO Linda Yaccarino to Start Monday",
    "Hate speech is driving advertisers away from Twitter",
    "Twitter's U.S. ad revenue drops 59%",
    "Linda Yaccarino replaces Elon Musk as Twitter boss",
    "Best Crypto to Buy Now 5 June - Decentraland, Solana, The Sandbox",
    "Twitter's ad revenue continues decline under Musk",
    "Twitter to recoup revenue by being everyone's Everything app. https://www.nytimes.com/...",
    "Clop ransomware claims responsibility for MOVEit extortion attacks",
    "CISA orders govt agencies to patch MOVEit bug used for data theft",
    "New ways to reduce the chances of ransomware attacks",
    "Clop ransomware gang exploits the MOVEit Transfer vulnerability to steal data",
    "BA, Boots and BBC staff details targeted in Russia-linked cyber-attack",
    "Clop … View infographic of “Ransomware Spotlight: Clop”  —  Clop (sometimes stylized as …",
    "Group behind Clop ransomware exploiting MOVEit zero-day, says Microsoft",
    "Clop ransomware group behind MOVEit file transfer hacks: Microsoft",
    "British Airways, BBC and Boots all hit in Zellis cyberattack exploiting MOVEit vulnerability",
    "British Airways, Boots staff data compromised by payroll cyber hack",
    "MOVEit hack: BBC, BA and Boots among cyber attack victims",
    "MOVEit Hack Damage Spreads to British Airways and BBC",
    "British Airways, Boots and BBC among companies hit by cyber security attack",
    "BBC staffers warned of payroll data breach. Other firms also affected by MOVEit vulnerability",
    "British Airways, Boots, BBC payroll data stolen in MOVEit supply-chain attack",
    "Province warns of ‘global cybersecurity issue’ that resulted in stolen personal info",
    "BA's UK staff and Boots hit by cyber security breach with contact and bank details exposed",
    "Microsoft Links MOVEit Attack to Cl0p as British Airways, BBC Fall",
    "Russian hackers raid British Airways and BBC in cyber attack",
    "British Airways staff's details stolen in cyber breach hitting firms around the world",
    "Introducing watchOS 10, a milestone update for Apple Watch",
    "Apple Announces watchOS 10 With Widgets, Redesigned Apps, and More",
    "Apple commits to mental health with tracking on Watch and iPhone",
    "watchOS 10 for Apple Watch officially unveiled",
    "Apple WatchOS 10 Will Bring Widgets, Snoopy Comics to Your Watch Face",
    "watchOS 10 beta 1 now rolling out to developers",
    "Apple rethinks the Apple Watch with watchOS 10 update",
    "Apple revamps WatchOS with widgets, new fitness and health features, and more",
    "5 features you need to know about watchOS 10",
    "New Apple Watch updates will turn your wearable into a cycling computer",
    "watchOS 10 brings focus back to widgets for Apple Watches",
    "WatchOS 10 For Apple Watch: New Features Coming This Year",
    "watchOS 10 brings widgets and new corner icons to Apple's wearable",
    "All the New Features Apple Is Bringing to WatchOS 10 This Fall",
    "iPadOS 17 brings interactive widgets, enhanced lock screen, Health app, and more",
    "The Apple Watch embraces widgets again in watchOS 10",
    "watchOS 10 is a milestone update for Apple Watch",
    "watchOS 10 arrives for Apple Watch, with widgets, new faces, and more workouts",
    "Love the new cycling features for the apple watch. Time to get one",
    "All right, the @apple Watch upgrades are quite solid. Well done team. #WWDC23",
    "Free compensation benchmarking data from 3,000 startups",
    "@parismarx@mastodon.online",
    "macOS Sonoma brings all‑new capabilities for elevating productivity and creativity",
    "Apple debuts macOS 14 Sonoma",
    "macOS Sonoma drops support for another wide swath of Intel Macs",
    "'Death Stranding: Director's Cut' walking onto Mac",
    "macOS Sonoma Drops Support for These Macs",
    "Apple's Updates to MacOS: Game Mode, Increased Privacy and Security, and Adjustable Widgets",
    "Apple reveals macOS Sonoma with screensavers and widgets",
    "Apple releases first macOS Sonoma beta to developers",
    "These Macs will get macOS 14 Sonoma in the fall",
    "Apple Releases First Beta of macOS 14 Sonoma to Developers",
    "MacOS Sonoma Offers You Key Upgrades, Customizable Widgets",
    "How to install macOS Sonoma beta on your Mac",
    "Which Macs support macOS 14? Mostly only Apple Silicon models. Here's the list ...",
    "Five things to know about macOS Sonoma",
    "Apple Announces macOS Sonoma With Desktop Widgets and More",
    "Every website can now be an app thanks to Safari — it's macOS Sonoma's secret weapon",
    "macOS Sonoma announced - Updates to widgets, Safari, gaming, video conferencing and more",
    "Apple Unveils MacOS Sonoma: All Features Announced",
    "macOS Sonoma brings widgets to the desktop",
    "MacOS Sonoma Announced with Desktop Widgets, New Screen Savers, & More",
    "What's New in macOS Sonoma",
    "Apple Announces macOS Sonoma with Game Mode, Upgraded Widgets and More",
    "MacOS 14 Sonoma Launches at WWDC 2023",
    "macOS Sonoma adds Game Mode, a new design for desktop widgets, and more",
    "WWDC 2023: Apple brings MacOS Sonoma",
    "macOS Sonoma arrives with desktop widgets, improved video conferencing and Game Mode",
    "Apple announces macOS Sonoma with iMessage enhancements and aerial screensavers",
    "Apple announces macOS Sonoma with aerial screensavers, Game Mode, and more",
    "Twitter and Bluesky as web apps on Sonoma, with widgets in background.  Coolio.",
    "MacOS Sonoma wallpaper Has some windows XP vibes [image]",
    "Windows Vista lives on with MacOS Sonoma widgets. Yey! #WWDC2023 #WWDC23 [image]",
    "Next year's improvement to macOS Sonoma will be called macOS Napa. [image]",
    "Apple Webapps: “Please please please don't make us add third-party app stores” [image]",
    "AirPods redefine the personal audio experience",
    "Apple unveils Adaptive Audio and says it'll improve AirPods' automatic switching",
    "AirPods Pro 2 Gaining ‘Adaptive Audio’ Feature That Dynamically Adjusts to Your Environment",
    "Adaptive Audio and Personalized Volume on AirPods will adjust sound levels and ANC automatically",
    "Adaptive Audio listening mode is coming to AirPods Pro 2",
    "AirPods Pro owners are the secret winners of WWDC 2023 — here's why",
    "AirPods users just got a huge free upgrade",
    "AirPods noise cancellation is about to become a lot smarter",
    "AirPods Pro getting a big update in iOS 17 with Adaptive Audio",
    "WWDC 2023: Apple introduces Adaptive Audio, Personalized Volume, more for AirPods",
    "Apple is adding adaptive audio to AirPods Pro",
    "AirPods Pro 2 to Receive Three Major Features This Fall Via Software Update",
    "Father's Day Gift Idea: The Best Deals on Premium True Wireless Noise Cancelling Earbuds",
    "AirPods Adaptive Audio tunes ANC and transparency based on your environment",
    "tvOS 17 brings FaceTime and video conferencing to the biggest screen in the home",
    "FaceTime Launching on Apple TV With iPhone and iPad Camera Support",
    "You can now take FaceTime calls on your Apple TV 4K",
    "Apple TV hardware will get VPN access with tvOS 17",
    "Apple unveils updates for tvOS 17 and AirPods",
    "tvOS 17 Lets You Use Your iPhone to Find a Lost Siri Remote",
    "FaceTime is coming to Apple TV with tvOS 17",
    "Apple TV gets FaceTime, a new control center, findable remote and more",
    "You can now FaceTime from your Apple TV",
    "Apple just brought FaceTime to your TV with tvOS 17",
    "FaceTime is coming to Apple TV",
    "FaceTime comes to Apple TV with tvOS 17",
    "tvOS 17 takes FaceTime to the big (TV) screen",
    "Apple Announces tvOS 17, Including FaceTime and New Control Center",
    "tvOS 17 brings video conferencing and Split View",
    "FaceTime comes to Apple TV",
    "Siri can finally find your lost Apple TV remote",
    "FaceTime comes to Apple TV with the tvOS 17 update",
    "VPNs are coming to Apple TV in tvOS 17",
    "Personalized wealth management, built for tech people",
    "The power of digital customization: A guide for modern businesses, Part 2",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "Character.AI: Build something smarter than you.",
    "Airtable: What will you make?",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Replit: From idea to software, fast.",
    "Adobe: Let’s create experiences that matter.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "Mon. 06/05 - WWDC And The Apple Headset",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "iPadOS 17 brings new levels of personalization and versatility to iPad",
    "iOS 17 Can Automatically Clean Up Verification Codes That Clog Up Messages App",
    "Apple is bringing its Health app to the iPad",
    "iOS 17 and iPadOS 17 beta 1 now available",
    "How to install iPadOS 17 beta on your iPad",
    "Apple Unveils iOS/iPadOS 17, watchOS 10, macOS Sonoma",
    "Apple Announces iPadOS 17 With Custom Lock Screens and Interactive Widgets",
    "iPad users just got a massive free software upgrade",
    "Will my iPhone get iOS 17? Here's every supported model",
    "Apple's New iPadOS 17 and macOS Sonoma Will Make iPads and Macs So Much Better",
    "Apple Unveils iPadOS 17 at WWDC 2023",
    "iPadOS 17 Announced with Customizable Lock Screen,",
    "Apple announces iPadOS 17 with interactive widgets, iPhone-like lock screen",
    "iPadOS 17 gets a customizable lock screen, interactive widgets and Apple Health",
    "iPadOS 17 Unveiled at Apple's WWDC 2023",
    "Apple reveals iPadOS 17 with customizable Lock Screen, Health app, more",
    "iPadOS 17 announced with interactive widgets, Lock Screen customization, more",
    "iPadOS 17 announced at WWDC 2023: here's what's coming to your iPad",
    "List of iPhone and iPad Models Compatible With iOS 17 and iPadOS 17",
    "India's Open Network for Digital Commerce Begins Facilitating B2B Transactions",
    "Stack Overflow Moderator Letter",
    "Why I'm signing the Stack Overflow strike letter",
    "Kremlin: fake Putin address broadcast on Russian radio stations after ‘hack’",
    "‘Fake Putin’ announces Russia under attack as Ukraine goes on offensive",
    "Google extends the convenience of passkey authentication to a whole lot more users",
    "After rollout across personal accounts, Google enables Passkeys for Workspace accounts",
    "Passkey support for Google Workspace accounts rolling out",
    "Google Workspace Is Going Passwordless",
    "Carbon Health Launches AI Charting in Its EHR Across All Clinics and Providers",
    "r/Save3rdPartyApps on Reddit",
    "Reddit's plan to kill third-party apps sparks widespread protests",
    "Statement: Reddit's defenses of changes that could kill third-party apps",
    "Don't Let Reddit Kill 3rd Party Apps!",
    "What We Want  —  1. Lower the price of API calls to a level that doesn't kill Apollo …",
    "Thousands of Subreddits Set to ‘Go Dark’ Next Week in Protest Over API Pricing Changes",
    "A decentralized, ownerless Reddit is needed https://twitter.com/...",
    "Spotify will cut 200 jobs in its podcast unit",
    "Spotify lays off 200 employees amid shift in podcast strategy",
    "Spotify lays off 200 employees, or about 2% of its workforce",
    "Spotify Laying Off 200 Employees in Its Podcast Division",
    "Spotify combines podcast studios and shrinks workforce",
    "Spotify Cuts Headcount by 2%, Offers Severance Package to 200 Staffs",
    "‘Less Than 1%’ of Users Hit by $35M Hack, Says Atomic Wallet",
    "‘Your security posture sucks’: Atomic Wallet slammed after hacker swipes $35m",
    "Crypto catastrophe strikes some Atomic Wallet users, over $35M thought stolen",
    "On-chain Sleuth Estimates $35 Million Loss From Atomic Wallet Exploit",
    "Atomic Wallet Hit by $35M Theft in Recent Crypto Breach"
]