[
    "More details emerge about Google DeepMind efforts to surpass ChatGPT",
    "Google DeepMind devises a strategy to outwit ChatGPT with Gemini",
    "How Google DeepMind Plans to Outsmart ChatGPT with Gemini",
    "“Google DeepMind's CEO says its next algorithm will eclipse ChatGPT”",
    "Google DeepMind's CEO Says Its Next Algorithm Will Eclipse ChatGPT",
    "White House announces $40 billion in broadband funding",
    "Biden announces $42 billion to expand high-speed internet access",
    "The Biden administration's $42 billion broadband program is finally getting underway",
    "White House Announces Historic $42 Billion Investment in Nationwide Broadband Access",
    "BEAD state-level allocations announced",
    "North Carolina lands $1.5 billion in federal broadband infrastructure funding",
    "Here's how much every state is getting from BEAD grant program",
    "States to Learn Their Share of $42.5 Billion in Federal Broadband Money",
    "MosaicML Agrees to Join Databricks to Power Generative AI for All",
    "Databricks Signs Definitive Agreement to Acquire MosaicML, a Leading Generative AI Platform",
    "Databricks Buys Generative AI Startup MosaicML For $1.3B",
    "Databricks Acquires MosaicML To Make Generative AI More Accessible",
    "Databricks' $1.3 billion MosiacML acquisition to boost generative AI offerings",
    "Databricks acquires generative AI startup MosaicML in $1.3B deal",
    "Databricks picks up MosaicML, an OpenAI competitor, for $1.3B",
    "Databricks' $1.3 billion buy of AI startup MosaicML is a battle for the database's future",
    "Databricks to Acquire MosaicML",
    "Databricks to Buy Generative AI Startup MosaicML for $1.3 Billion",
    "Databricks acquires MosaicML in $1.3bn deal to democratise generative AI",
    "Databricks adds on to the Lakehouse, acquires MosaicML for $1.3 billion",
    "Databricks is acquiring MosaicML for a jaw-dropping $1.3 billion",
    "Databricks buys AI darling MosaicML for $1.3B",
    "Databricks Acquires MosiacML to Further Democratizing Generative AI",
    "Databricks strikes $1.3 bln deal for generative AI startup MosaicML",
    "Databricks acquires MosaicML to make generative AI accessible for every organization",
    "Man, two billion dollar acquisitions today.",
    "AI Software M&A is hot! https://twitter.com/...",
    "Instagram style acquisitions now going down in AI. This is a big deal for startups. [image]",
    "Databricks Strikes $1.3B Deal for Generative AI Startup MosaicML",
    "People Love OpenAI, Bing and Bard, Survey Finds. What It Says About Stocks.",
    "One in three Americans have tried generative AI tools, new survey shows",
    "The AI survey says.... https://twitter.com/... [image]",
    "Introducing Meta Quest+ | VR Title Subscription",
    "Meta's Quest+ subscription offers two VR titles per month",
    "Meta launches VR subscription service Meta Quest+",
    "Meta Launches VR Subscription Service",
    "Meta Starts Subscription VR Gaming With Quest Plus",
    "Meta Quest+ Subscription Service Offers Cheaper Way to Get Into VR Games",
    "Meta Launches Quest+ VR Subscription Service",
    "Meta unveils Meta Quest+ subscription service",
    "Meta debuts PlayStation Plus-like Quest+ subscription",
    "Meta launches Quest+ subscription for VR headsets",
    "Meta Launches Monthly VR Game Subscription Service for Quest",
    "Meta launches Quest+ subscription & it's actually not a bad deal",
    "Meta Debuts New Subscription Service for Its Virtual Reality Headsets",
    "Say Hello to Meta Quest+, Our New VR Subscription Service",
    "Meta launches new VR subscription ‘Meta Quest+’ for $7.99",
    "Meta Quest+ Subscription Offers Two Games Monthly For $7.99",
    "Meta Quest+ is yet another subscription service that wants our money — here's what it offers",
    "Meta announces its Quest+ subscription for VR gaming",
    "Meta Quest+ VR subscription launches at $7.99/mo",
    "Meta Quest Plus subscription: How it works, and is it worth paying?",
    "Meta Quest+ VR Subscription Service Launches at $7.99/month",
    "Meta Quest+ wants to be Game Pass for VR, but it doesn't stand a chance yet",
    "Meta's New Quest+ Subscription Is Like PlayStation Plus For VR Games",
    "Meta is launching a subscription service for Quest games",
    "Meta Quest Reveals First 4 Games for New PS Plus-Style Service",
    "Meta Launches New VR Subscription Service for $7.99 a Month",
    "Meta Launches VR Subscription Service That Costs $7.99 a Month",
    "Meta Quest+ subscription is the VR version of PS Plus and Xbox Live Gold",
    "Meta announces Quest+, a VR subscription that will offer two titles every month",
    "Meta Quest Plus — Meta's VR gaming subscription is finally here",
    "Meta launches Quest+ games subscription for VR",
    "FTX Debtors Release Second Investigative Report",
    "FTX's New Management Recovers $7 Billion in ‘Substantial Progress’",
    "FTX debtors release second investigative report, details on commingling and misuse of deposits",
    "FTX Exchange in $8.7B Debt to Clients Amid Bankruptcy: Misappropriation of Funds Revealed",
    "FTX Recovers $7 Billion As New Investigative Report Is Released",
    "Meghan Markle's lack of talent explains Spotify failure, says CEO of top Hollywood agency",
    "Film and TV Profits Have Collapsed Over the Last Decade",
    "Hollywood is leaving podcasting to podcasters",
    "Meghan Markle is ‘not a great talent’: UTA CEO after Spotify deal bust",
    "Taylor Swift turned down Meghan Markle's invite to appear on her podcast",
    "Taylor Swift Turned Down Meghan Markle's Podcast Invite: Report",
    "Airline 5G mess still not over, expect flight delays from this weekend",
    "Airline industry still not fully prepared for 5G in C-band spectrum",
    "A 5G deadline could ground some US flights starting July 1st",
    "Secretary Buttigieg warns of flight delays from July 1 due to 5G",
    "If your flight is delayed or canceled starting July 1st, blame it on 5G",
    "An upcoming 5G deadline could cause airline delays starting July 1st",
    "Marques Brownlee on YouTube",
    "RIP to my Pixel Fold: Dead after four days",
    "Google Pixel Fold Review: A Promising Start, but Not Perfect",
    "Google Pixel Fold Review: A Folding Phone That Still Has Some Wrinkles to Work Out",
    "Google Pixel Fold vs Pixel 7 Pro camera comparison: Which is best?",
    "Google Pixel Fold review: Competent, not captivating",
    "Google Pixel Fold review: The challenger that Samsung needs",
    "Google Pixel Fold review: A weekend later, I'm nearly sold on the Fold",
    "Google Pixel Fold Initial Review: Shockingly good, but is it worth the money?",
    "Google Pixel Fold review: An impressive first attempt",
    "Google Pixel Fold: An Excellent Foldable Phone With One Big Problem",
    "Google Pixel Fold review: Wider is better",
    "Google Pixel Fold is a quality first swing at a foldable",
    "Google Pixel Fold Review: Smooth Innovation At A Considerable Cost",
    "Google Pixel Fold unboxing and first impressions [VIDEO]",
    "Google Pixel Fold Review: Maybe Next Year!",
    "Google Pixel Fold Review: For Those Who Really Want to Multitask",
    "Google Pixel Fold review: it surprised the heck out of me",
    "Google Pixel Fold review: First impressions of Google's $1800 folding phone",
    "Google Pixel Fold review: A formidable first foldable",
    "I tried to replace my phone with the Motorola Razr+'s cover display — here's what happened",
    "5 upcoming foldable phones you could wait for instead of buying the Pixel Fold",
    "Tried this briefly at Google I/O and I kinda want a foldable phone now... https://twitter.com/...",
    "Free compensation benchmarking data from 3,000 startups",
    "Apollo Leads $2 Billion Private Financing for Semiconductor Firm Wolfspeed",
    "Apollo Global leads a $2 billion private funding for chipmaker Wolfspeed",
    "Wolfspeed Announces $1.25 Billion Funded Secured Notes Led by Apollo Credit Funds",
    "Chipmaker to Raise Over $1 Billion in Debt From Apollo-Led Group",
    "Apollo leads big debt investment in chip maker Wolfspeed: reports",
    "The real story of how Facebook almost acquired Waze, but we ended up with Google",
    "ThoughtSpot acquires rival business intelligence startup Mode for $200M",
    "Personalized wealth management, built for tech people",
    "There's room for more: Now you can allow up to 5,000 attendees in Zoho Webinar",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Stripe: Help us build universal payments.",
    "Airtable: What will you make?",
    "PayPal: Opening opportunities for all.",
    "Replit: From idea to software, fast.",
    "Character.AI: Build something smarter than you.",
    "Clear Street: Today's financial infrastructure.",
    "Fathom: The leader in medical coding automation.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Discord: Building something you actually use.",
    "Figma: Make design accessible to everyone.",
    "Techmeme: You might have heard of us...",
    "Mon. 06/26 - The M&A Deluge In AI Begins",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "US Supreme Court lets Google win stand against Genius suit over song lyrics",
    "Supreme Court Rejects Lawsuit Accusing Google of Stealing Millions of Song Lyrics",
    "Korean firms fight talent exodus as chip tech war intensifies",
    "Bodega Delivery: Amazon Turns to Thousands of Small Shops to Speed Up Deliveries",
    "Amazon will use small businesses to help deliver packages in the US",
    "Amazon wants to turn small shops into delivery partners",
    "Amazon will now pay your coffee shop to deliver packages",
    "Amazon is leaning on small businesses to help deliver packages around the U.S.",
    "Amazon to lean on local businesses for “last mile” delivery",
    "A small business might deliver your next Amazon package",
    "Amazon Recruiting Local Businesses for Last-Mile Delivery",
    "IBM's $4.6B Apptio deal marks another new era for Seattle-area cloud and IT management company",
    "Billionaire Robert Smith's Vista More Than Doubles Bet on Apptio",
    "IBM snaps up SaaS finops company Apptio for $4.6bn",
    "IBM Is in Talks to Buy Apptio for as Much as $5 Billion",
    "IBM to buy Apptio for $4.6B to help companies optimize IT spend",
    "IBM to acquire software firm Apptio for $4.6 bln",
    "IBM to acquire FinOps leader Apptio for $4.6 billion",
    "IBM Agrees to Pay $5 Billion for Apptio Acquisition",
    "IBM confirms $4.6bn Apptio takeover",
    "IBM to acquire Apptio for $4.6 billion to bolster its cloud and automation capabilities",
    "IBM Will Buy Software Company Apptio for $4.6 Billion",
    "IBM paying $4.6B in cash for tech software firm Apptio in CEO's latest tech deal",
    "IBM acquires hybrid cloud software company Apptio for $4.6B",
    "IBM to buy Apptio from Vista for $4.6 billion",
    "IBM nears $5 billion deal for software provider Apptio, Wall Street Journal reports",
    "IBM acquires Apptio for $4.6 billion, wants to optimize, automate your IT",
    "IBM Buys Software Firm Apptio for $4.6 Billion",
    "IBM nears US$5 billion deal for Apptio",
    "Japan bolsters its chip industry with buyout of equipment maker JSR",
    "Japan steps into chip supply chain with $6.4bn JSR deal",
    "Japan-backed fund JIC to buy chip materials maker JSR for $6.4b",
    "Japan fund eyes JSR buyout as Tokyo ramps up chip intervention",
    "2023 Engineering Salary Expectations Trends Report",
    "Tech Workers Forgoing Higher Salaries Amid Layoff Crisis",
    "Widespread MOVEit hack compromises NYC student data",
    "Clop ransomware gang obtained personal data of 45,000 New York City students in MOVEit hack",
    "New York City Department of Education impacted by online security breach",
    "Community Letter on Data Incident",
    "45,000 NYC students among the victims of MOVEit global data breach, DOE officials say",
    "NYC student data breached in worldwide MOVEit cyberattack, say city Education Department officials",
    "NYC schools hacked with sensitive info on 45,000 students compromised: DOE",
    "Crypto ticks higher, fintech gets interesting again and fraud is still bad",
    "Proud of you @christinacaci - https://www.techmeme.com/...",
    "@amandamarcotte.bsky.social"
]