[
    "Apple's AR/VR Headset Expected to Enter Mass Production in October Ahead of Late 2023 Launch",
    "Apple has built a special hands-on area inside Apple Park for AR/VR headset demos",
    "Apple's rumoured mixed reality headset may be the miracle the European XR industry needs",
    "Apple Reality Pro release date just tipped for December — here's what we know",
    "Apple may soon show off its biggest and riskiest new hardware product in years",
    "Gurman: iOS 17 Wallet App May Show Additional Credit Card Balances",
    "1 big thing: Apple's new headset will land in an AI-crazed world",
    "What to Expect at Apple's WWDC 2023",
    "watchOS 10 reportedly revamps core apps for the Apple Watch Ultra's larger display",
    "Apple's XR headset said to sport M2 with 16GB memory and snap-in prescription lens system",
    "Apple's AR/VR Headset May Be Here By The End Of 2023",
    "WWDC predictions  —  Plus: Meta tries to crash Apple's party  —  Welcome back to Multicore …",
    "New Mac Studio Now Expected To Be Announced At WWDC",
    "Apple WWDC 2023—What It Means for You",
    "A new Mac Studio might be unveiled by Apple during WWDC 2023",
    "WWDC 2023: All you need to know about the big Apple event",
    "How to watch Apple's WWDC 2023 keynote - Apple VR, iOS 17, and more",
    "Apple WWDC 2023 is where the new virtual reality headset rumors face a reality test",
    "Apple Will Likely Release a New Mac Studio at WWDC 2023",
    "What to expect from Apple's WWDC 2023: VR headset, 16-inch MacBook Air, iOS 17 and more",
    "Protip: You can't be a status symbol if you have a battery pack https://twitter.com/...",
    "i expect some things will happen at WWDC https://www.multicore.blog/...",
    "Twitter's Head of Trust and Safety Resigns",
    "Twitter's Top Content Moderation and Safety Executive Leaves",
    "Twitter's trust and safety lead Ella Irwin resigns",
    "Center for Countering Digital Hate",
    "Twitter fails to act on 99% of Twitter Blue accounts tweeting hate",
    "Twitter Loses Its Second Trust and Safety Head Under Elon Musk's Reign",
    "Twitter head of trust and safety Ella Irwin has resigned",
    "Twitter top safety exec Ella Irwin resigns",
    "Twitter loses its second head of trust and safety since Musk take-over",
    "Twitter trust and safety chief Ella Irwin resigns",
    "Twitter loses another trust and safety head",
    "Twitter's head of safety and content moderation has left the company",
    "Twitter Head of Trust and Safety Resigns",
    "Twitter Loses Another Head of Trust and Safety",
    "Twitter head of trust and safety Ella Irwin reportedly resigns",
    "Twitter's head of trust and safety resigns: reports",
    "Twitter's Top Content Policy Executive Ella Irwin Resigns",
    "Twitter's Head of Trust and Safety Ella Irwin Resigns",
    "Ella Irwin, Twitter's Head Trust and Safety, Resigns",
    "Twitter's head of trust and safety resigns",
    "I'm shocked to realize Twitter still had a VP of Trust and Safety",
    "surely this has nothing to do with that daily wire publicity stunt earlier",
    "Confirmed, Ella Irwin tells me she resigned today https://twitter.com/...",
    "So, trust and safety are gone? https://www.reuters.com/...",
    "She's been replaced by a 💩 emoji https://www.reuters.com/...",
    "Well, she really had no work to do since new ownership took control. https://twitter.com/...",
    "Wow, Twitter's head of trust and safety is out for a second time. https://twitter.com/...",
    "Advertisers love this shit. This is what they crave https://twitter.com/...",
    "wheee! https://fortune.com/...",
    "Trust left the office long before this. https://twitter.com/...",
    "Twitter had a head of trust and safety?! 🤨 https://twitter.com/...",
    "job that seems about as desirable as being George Santos' treasurer https://twitter.com/...",
    "I assume these two developments are related. https://twitter.com/...",
    "Another one bites the dust https://twitter.com/...",
    "Twitter loses its top content moderation official at a key moment",
    "The exit of a top Twitter executive highlighted the platform's content moderation challenge",
    "Apple prepares for a platform shift",
    "Elon Musk's new Twitter pronoun rule invites bullying, LGBTQ groups say",
    "It would be funny if Elon Musk's Twitter has “gone woke” in an attempt to avoid “going broke”",
    "@stevenmarkryan The Streisand Effect on this will set an all-time record!",
    "Wonder what stage of @mmasnick's moderation learning curve this is https://twitter.com/...",
    "Whoaaaaaa not good, hope @elonmusk rectifies this immediately https://twitter.com/...",
    "rare twitter W https://twitter.com/...",
    "Facts don't care about your feelings https://twitter.com/...",
    "increasingly rare Twitter W https://twitter.com/...",
    "no one is falling for this publicity stunt right https://twitter.com/...",
    "@PhilGastwirth@worldkey.io",
    "Amazon in talks to offer low-cost or free mobile service to Prime customers, report says",
    "Amazon reportedly in talks to bundle mobile phone service as Prime perk",
    "Free mobile service for Amazon Prime members under discussion",
    "US telecom stocks fall on report Amazon in talks for wireless services",
    "Amazon might be getting into the phone service game, but is it a good idea?",
    "Amazon in Talks to Offer Cheap or Free Mobile Plans to Prime Members",
    "Possible Amazon Entry Into Wireless Services Sends Telecom Stocks Down",
    "Report: Amazon Wants to Give Cheap or Free Phone Plans to US Prime Members",
    "Amazon talking to carriers about cheap (or free) mobile service for Prime subs report",
    "Report: Amazon Prime Member Might Get Free Mobile Phone Service",
    "Amazon is reportedly in talks to provide cheap or free unlimited mobile phone service",
    "Telecom Stocks Fall on Report Amazon Considers Launching Mobile Service for Prime Members",
    "There's two ways to make money online: Bundling and Unbundling https://twitter.com/...",
    "Zuckerberg panics, Osborne Effects Meta with rushed ‘Quest 3’ headset reveal",
    "Dogfood left in bowl. https://www.bloomberg.com/...",
    "Introducing Meta Quest 3 | Coming This Fall",
    "Apple's mixed reality headset is a hedge against disruption",
    "Meta unveils Quest 3 mixed reality headset ahead of Apple's VR debut",
    "Meta announces its Quest 3 VR headset, which will cost $499.99",
    "Meta Announces $500 Quest 3 Headset Just Ahead of Apple Launch",
    "Meta Reveals Quest 3 VR Headset: Higher Resolutions and Next-Gen Snapdragon SoC",
    "Meta tries stealing Apple's headset thunder with Meta Quest 3 tease",
    "Quest 3 won't replace Quest 2 for ‘quite a while,’ confirms Meta",
    "Meta unveils Quest 3 VR headset, available in the fall for $499.99",
    "Meta teases new Quest 3 VR headset as Apple gears up for a launch of its own",
    "Meta unveils Meta Quest 3 headset ahead of Apple's big reveal",
    "Meta unveils Quest 3 mixed reality headset: But you probably can't but it yet",
    "The Morning After: Meta announces its new mixed-reality headset, the Quest 3",
    "Meta Quest 3 announced: mixed reality headset launching this year for £500",
    "Mark Zuckerberg randomly unveiled the Meta Quest 3 just days before Apple unveils Reality Pro",
    "Zuckerberg unveils Meta Quest 3 VR headset days before Apple reveals its own",
    "Meta Unveils $499 Quest 3 Ahead of Apple's VR Headset News",
    "Quest 2 Gets Price Cut Back To $300 And Performance Increase",
    "Meta Quest 3 Announced, Launches This Fall",
    "Meta Quest Gaming Showcase showed off VR versions of Bulletstorm, 7th Guest and more",
    "Meta beats Apple to the mixed-reality punch with $499 Quest 3 coming this fall",
    "Meta unveiled over 20 new games for its Quest headsets today",
    "The Meta Quest 3 is a $499 mixed reality headset with full-color passthrough",
    "Meta's Quest 3 mixed reality headset ships this fall with a $500 price tag",
    "Meta Quest 3 unveiled: Price, features, and when you can buy Meta's new VR headset",
    "Meta Quest 3 officially unveiled, will ship this fall for $499.99",
    "Meta Quest 3 Revealed: Better Visuals & Mixed Reality",
    "Meta is set to launch Quest 3 mixed reality headset this fall for $500",
    "Meta Announces Quest 3 Ahead of Apple Headset Debut",
    "Meta's Quest 3 Mixed Reality Headset coming this fall for $500, Quest 2 prices dropped",
    "Meta Quest 3 VR Headset Officially Unveiled, Powered by Next-Gen Qualcomm Chipset",
    "Meta Unveils Quest 3 VR Ahead of Apple's Mixed Reality Headset",
    "Meta Quest 3 headset coming this fall for $500 with high-color passthrough for mixed reality",
    "Meta Announces $499 Quest 3 VR Headset",
    "Meta Quest 3 Unveiled Days Before the Apple AR Headset; Out This Fall for $499",
    "Meta Quest 3 vs Meta Quest 2: Will the upgrade be worth it?",
    "Meta Announces Autumn 2023 Launch for Quest 3 VR and MR Headset",
    "Meta Announces Quest 3 VR and Mixed-Reality Headset, Starting at $500",
    "Meta unveils new virtual reality device ahead of Apple headset launch",
    "Meta's $499 Quest 3 headset arrives this fall",
    "Meta Unveils Quest 3 Ahead of Apple's VR Headset News",
    "Best thing about this is how ridiculous it makes their own Quest Pro look",
    "Say what you will about Meta, but at least they can count to three.",
    "The Metaverse is so back https://twitter.com/...",
    "@boztank @Qualcomm Congrats Boz. Lighter, thinner, faster and still affordable!",
    "Meta Quest 3 behind the scenes - via Zuck's Instagram [video]",
    "No reason behind this choice I'm sure https://twitter.com/...",
    "sorta reminds me of maelstrom gang faces in cyberpunk... [image]",
    "Meta spoiler ahead of Monday... https://www.meta.com/...",
    "Quest 3. The VR headsets are coming fast and furious now. https://www.cnet.com/...",
    "Meta Calls Employees Back to Office Three Days a Week",
    "Mark Zuckerberg Mandates Meta Employees Return to the Office Three Days a Week",
    "Meta Platforms rethinks hybrid-work policy, to bring some employees back to office 3x a week",
    "Meta tells staff to return to office three days a week",
    "Meta asks office workers to return to in-person work",
    "Meta orders employees back to office 3 days per week after slashing 21K jobs",
    "Meta will require employees to return to the office three days a week starting in September",
    "Facebook Parent ‘Meta Platforms’ Mandates Three-Day Office Work Week from September",
    "Meta wants staff back in the office three days a week",
    "Meta employees need to work from office staring September; check details",
    "Now Meta is forcing all its employees back to the office",
    "Meta Requires Office Workers To Return To Desks Three Days a Week",
    "This is not going to be more efficient. 🤦🏻‍♀ ️ https://www.theinformation.com/ ...",
    "About two years too late. https://www.theinformation.com/ ...",
    "Meta institutes a 3-day work week. https://www.theinformation.com/ ...",
    "Artifact's AI Will Rewrite Clickbaity Headlines, Though Don't You Dare Rework Mine",
    "An app might rewrite this clickbait headline — here's why",
    "Ooh.  I love this.  I think I am a fan of algorithms doing the work for me.",
    "That's a good use of GPT-4",
    "Apple unveils opening date for new retail store at London's Battersea Power Station",
    "Apple Store Battersea Power Station store opens on June 15; Wallpaper available",
    "Some Apple stores earning $100+ million yearly, with 50 new ones planned",
    "Apple opening new store at London's Battersea Power Station on June 15",
    "Buying Apple gear could get easier than ever with 50+ new or refreshed Apple Stores on the way",
    "53 new Apple stores targeted for opening or renovation by 2027",
    "Apple may open more physical stores in India as existing stores are a hit",
    "Apple plans big retail push in Asia-Pacific through 2027",
    "Each Apple Store in India has earned 22-25 crores in just one month",
    "Apple's store expansion plan skips NC - but one Charlotte store is moving",
    "Apple Planning 53 New or Revamped Apple Store Locations Through 2027",
    "Apple Plans to Relocate Some Apple Stores in Canada",
    "Apple plans to expand and revitalize its retail stores worldwide, push deep into China",
    "International Business Times",
    "Insider trading lawsuit: Here's how much Elon Musk pumped DOGE",
    "Plaintiffs in Dogecoin Lawsuit Against Musk Make Wild New Allegations",
    "Dogecoin investors accuse Elon Musk of insider trading in amended class-action lawsuit",
    "Elon Musk's Twitter-to-Doge logo switch raised as evidence in lawsuit",
    "Dogecoin investors strike Elon Musk with market manipulation lawsuit",
    "Elon Musk Accused of Dogecoin Insider Trading Offences by Aggrieved Investors",
    "Elon Musk Accused Of Insider Trading, Amended Lawsuit Blames His Bullish DOGE Moves",
    "Elon Musk accused of manipulating Dogecoin price in $258 billion lawsuit",
    "Elon Musk Faces Insider Trading Accusations in Dogecoin Lawsuit Over Twitter Logo Change",
    "Elon Musk-Linked Robinhood Wallets Moves Over 10 Billion Dogecoin | Coingape",
    "Elon ‘The Dogefather’ Musk Accused of Insider Trading",
    "Elon Musk undertook ‘publicity stunts’ to trade profitably, investors claim in Dodgecoin lawsuit",
    "Dogecoin Investors Accuse Elon Musk Of Insider Trading",
    "Elon Musk is accused again of Dogecoin insider trading",
    "Elon Musk Faces Lawsuit as Dogecoin Investors Accuse the Billionaire of Insider Trading",
    "Dogecoin Investors Accuse Elon Musk of Insider Trading in Lawsuit",
    "Free compensation benchmarking data from 3,000 startups",
    "Challenger, Gray & Christmas, Inc.",
    "May 2023 Layoffs Jump on Tech, Retail, Auto; YTD Hiring Lowest Since 2016",
    "Job Cuts From AI Are Just Beginning, the Latest Challenger Report Suggests",
    "AI Responsible for 4.8% of US Job Cuts in May: Report",
    "Tech layoffs have soared to the highest level in more than two decades",
    "Layoffs Rise 20% in May Led by Technology and Retail",
    "Microsoft updates Teams with communities and AI-powered Designer support",
    "Microsoft Teams App on Windows 11 Adds New Features for Consumers",
    "Build more connections with new communities in Microsoft Teams and GroupMe features",
    "Microsoft Teams on Windows 11 is getting a major facelift, and I'm excited",
    "Microsoft rolls out AI-powered “Designer” for Teams along with bunch of other features",
    "Microsoft's AI-powered Designer tool comes to Teams",
    "Want to create easy visuals in Teams? We've got a good news",
    "Microsoft Teams Gains Designer App for Free and Communities on Desktop",
    "Microsoft announces several new features coming to communities in the free version of Teams",
    "The free version of Microsoft Teams is adding Windows 11 communities and Designer support",
    "“Clickless” iOS exploits infect Kaspersky iPhones with never-before-seen malware",
    "Operation Triangulation: iOS devices targeted with previously unknown malware",
    "Triangulation: Trojan for iOS | Kaspersky official blog",
    "Kaspersky Says New Zero-Day Malware Hit iPhones—Including Its Own",
    "Report details ‘zero-click’ iOS exploit that can infect an iPhone via iMessage",
    "Kaspersky says attackers hacked staff iPhones with unknown malware",
    "Russia's FSB Claims US Targeted iPhones in Spy Campaign, Kaspersky Claims Zero-Click Attacks",
    "Russian FSB Accuses U.S. of Hacking Thousands of iPhones in Russia",
    "Apple Zero-Days, iMessage Used in 4-Year, Ongoing Spying Effort",
    "Russia claims the U.S. is using iPhones to spy",
    "Zero-click iOS exploit has been infecting iPhones with ‘Triangulation’ spyware since 2019",
    "Spyware Infects iPhones Belonging to Employees at Kaspersky",
    "Radio Free Europe/Radio Liberty",
    "Russia says US hacked thousands of iPhones in iOS zero-click attacks",
    "Russia's FSB blames the US intelligence for Operation Triangulation",
    "Apple denies Russia's claim that thousands of iPhones were used for US espionage",
    "Kaspersky uncovers ongoing Operation Triangulation",
    "Russia blames US and Apple for hacking diplomat iPhones",
    "Kremlin claims Apple helped NSA spy on diplomats via iPhone backdoor",
    "Kremlin Officials Continue to Use iPhones Despite U.S. Espionage Fears",
    "Russia Claims Apple Is In ‘Close Cooperation’ With NSA; Uses iPhones To Spy On Officials",
    "Kaspersky Discloses Apple Zero-Click Malware",
    "Russia says thousands of iPhones were hacked, blames U.S. and Apple",
    "Russia says US hacked thousands of Apple phones in spy plot",
    "Russian Intelligence Baselessly Accuses Apple of Assisting the NSA in Breaching Officials' iPhones",
    "Russia Accuses US Intelligence of Hacking Thousands of iPhones",
    "Russia says US hacked thousands of iPhones in spy plot",
    "Russia claims U.S. NSA accessed thousands of Apple iPhones in spy plot",
    "Russian government accuses Apple of colluding with NSA in iPhone spy operation",
    "Why have you had to update all your devices so frequently this year? https://twitter.com/...",
    "Apple denies spying on Russia for the US",
    "NSA hacked iPhones, claims Russia, but Apple involvement simply isn't credible",
    "Apple denies Russia's iPhone surveillance claims",
    "Personalized wealth management, built for tech people",
    "Why Zoho Sign is a great alternative to Adobe Acrobat Sign",
    "Unlock a new pipeline channel: your existing customers",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "Airtable: What will you make?",
    "Character.AI: Build something smarter than you.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Discord: Building something you actually use.",
    "Adobe: Let’s create experiences that matter.",
    "Clear Street: Today's financial infrastructure.",
    "Stripe: Help us build universal payments.",
    "Techmeme: You might have heard of us...",
    "Fri. 06/02 - An Amazon Prime Phone Service?",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jun 19-23Cannes LionsCannes",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "@securopean@infosec.exchange",
    "Microsoft stashes nearly half a billion in case LinkedIn data drama hits",
    "Microsoft expects to pay $425 million fine for LinkedIn privacy violations",
    "Microsoft says it may pay a $425 million fine over alleged Linkedin privacy violations",
    "Microsoft Braces for $425 Million Fine over LinkedIn GDPR Privacy Violations",
    "Hands-on: The Asus ExpertBook B9 OLED and B5 OLED are super light laptops for business",
    "SpaceX's Starlink wins Pentagon contract for satellite services to Ukraine",
    "Pentagon discloses it's paying for Elon Musk's Starlink internet in Ukraine",
    "Pentagon buying Starlink dishes for Ukraine after funding dispute with SpaceX",
    "Pentagon awards SpaceX with Ukraine contract for Starlink satellite internet",
    "Pentagon Buying Musk's Starlink for Ukraine",
    "The Pentagon Cuts a Deal With Elon Musk's SpaceX to Aid Ukraine",
    "Pentagon Picks Musk's SpaceX Starlink for Ukraine Comms",
    "SpaceX Wins Pentagon Contract for Ukraine",
    "Pentagon Buys Up Starlink Terminals for Ukrainian Military, Despite Musk's ‘WW3’ Fears",
    "Starlink Lands Pentagon Contract To Provide Internet To Ukraine",
    "More SpaceX Starlink terminals will go to Ukraine following new order from Pentagon",
    "Musk's SpaceX wins Pentagon contract for satellite in Ukraine",
    "Microsoft signs multi-billion dollar deal with GPU cloud provider CoreWeave to meet AI needs",
    "Microsoft signs deal with CoreWeave for computing infrastructure: Report",
    "Microsoft has signed deal with CoreWeave for AI computing power, say sources",
    "CoreWeave Secures $200 Million Series B Extension, Bringing Total Round to $421 Million",
    "Microsoft inks computing infra deal with CoreWeave: CNBC report",
    "Google, Nvidia and Microsoft Offer What VCs Can't",
    "Google, Microsoft invest in AI startups as battle for dominance heats up",
    "Microsoft Signs Deal With Cloud Startup for Access to GPUs",
    "Microsoft inks computing infra deal with CoreWeave - CNBC",
    "In Rare Unicorn Up Round, Travel Startup GetYourGuide Raises $194M At $2B Valuation",
    "GPU-accelerated cloud provider CoreWeave secures $200M led by Magnetar Capital",
    "Cloud Startup CoreWeave Raises Another $200 Million",
    "Specialized Cloud Provider CoreWeave Rides AI Wave To Another $200M Round",
    "You missed nvidia stock pumping? Where can we get some CoreWave stock fam https://www.cnbc.com/...",
    "Airbnb sues NYC over new rules requiring hosts to register their homes as short-term rentals",
    "Europe's most Instagrammable city to ban Airbnb rentals",
    "Airbnb and NYC Hosts File Lawsuits Against City's Restrictive Rental Laws",
    "An update about our community in New York City",
    "Airbnb Sues New York City Over Limits on Short-Term Rentals",
    "Airbnb Sues New York City Over Short-Term Rental Law",
    "Airbnb Sues NYC Over Limits On Short-Term Rentals",
    "Airbnb Fights New NYC Short-Term Rental Requirements",
    "Airbnb sues New York City over ‘extreme and oppressive’ new rules for short-term rentals",
    "Airbnb claims NYC's strict new rules could spur ‘de facto ban’ on service citywide: suit",
    "Airbnb Sues New York City in Bid to Block Short-Term Rental Law",
    "Dell Technologies Delivers First Quarter Fiscal 2024 Financial Results",
    "Dell Technologies Announces 1st Quarter Fiscal 2024 Financial Results",
    "Dell Gains as Sales Top Estimates on Business PC Surprise",
    "Dell's revenue plunge was expected. The question is when growth will return",
    "Dell's quarterly revenue drops 20% on weak PC demand",
    "Dell Technologies Crushes First-Quarter Earnings, Sales Targets",
    "Dell Technologies Q1 better than expected, but sales fell 20% from a year ago",
    "Binance to Delist Privacy Coins in 4 European Countries",
    "Binance Targets Privacy Coins for Delisting in Four European Countries - What's Going On?",
    "EU Digital Specialists To Put Twitter Under ‘Stress Test’ This Month",
    "Marques Brownlee on YouTube",
    "Reimagine the possibilities with the new motorola razr family",
    "The Motorola Razr+ might finally be the flip-style foldable I've been waiting for",
    "Motorola makes its 4th-gen foldable, the Moto Razr+, official",
    "Flipping Out for Motorola's Latest: Hands-On With the Motorola Razr+ and Razr",
    "Motorola unveils razr 40 and razr 40 ultra, offering a “balanced smartphone experience”",
    "RAZR+ Impressions: Is This What You Wanted?",
    "Motorola unveils new Razr family 2023: Blending style and cutting-edge technology",
    "Hands-on: Motorola Razr and Razr+ finally realize the vision of foldable flip phones",
    "We got our hands on the new Razr 40 Ultra (Razr+)",
    "Motorola Razr Plus hands-on: A return to form",
    "The Motorola Razr+'s 3.6-inch front display could put Razr back on the map",
    "Motorola announces Razr 40 and Razr 40 Ultra in China",
    "I used the new Razr Plus — and it may be the flip phone of my dreams",
    "Instagram's algorithms explained: Why you see certain content and how to change that",
    "How Instagram Decides What You See, Explains CEO",
    "Instagram attempts to explain ‘shadowbanning’, but creators still aren't happy",
    "How Instagram ranks content in 2023: Feed, Stories, Explore, Reels, Search",
    "Instagram's Head Says You Shouldn't Worry About Shadowbanning",
    "Instagram Ranking Explained",
    "Tether USD₮ Reaches All-Time High, Surpasses Previous Market Cap High of $83.2B",
    "Tether's Market Cap Reached New All-Time High Levels This Month",
    "Tether reaches new all-time high (ATH) market cap",
    "Tether Market Cap Climbs to All-Time High of $83.2B, Even as Stablecoin Market Sinks",
    "Tether Reaches New High Despite Market Turbulence",
    "Tether's Market Cap Reaches New High, Exceeding $83.2B",
    "USDT Market Cap At Record Highs, Crypto Bull Market Incoming?",
    "Tether's market cap surges to new all-time high, reaching record levels",
    "Tether (USDT) Market Cap Breaks May 2022 ATH Level of $83.2 Billion",
    "Good job! https://twitter.com/...",
    "U.S. District Court, Western District of Washington",
    "Thirty Thousand Amazon Workers Could Access Alexa Data, FTC Says",
    "Amazon must pay over $30 million over claims it invaded privacy with Ring and Alexa",
    "What the Amazon Alexa settlement means for parents and kids",
    "Amazon fined $25 million for violating child privacy and Ring is facing charges, too",
    "Some 30,000 Amazon employees could spy on Alexa users' voice recordings: FTC",
    "Amazon Pays $30.8M to Settle Ring Spying & Alexa Privacy Lawsuits",
    "Amazon's Ring and Alexa privacy charges include lessons for the whole tech industry",
    "FTC charges Ring over ‘disregard’ for customer data security",
    "Amazon to pay over $30 million in FTC settlements over Ring, Alexa privacy violations",
    "United States of America v. Amazon.com, Inc. and Amazon.com Services LLC"
]