[
    "International Business Times",
    "San Francisco Business Journal",
    "Threads already has over 95 million posts",
    "Threads Vs Twitter: How Do The Two Apps Compare?",
    "Is Threads threatening Twitter's reign?",
    "Meta Reports 70 Million Threads Sign-ups in First 2 Days",
    "Threads Barrels to 70 Million Sign-Ups in Just 2 Days",
    "Meta launches a Threads beta program for Android users",
    "Meta's ‘friendly’ Threads collides with unfriendly internet",
    "Here's Why Meta's Threads Is Going To Help Resurrect Twitter",
    "‘Clone’ or competitor? Users and lawyers compare Twitter and Threads",
    "Instagram Head Says Meta 'Won't Encourage' News on Threads",
    "Threads is All The Worst Parts of Twitter And Instagram in One Very Bad App",
    "Here's some data about Threads downloads geographically.From The Messenger:",
    "Zuckerberg's ‘Twitter killer’ Threads hits 70m sign-ups in two days",
    "A ‘Thread’ About Twitter....And The End Of The Honest Internet",
    "Meta's Threads Passes 70M Signups; Users More Than Double In One Day",
    "Meta's new Threads social network reaches 70M users",
    "Threads, Data Or Not, Giving Brands Somewhere To Go Other Than Twitter",
    "Iran Blocks Public Access to Threads App; Raisi's Account Created",
    "Elon Musk and Mark Zuckerberg's surprisingly long history of trying to outdo each other",
    "The Algorithmic Anti-Culture of Scale",
    "With Threads, Meta Has Plenty of Opportunity And Underappreciated Risk",
    "Twitter's Desktop App Sees Surge in Outages as Meta's Threads Takes Off",
    "Official Google and YouTube accounts join Threads",
    "Twitter vs. Threads - Elon Musk and Jack Dorsey go after Mark Zuckerberg",
    "Threads is now up to 70 million users, which is “way beyond” Meta's expectations",
    "Meta's Threads upends social media in less than 48 hours",
    "Meta's Threads Has 70 Million Signups, Surprising Zuckerberg",
    "Daily Digest: Threads up to 50 million users; PE firm secures $20B for buyout fund",
    "Mark Zuckerberg touts 70 million sign ups to Threads",
    "Threads: New Twitter rival looks like a shrewd move but Meta lacks credibility",
    "Twitter threatens to sue its new rival, Threads, claiming Meta stole trade secrets",
    "Threads installation touches 55 million mark, 30 million within 24 hours",
    "Meta's Twitter rival Threads crosses 70 million signups in two days",
    "Instagram Threads hits 30m signups as Twitter threatens to sue",
    "Hours In, Threads Is Already a Big Hit",
    "More than 30 million people signed up for Meta's new Threads app",
    "The definition of a mass social network! [embedded post]",
    "Opinion: If Threads work, it won't be because it toppled Twitter, but because it toppled Instagram",
    "Meta executive claims goal of Threads is to create a ‘less angry place,’ not replace Twitter",
    "Meta's vision for Threads is more mega-mall than public square",
    "Threads: We Don't Need Hard News or Politics on Our Platform",
    "Threads Won't Promote Political Or Hard News Content — A Contrast From Twitter",
    "Meta Threads doesn't need the ‘negativity’ of hard news and politics, exec says",
    "Meta examining allowing users to delete Threads ‘separately’ from Instagram",
    "Head of Instagram reveals what's coming to Threads",
    "Threads Is Working On A Chronological Feed",
    "Threads Is Breaking Download Records",
    "Instagram Threads to soon get a Following tab, says Adam Mosseri",
    "You can't delete your Threads account if you want to keep Instagram — here's why",
    "Threads will soon allow deleting your account separately from Instagram",
    "Threads Will Get a Chronological Feed Option Eventually",
    "good luck with that [embedded post]",
    "The Meta team is low-key roasting politics Twitter over on the other app [image]",
    "sad trombone.mp3 https://twitter.com/...",
    "That's up to the users, surely. https://twitter.com/...",
    "NPR quitting Twitter was a turning point in the story.  Now the news organization is on Threads.",
    "Threads isn't for news and politics, says Instagram's boss",
    "‘All aboard the Threads train!’ New York agencies join Instagram's new alternative to Twitter",
    "Threads won't be fun — but it will give brands a refuge from Twitter",
    "Instagram Head Wants Threads to Be a Sterile, News-Free Environment",
    "Instagram's Threads threatens to destabilize Twitter, enticing users & potential ad spend",
    "How Wendy's and 12 other brands jumped on Threads",
    "Meta's Threads App Sees Early Success, Drawing Advertiser Interest and Twitter's Ire",
    "Who's on Threads? And Who's Sitting Out?",
    "Want to Video Chat Your Twitter Followers? It's Happening",
    "Threads, Meta's Twitter clone, just launched and people are already complaining about it",
    "Meta's Advertising Backbone Guarantees Threads' Monetization",
    "Head of Instagram says placing ads within Threads is “not a priority right now”",
    "15 features of the new Meta Threads",
    "Why is Threads unavailable in the EU?",
    "Threads app breaks records on first day. Here's how",
    "A brief review of the Threads Android app",
    "@rwaddilove@techhub.social",
    "You will later be able to delete your Threads account w/o losing Instagram",
    "Threads attracts 30M users in 24 hours despite design flaws, privacy concerns",
    "Threads Supplemental Privacy Policy",
    "Threads—Exactly How Private Is Meta's New Twitter Challenger?",
    "Meta is working to stop deleted Threads accounts from nuking Instagram too",
    "Twitter's desktop app sees surge in outages as Meta's Threads takes off",
    "Should businesses join Threads? Here's what experts say about the buzzy new platform.",
    "All these features are on the way to Threads by Instagram",
    "How to join and use Meta's Twitter rival Threads",
    "How to delete Instagram Threads account: Here's a step-by-step guide",
    "I used Threads for 24 hours — what I love and hate about Instagram's Twitter challenger",
    "Silicon Valley Business Journal",
    "Why Threads has a shot, but only 5 social media platforms actually matter",
    "Threads vs Twitter: Comparing Advantages and Limitations, Who Wins?",
    "Meta's Twitter Rival Threads Explodes to 50 Million Signups One Day After Launch",
    "If You're An Instagram User, Here's One Thing You Should Know Before Making Your Threads Profile",
    "How to change your Threads username",
    "Meta responds to Instagram accounts being erased because of Threads",
    "How to delete Twitter accounts",
    "How to Delete or Deactivate Threads Account",
    "Twitter killer? Here's what you need to know about Meta's Threads",
    "Twitter should be worried as Threads racks up 30 million sign ups in less than 24 hours",
    "Threads is different from Twitter and that is both a good and bad thing",
    "Meta publishes Threads Dictionary to help newcomers decipher the jargon",
    "Want to Delete Your Threads Profile? Then Delete Your Instagram Account, Says Meta",
    "Threads is getting a following feed, but not for a while",
    "Hands On With Instagram Threads: Does Meta's Twitter Killer Deliver?",
    "Threads Goes Live, Accounts Linked to Instagram",
    "Why Meta's Threads app is the biggest threat to Twitter yet",
    "Threads won't save us from Twitter",
    "Meta's Threads swiftly signs up 30 million users, in clear threat to Twitter",
    "Threads profiles can't be deleted without removing your entire Instagram account",
    "Threads review: Twitter without the rough edges or news",
    "Tens of millions sign up to Twitter rival Threads",
    "Threads is Instagram's Twitter; Here's how to manage your privacy and security settings",
    "Deleting Threads Account Permanently? It Requires You to Delete the Instagram Account",
    "How to delete Threads account",
    "Meta's Threads passed 20 million users within 12 hours, and it's not slowing down",
    "Threads accounts are impossible to delete without erasing your Instagram presence",
    "What Is Threads?  Everything You Need To Know About Meta's New Twitter Alternative",
    "Instagram flooded Threads with celebrities and brands at launch",
    "Data Capture in the New Social Media Age",
    "Mark Zuckerberg gloats over Threads' 10 million signups",
    "@Techmeme This is similar to Google, Microsoft and others.  One account for multiple services.",
    "I'm muting this but here's a screenshot [image]",
    "https://techcrunch.com/... *laughs maniacally*",
    "This is the bit where someone says, “I told you so!” https://techcrunch.com/...",
    "NEW: @meta WILL ELIMINATE YOUR INSTAGRAM ACCOUNT IF YOU DELETE YOUR THREADS ACCOUNT [image]",
    "You can't delete threads by itself. https://techcrunch.com/...",
    "🟡 SCOOP: Twitter is threatening to sue Meta over Threads, @maxwelltani reports.  Read the letter:",
    "Guess I'm stuck with this app...",
    "Meta will nuke your Instagram account if you delete Threads profile",
    "Threads profile can only be deleted by deleting Instagram account, Meta says",
    "Apple Vision Pro Will Reportedly Have A Very Slow Rollout, UK & Canada Next",
    "Apple Is Planning a Slow, In-Store Rollout for Its Vision Pro Headset",
    "Buying an Apple Vision Pro Will Be a Boutique Experience",
    "You'll need an appointment, a head scan, and prescription data to buy an Apple Vision Pro",
    "Apple reportedly plans to launch its Vision Pro headset in Canada by the end of 2024",
    "Apple Will Require Appointments to Buy Vision Pro Headset",
    "Apple Vision Pro Might Hit Canada in 2024, Says Report",
    "Apple Vision Pro Headset: New Leak Reveals Design And Release Date Update",
    "Apple Vision Pro rumored to launch in the UK and Canada by end of 2024",
    "The Apple Vision Pro headset may only be purchasable by appointment",
    "Apple Vision Pro may require in-store appointments — and there's more bad news",
    "You're Going to Need an Appointment to Get Your Hands on Apple's Vision Pro",
    "Apple working on inclusive Vision Pro accessories and a head scanning app",
    "Apple reportedly requiring in-store appointment to buy Vision Pro headset",
    "Apple's Vision Pro won't ship outside US for over a year",
    "Apple Vision Pro Sales to Reportedly Require an Appointment and Face Scan",
    "Apple Will Require Appointments to Test Vision Pro Headset",
    "Apple's Vision Pro retail plan will be a velvet-rope experience",
    "Report: Apple Vision Pro Sales Process to Include Face Scans",
    "Apple Vision Pro May Be Sold By Appointment Only To Start",
    "Apple preps measured, appointment-only sales of Apple Vision Pro",
    "Apple's Vision Pro Could Land In UK And Canada By End Of 2024",
    "The “appointment-only” Vision Pro will reportedly arrive in UK and Canada by the end of 2024",
    "There's a bunch of bad news about Apple's Vision Pro headset",
    "Buying Apple's Vision Pro headset could require an appointment and a face scan",
    "Apple's Vision Pro headset will be very hard to buy-even if you can afford one",
    "Apple may launch the Vision Pro headset with appointment-only sales",
    "Apple Vision Pro buying experience will reportedly be by appointment only",
    "Buying Apple's Vision Pro headset will require in-store appointment",
    "Vision Pro will require an appointment, initially only in Apple Stores",
    "Apple will require retail appointments to purchase Vision Pro, slow rollout planned for 2024",
    "Apple Plans a Slow, Appointment-Only Rollout of Its $3,500 Vision Pro",
    "SUPREME COURT OF THE STATE OF NEW YORK",
    "GEMINI TRUST COMPANY, LLC, v. DIGITAL CURRENCY GROUP, INC. and BARRY SILBERT",
    "Gemini Sues Digital Currency Group and Founder Barry Silbert Alleging ‘Fraud’",
    "Gemini Sues Barry Silbert, DCG as Genesis Restructuring Stalls",
    "Crypto Clash: Gemini And Genesis Owner Barry Silbert Go To Court Over Lost Bitcoin",
    "Winklevoss' Gemini Sues DCG and Barry Silbert For Fraud",
    "Gemini Sues Barry Silbert And His Company DCG Alleging Fraud Against Earn Users",
    "Gemini Sues Digital Currency Group Founder for Fraud",
    "Gemini suit accuses DCG, Silbert of ‘aiding and abetting fraud’",
    "Gemini takes legal action against Digital Currency Group for alleged fraudulent activities",
    "Gemini sues Digital Currency Group and CEO Barry Silbert over Genesis Capital insolvency",
    "Gemini files lawsuit against DCG and Barry Silbert alleging fraudulent activities",
    "Winklevoss twins sue crypto investor DCG after dispute over restructuring",
    "Gemini Lawsuit Accuses Barry Silbert and Digital Currency Group of Fraud",
    "US-Based Crypto Exchange Gemini Sues Genesis Parent Company DCG Over Gemini Earn Dispute",
    "Gemini Files Lawsuit Against Digital Currency Group and Barry Silbert Alleging Fraud and Deception",
    "Crypto firm Gemini sues Genesis-owner DCG",
    "Gemini Sues Genesis Owner Over Failure to Recover Customers' Bitcoin",
    "Breaking: Gemini Files A Lawsuit Against Digital Currency Group and Barry Silbert for Fraud",
    "I cannot wait to see discovery https://twitter.com/...",
    "Our whole industry is becoming a novella. https://twitter.com/... [image]",
    "Could have been avoided by doing 15 minutes of due diligence. https://twitter.com/...",
    "Mystery $120 Million Outflow Hits Crypto Bridge Multichain Whose CEO Is Missing",
    "Multichain shuts down amidst $130 million suspected hack",
    "DeFi Protocol Multichain Hacked For $126 Million, PechShield Confirms",
    "Circle freezes $63m in USDC in response to Multichain breach",
    "Multichain Halts All Services Following Exploit, Losses Over $126 Million",
    "Multichain Woes: Users Informed of an ‘Abnormal’ Transfer of Assets to Unknown Address",
    "More than $125 million taken from crypto platform Multichain",
    "CZ Says Binance Users' Assets are Not Affected by Multichain Hack",
    "$63 million in USDC frozen by Circle following Multichain breach",
    "Multichain Halts Operations, Warning Users of Mysterious $126M Outflow",
    "Fantom (FTM) Sheds 10% Following Multichain Bridge “Withdrawals”",
    "Multichain Fantom Bridge Exploited and Drained of $126M, Aptos Twitter Account Hacked",
    "$130M Worth Of Outflows From Multichain Spark Fears Of Exploit",
    "Multichain halts services after $126M exploit",
    "$126M in Multichain Funds ‘Abnormally’ Moved to Unknown Address, Says Troubled Bridging Project",
    "Multichain MPC Bridge Experiences Massive Outflows, Triggering Concerns of Potential Exploit",
    "Multichain MPC bridge sees $100M+ outflows, sparking fears of exploit",
    "Hack or Rugpull? Multichain Sees $126 Million ‘Abnormal’ Outflows",
    "PRICE PREDICTIONS  —  Fantom Price Prediction: Can FTM Shrug Off Multichain Users' Selloff?",
    "Another bridge hacked. Sleep on $ROUTE https://twitter.com/...",
    "Exploit of Fantom, Moonriver and Dogechain Crypto Bridges Confirmed by Multichain Team",
    "@Celeste_pewter@mastodon …",
    "@neurovagrant@masto.deoan.org",
    "Musk sues law firm because he's mad that Twitter paid $90 million bill",
    "Twitter Sues Law Firm Over $90 Million Payment in Elon Musk Deal",
    "Elon Musk sues law firm over huge fee Twitter paid hours before he took over",
    "Elon Musk's Twitter sues top law firm Wachtell over $90 million fee for work under prior ownership",
    "Twitter Sues Wachtell Over $90 Million Payout for Musk's Buyout Deal",
    "Musk Sues Wachtell, Lipton To Recover $90 Million Fee",
    "Musk sues law firm Wachtell Lipton over $90mn Twitter legal fee",
    "there's poking the bear and then there's whatever the hell this is [embedded post]",
    "@Celeste_pewter@mastodon.social",
    "Gotta Go Slow: ‘Sonic’ Creator Sega Rethinking Crypto Games, Won't Use Major IP",
    "Sega hits the brakes on its blockchain plans",
    "Sega Takes Cautious Approach to Web3 Gaming in Revised Strategy",
    "Web3 Gaming Continues to Dominate Defi Despite 8% Plunge",
    "Sega Boss Says the Company Might Be Done With that Dumb NFT Game",
    "Sega Suspends Blockchain Gaming Initiatives, Game Over?",
    "Game Over for Sega NFTs? Gaming Giant Backtracks From Blockchain Plans",
    "Sega (Mostly) Hits The Brakes On NFTs In Games",
    "Play-To-Earn Games Are Boring, Says Sega",
    "Sega Shifts Stance on NFTs in Games",
    "Sega Is (Thankfully) Losing Interest In The Blockchain",
    "Sega executive calls play-to-earn blockchain games ‘boring’",
    "Sega cools blockchain and NFT interest, questions whether tech will “take off”",
    "Sega promises no third-party blockchain projects for its biggest franchises",
    "SEGA Largely Pulls Away from Blockchain and Play to Earn Gaming Pursuit",
    "Sega to Step Away From Web3, Exec Calls P2E Games Boring",
    "Sega's infatuation with the blockchain is over: 'What's the point if games are no fun?'",
    "Sega scales back blockchain plans",
    "Sega rethinks plans on ‘boring’ blockchain gaming: Bloomberg",
    "Sega is stepping back from blockchain gaming",
    "Nifty News: Sega exec calls P2E games ‘boring,’ Tom Brady's NFT firm switches it up and more",
    "Japanese gaming firm Sega backs out of blockchain: Bloomberg",
    "Sega Rethinks GameFi Plans, COO Calls Blockchain Gaming ‘Boring’: Bloomberg",
    "In 50 Words: Sega shifts blockchain gaming stance as crypto struggles",
    "Sega Executive Dismisses ‘Play-to-Earn’ Blockchain Games as ‘Boring’",
    "Sega Bins Blockchain Plans, Calls F2P Games ‘Boring’",
    "Sega eases back blockchain, NFT plans",
    "Apple cracks down on lending apps after deepfake nudes threat",
    "After Google, now Apple also removes predatory lending apps in India",
    "Apple Removes Predatory Lending Apps from Indian App Store",
    "Apple India Cracks Down On Illegal Digital Lending Operators, Delists Multiple Apps",
    "Apple's App Store removes predatory lending apps in India",
    "Apple pulls predatory lending apps from India App Store",
    "Scam loan apps in the App Store threaten to send fake nudes to contacts",
    "Personalized wealth management, built for tech people",
    "Bangladesh government website leaked data of millions of citizens",
    "Bangladesh Government Website Leaks Citizens' Personal Data",
    "Bill stalls to make Big Tech pay California publishers for news",
    "This leaves out more than it reveals, trust me. https://www.washingtonpost.com/ ...",
    "New minimum pay rates for NYC app-based food delivery workers are delayed",
    "Doordash, Grubhub and Uber sue New York City over minimum wage law",
    "App makers sue to halt NYC rule setting $18 hourly wage for food delivery",
    "New Minimum Wage Rule for NYC Food Delivery Workers Temporarily Halted by Judge",
    "Uber, DoorDash Sue NYC to Stop Delivery Drivers From Getting a Minimum Wage",
    "A DoorDash worker cursed at her over a $5 tip. Then she learned what they're paid",
    "Uber, DoorDash, Grubhub sue over NYC $18-per-hour rule",
    "Uber, DoorDash and Grubhub sue New York City over $18 minimum-wage law",
    "Uber, DoorDash sue New York City over minimum wage law",
    "Food delivery apps DoorDash, Grubhub to block driver wage hike: lawsuit",
    "There it is, these scumbags will never give up their fraudulently low pay without being forced to.",
    "Uber, DoorDash Sue NYC Over Minimum Wage Law",
    "Free compensation benchmarking data from 3,000 startups",
    "Make your family time a blast with these activities",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Adobe: Let’s create experiences that matter.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Airtable: What will you make?",
    "Replit: From idea to software, fast.",
    "Character.AI: Build something smarter than you.",
    "Lightmatter: Next-gen computing built for AI.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Clear Street: Today's financial infrastructure.",
    "Techmeme: You might have heard of us...",
    "Fri. 07/07 - I've Never Seen Anything Like Threads",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Jul 11-12VentureBeat TransformSan Francisco",
    "Jul 26Samsung Galaxy Unpacked \"Join the Flip Side\" media eventSeoul",
    "Jul 26Earnings: META, EBAY, Samsung Electronics",
    "Aug 2Earnings: DASH, QCOM, HOOD, PYPL",
    "Aug 3Earnings: AAPL, BKNG, SQ, NET",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Don't Count Bluesky Out Yet",
    "Bluesky Reaches 1 Million Downloads as Threads Topples 70 Million",
    "Meta's Threads Might Be the Most Downloaded App on Launch Day in History: Analysts",
    "How Threads Became One of the Fastest Growing Apps Ever",
    "Can you run Threads on a desktop?",
    "Meta launches a Threads beta program for Android",
    "Meta launches Threads app as an alternative to Twitter",
    "Bluesky Hits 1 Million Installs As Competition With Threads Heats Up",
    "How to use Threads on desktop using Windows 11",
    "China ends probe of Ma-backed Ant with $984 million fine",
    "China wraps up fintech crackdown with big fines on Tencent, Alibaba",
    "Ant Group fined $1bn as China regulators conclude overhaul",
    "China hits tech firms with hefty fines as crackdown draws to close",
    "Ant Group, Jack Ma-founded fintech giant, gets fined almost $1 billion by China regulators",
    "China fines Jack Ma's Ant Group nearly $1 billion",
    "China finalises Ant Group's regulatory overhaul with hefty fine",
    "Alibaba Stock Rises As China Concludes Probe Of Affiliate Ant Group",
    "China Fines Ant Group $985 Million, in Sign Crackdown Is Over",
    "Alibaba Up 3.4% as China Completes Ant Group Probe With a $984M Fine",
    "China's financial regulators wrap up makeover of Ant Group and Tencent",
    "China hits Alibaba affiliate Ant Group with $985 million fine for violating various regulations",
    "China fines Ant 7.1 billion yuan",
    "Ant Group faces hefty $1.1b fine",
    "Alibaba Stock Soars After China Fines Ant Group $1 Billion. Here's Why.",
    "China to end Ant Group's regulatory revamp with fine of at least $1.1 billion: sources",
    "China Ends Tech Crackdown With Fines on Tencent, Ant Group",
    "Huawei launches Pangu Large Model 3.0",
    "Alibaba launches A.I. tool to generate images from text",
    "Alibaba Rolls Out AI Image Generation Model to Enhance Business Productivity",
    "Alibaba unveils AI tool for text-to-image conversion",
    "Alibaba Cloud Generative AI Text-to-Image",
    "China's Alibaba and Huawei showcase new AI products amid frenzy",
    "Alibaba unveils AI image generator to compete with Midjourney",
    "Alibaba unveils Midjourney alternative Tongyi Wanxiang",
    "Annual public cloud revenue reaches half a trillion dollars",
    "Public cloud services revenue surged past $500bn last year",
    "Global cloud revenues hit new high as SaaS demand booms",
    "AI for All: Powering APIs and Large Language Models with Lightning ⚡🤖",
    "Lightning Labs Unveils Innovative Bitcoin Toolkit for AI",
    "Lightning Labs unveils tools that will allow AI to make bitcoin transactions",
    "ChatGPT plug-in can now send Bitcoin payments",
    "Lightning Labs Unveils New Tools to Ease Bitcoin Transactions for AI",
    "Lightning Labs Empowers AI Agents like ChatGPT to Transact in Bitcoin",
    "Lightning Labs unveils tools enabling AI apps to seamlessly interact with Bitcoin network",
    "Lightning Labs Releases Tools for Bitcoin-Powered AI Products",
    "Lightning Labs releases tools letting AI transact and hold Bitcoin",
    "Bitcoin + AI  —  run  —  run as fast as you can  —  away from this [embedded post]",
    "Binance Unravels as Executives Flee and Layoffs Proliferate",
    "Binance senior execs deny they're resigning over DoJ probe",
    "Binance Defies FUD With $2B Inflows In 24 Hours Amid Senior Execs Departure Controversy",
    "CZ Says Binance Is Not FTX As Exchange Inflows Near $2 Billion",
    "Binance Facing Leadership Crisis as Top Execs Quit: Should Exchange Users be Worried?",
    "Was Binance to Blame for the Bitcoin Price Plunge Today? Find Out Here.",
    "Binance's CZ Dispels “FUD” Around Leadership Departures",
    "Binance CCO Will not Join the Resignation Spree",
    "Exodus of Senior Managers From Binance ‘No Cause For Concern,’ Says CZ",
    "Binance CEO Calls Reasons Behind Employee Turnover ‘Completely Wrong’",
    "Top Binance Execs Leave Company Over CZ's Handling of DOJ Investigation: Report",
    "Top Binance Executives Exit Over CEO's Response to DOJ Investigation",
    "Binance executives reportedly depart amid regulatory troubles",
    "Another Binance Exec Resigns Amid US Legal Scrutiny",
    "Senior Binance Execs Quit Over CZ's Response to DOJ Probe: Report",
    "Binance's top strategist confirms departure amid reports of US resignations",
    "CZ denies rumors senior Binance executives resigning due to ongoing regulatory challenges",
    "Top Binance Executives Quit",
    "“what justice department investigation?” https://fortune.com/...",
    "@MilkRoadDaily Definitely false, only one this week. They exaggerate everything.",
    "Binance is in full-on turmoil. https://fortune.com/...",
    "Right when we expect things to slow it just gets busy. Not a great look! https://twitter.com/...",
    "$COIN trading at $16.4B market cap https://twitter.com/...",
    "be pretty fun to see SBF and CZ sharing a cell https://twitter.com/... [image]",
    "Hey @cz_binance - 4 or is this legit? https://twitter.com/...",
    "Probably nothing https://twitter.com/...",
    "hahah NOW Patrick quits? https://twitter.com/...",
    "Why can't they just say 4? https://twitter.com/...",
    "14) How did Binance fall apart ? Slowly and then all at once. https://twitter.com/...",
    "Rats, ship https://twitter.com/...",
    "Heading 4 the door https://twitter.com/...",
    "GPT-4 API general availability and deprecation of older models in the Completions API",
    "GPT-4 API is now generally available to paying customers",
    "OpenAI announces general availability of GPT-4, depreciation of older models",
    "OpenAI's GPT-4 Language Model Now Available to All Paid API Users",
    "An AI model deprecation dilemma",
    "OpenAI Releases GPT-4 API, Announces Retirement of Older Models",
    "OpenAI Upgrades API With GPT-4 and Opens DALL-E and Whisper API Access",
    "OpenAI Makes ChatGPT-4 API Publicly Accessible for Developers",
    "GPT-4 API now available to all, as OpenAI goes all-in on chat",
    "OpenAI Announces GPT-4 General Release For Developers",
    "OpenAI announces general availability of GPT-4",
    "OpenAI Expands API Access and Embraces Chat Format for GPT-4",
    "Why OpenAI Expansion Of GPT-4 API Means Apps Will Become More Powerful",
    "OpenAI announces general availability of its GPT-4 API: Here's what it means",
    "OpenAI's GPT-4 is now available to paying developers",
    "Deploying Falcon-7B Into Production",
    "OpenAI opens up GPT-4 to all paying customers",
    "JumpCloud resets admin API keys after unspecified ‘ongoing incident’",
    "Fine-tuning is coming to GPT-4 and GPT-3.5 later this year — huge! https://openai.com/...",
    "GPT-4 API now generally availible",
    "OpenAI Makes GPT-4 Generally Available"
]