[
    "Google Warns Employees: Be Careful When Using Bard",
    "Google Warns Staff Over AI Chatbot Usage",
    "Google warns Googlers to be wary about using Google Bard",
    "Google Warns Its Staff Regarding the Usage of Chatbots, Including Bard",
    "Google Tells Employees to Stay Away from Its Own Bard Chatbot",
    "Google, maker of AI chatbot Bard, warns its employees about using chatbots",
    "Google forced to delay Bard AI's EU launch over privacy concerns",
    "Google has alerted its employees about the potential risks associated with AI chatbots",
    "Google's Cautionary Tale: The Double-Edged Sword of AI Chatbots Like Bard and ChatGPT",
    "Google warns own staff about entering data into, using code from, chatbots",
    "Google Warns Staff About Chatbots",
    "U.S. government says several agencies hacked as part of broader cyberattack",
    "Multiple federal agencies hit by hack",
    "Multiple federal agencies hit in cyberattack: report",
    "US government agencies hit in global hacking spree",
    "Several U.S. Government Agencies Hacked in Cyberattack",
    "Cyberattack hits ‘several’ federal agencies, CISA confirms",
    "Cyberattack Spree Hits Federal Government",
    "US Government Agencies Breached In Global Cyber Attack Incident",
    "Global Cyberattack Hits Several US Federal Agencies",
    "US Agencies Hit in MOVEit Hacks as Victim List Grows",
    "for the record - it was cl0p. https://www.cnn.com/...",
    "Oil and gas giant Shell confirms it was impacted by Clop ransomware attacks",
    "Reports: Progress MOVEit Hacks Hit Federal Government, State Agencies, Companies",
    "Hacker gang Clop deploys extortion tactics against global companies",
    "Clop names a dozen MOVEit victims, but holds back details",
    "Clop ransomware gang starts extorting MOVEit data-theft victims",
    "Clop begins naming alleged MOVEit victims",
    "Mandiant says China-backed hackers exploited Barracuda zero-day to spy on governments",
    "Barracuda ESG zero-day attacks linked to suspected Chinese hackers",
    "Mandiant attributes Barracuda Networks malware campaign to China-linked hackers",
    "Chinese spies blamed for data-harvesting raids on Barracuda email gateways",
    "Barracuda ESG devices actively exploited in broad, ongoing espionage campaign",
    "Attacks on Barracuda Networks linked to China-backed hacking group",
    "Chinese UNC4841 Group Exploits Zero-Day Flaw in Barracuda Email Security Gateway",
    "CISA Order Highlights Persistent Risk at Network Edge",
    "Chinese spies breached hundreds of public, private networks, security firm says",
    "China Behind ‘Wide-Ranging’ Barracuda Attacks, Mandiant Says",
    "Cybersecurity and Infrastructure Security Agency CISA",
    "Barracuda Networks Releases Update to Address ESG Vulnerability",
    "Barracuda Zero-Day Attacks Attributed to Chinese Cyberespionage Group",
    "China-linked espionage actor blamed for global Barracuda ESG attacks",
    "Chinese Hackers Exploit Barracuda ESG Zero-Day",
    "Exploitation of Barracuda ESG appliances linked to Chinese spies",
    "Mandiant Says China-backed Hackers Exploited Barracuda Zero-Day To Spy on Governments",
    "Steam Update: In-game overlay, notifications, and a fresh coat of paint",
    "Steam :: Steam News :: Steam Desktop Update",
    "Steam update brings new features & Mac hardware acceleration",
    "Steam's Massive Overhaul Is Here With A Fresh Look And New Capabilities For Gamers",
    "Steam gets massive overhaul that brings updated visuals and exciting new features",
    "Steam's Big Desktop Update Out of Beta, Tons of Improvements",
    "The biggest Steam update in years just arrived. Here's what's new",
    "How to add non-Steam games on Steam Deck",
    "Valve's Steam redesign is finally here",
    "The new Steam client update looks funky, comes with new features",
    "Steam gets a huge free update on PC, and it's good news for Steam Deck too",
    "Valve refreshes the look of Steam, adds new features",
    "Steam's latest update isn't that exciting, but it does let you take notes now",
    "Steam update overhauls desktop client, brings notes and pinned windows",
    "Valve Releases Major Steam Desktop Client Update",
    "Steam just got a massive update on PC, bringing a refreshed UI and new features",
    "Steam just got a major UI overhaul",
    "Desktop Steam UI Gets a Fresh Coat of Paint, Complete With New In-Game Overlay and More",
    "Steam gets much-needed redesign: It's now more squarish and bolder",
    "Steam's Newest Update Lets You Write Notes And Pin Them To Your Game Screen",
    "Steam Update Makes Big Changes to the User Interface",
    "New Steam client update from Valve adds revamped in-game overlay, Notes and more",
    "Steam Update Looks Nice, Makes Stuff Easier",
    "Valves Roll Out Big Steam Update With UI Refresh, Redesigned In-Game Overlay & Notes",
    "Intel Announces Major Brand Update Ahead of Upcoming Meteor Lake Launch",
    "Intel is officially killing off the ‘i’ in Core i7 — as it goes Ultra",
    "Intel announces biggest processor brand update in 15 years",
    "Intel shakes up mainstream CPU branding, introduces Core Ultra line",
    "Intel's new processor branding drops the ‘i’ - and the ball",
    "Intel just admitted defeat",
    "Intel's new Core CPU branding is official: “i” is out, Ultra is in",
    "Intel Meteor Lake chips will drop the i branding and add an Ultra tier",
    "Intel drops the ‘i’ and takes on Apple with its own ‘Ultra’ chips",
    "Intel Rebrands its Processors into Intel Core, Intel Core Ultra",
    "Intel Details New Branding Changes Coming With its Meteor Lake CPUs",
    "Say bye to the ‘i’ — Intel details new Core, Core Ultra chip branding",
    "Intel is rebranding its processors starting with Meteor Lake",
    "Intel Introduces Branding Updates for Core Processors: Intel Core Ultra and Intel Core",
    "Intel Unveils New “Core” Branding For Next-Gen CPUs, First Featured on Meteor Lake",
    "Goodbye to the “i”: Intel rebrands its CPUs as Core and Core Ultra for Meteor Lake launch",
    "Intel's radical simplification of Core branding only adds to the confusion",
    "Intel's Core rebranding exercise offers a glimpse at Meteor Lake CPU specs",
    "Intel Announces First CPU Rebrand in 15 Years for Meteor Lake",
    "Intel Shakes Up Core Processor Lineup with Significant Rebranding Initiative",
    "Intel rebrands its product line ahead of Core Ultra processor launch",
    "Intel drops ‘i’ processor branding after 15 years, introduces ‘Ultra’ for higher-end chips",
    "Intel Says Bye to the ‘i’ and Hi to the ‘Ultra’",
    "Intel makes bold move with new names for its game-changing Meteor Lake processors",
    "Intel confirms ‘Ultra’ branding for Meteor Lake processors, drops ‘i’ from Core series chips",
    "Intel Announces “Biggest Brand Update” For Core CPUs",
    "Intel's new branding for Meteor Lake Core CPUs revealed",
    "Intel details new two-tier branding strategy beginning with Core Ultra “10th gen” Meteor Lake CPUs",
    "Intel Core Ultra Naming Scheme: All You Need to Know",
    "Weird way for Intel to acknowledge the end of its partnership with Apple",
    "Rolls off the tongue https://twitter.com/...",
    "They should have just brought back the pentium brand. https://www.anandtech.com/...",
    "They just made it more confusing... https://twitter.com/...",
    "Intel is officially killing off the ‘i’ in Core i5/i7/i9 - as it goes Ultra",
    "Intel To Launch New Core Processor Branding for Meteor Lake: Drop the i, Add Ultra Tier",
    "Crypto Lobbyists Ask SEC for Info on Prometheum, The Mysterious ‘Regulated’ Crypto Firm",
    "Blockchain Association wants to know more about SEC's interactions with Prometheum",
    "House testimony by crypto firm Prometheum CEO raises questions about regulation",
    "‘Who the hell’ is Prometheum and what did it say to Congress about SEC compliance?",
    "Crypto Community Unearths Questionable History of SEC-Aligned Prometheum",
    "Gary Gensler's Vision for Regulating Crypto Brokers",
    "Biggest Lie In Crypto? How SEC, US Dems Conduct A PSYOP Vs. Coinbase And Binance",
    "Crypto: Who Are Prometheum & What Did They Testify In Regard to the SEC?",
    "Crypto Community Alleges Prometheum's US SEC And FINRA Approval Is Controversial",
    "House Committee hearing talks crypto regulation",
    "Self righteous grift claiming regulatory clarity is the absolute worst https://twitter.com/...",
    "lol this prometheum bro must have the same amphetamine patch dealer as SBF https://twitter.com/...",
    "And who is running Prometheum? These guys: [image]",
    "Smells like corruption https://twitter.com/...",
    "“we were so close” [image]",
    "Good investigation. https://twitter.com/...",
    "At least they haven't lost a billion dollars of customers funds. https://twitter.com/...",
    "@kevin_hardiman@mastodon …",
    "Announcing the availability of consumer replacement components for Surface devices",
    "Microsoft Now Lets You Buy Surface Replacement Parts in Its Store",
    "Microsoft Store Now Offers Replacement Components for Surface Devices",
    "Microsoft's New DIY Approach: Surface Device Replacement Parts Now Available",
    "Microsoft dabbles in self-repair with Surface devices now DIY-friendly",
    "Microsoft now sells Surface replacement parts for DIY repairs",
    "Microsoft starts selling Surface replacement parts for DIY repairs",
    "You can now buy Surface replacement parts directly from the Microsoft Store",
    "Microsoft Store now sells replacement parts to repair Surface devices",
    "You can now buy spare parts for your Surface device directly from the Microsoft Store",
    "You can now buy Surface replacement parts in the Microsoft Store",
    "Surface repair parts are now available via Microsoft Store",
    "Microsoft Store introduces replacement components for Surface devices",
    "Microsoft is selling screens, batteries, SSDs, and more for DIY Surface repairs",
    "Microsoft Starts Selling Surface Replacement Parts - For Out of Warranty Repairs",
    "Microsoft Surface device owners can now buy replacement parts to repair them themselves",
    "@kevin_hardiman@mastodon.social",
    "Microsoft Now Sells Surface Replacement Parts, Including Displays, Batteries, and SSDs",
    "International Business Times",
    "Russia-backed hackers unleash new USB-based malware on Ukraine's military",
    "Cadet Blizzard emerges as a novel and distinct Russian threat actor",
    "Microsoft Warns of New Russian State-Sponsored Hacker Group with Destructive Intent",
    "Microsoft identifies new hacking unit within Russian military intelligence",
    "Microsoft identifies new hacking group controlled by Russian intelligence",
    "Microsoft links Cadet Blizzard APT to Russia's military intelligence GRU",
    "Ongoing Russian cyberattacks targeting Ukraine",
    "Microsoft Names Russian Threat Actor “Cadet Blizzard”",
    "Cyberattack wave in Ukraine linked to Russia's GRU, Microsoft says",
    "Novel Russian Threat Group Cadet Blizzard Is Behind Recent Wave of Attacks, Microsoft",
    "Russian APT ‘Cadet Blizzard’ Behind Ukraine Wiper Attacks",
    "Microsoft Links 2022 WhisperGate Kyiv Attacks to Russia",
    "Microsoft identifies, names new Russian-sponsored threat group",
    "Microsoft Outs New Russian APT Linked To Wiper Attacks In Ukraine",
    "Microsoft links data wiping attacks to new Russian GRU hacking group",
    "Introducing the Partner Plus Program",
    "Twitch's new partner program aims to increase creators' revenue split",
    "Twitch's new Partner Plus program offers some streamers a 70/30 revenue split",
    "Twitch will give smaller streamers a bigger cut of subscriptions",
    "Twitch Introduces 70-30 Revenue Split, But There's A Catch",
    "Twitch finally gives streamers 70/30 sub split with new Partner Plus, but there's a catch",
    "Twitch Enrages Streamers Again With Convoluted New Revenue Share Program",
    "Twitch's New Partner Program Will Finally Give Streamers A 70/30 Cut Of The Revenue Pie",
    "Twitch introduces the Partner Plus Program with a 70/30 spit.",
    "EU votes to ban AI in biometric surveillance, require disclosure from AI systems",
    "Artificial intelligence is not yet as smart as a dog, Meta A.I. chief says",
    "Generative AI still not as intelligent as a dog says Meta AI chief",
    "It's ridiculous to think AI threatens humanity, says pioneer",
    "AI ‘godfather’ says fears of existential threat are overblown",
    "Well here's some bloody welcomed common sense. https://www.bbc.com/...",
    "Megaupload coders sentenced to prison after home detention bid denied",
    "Kim Dotcom's Megaupload Coders Sentenced to Prison, Herald Says",
    "Megaupload coders avoid 10-year sentences by testifying against Kim Dotcom",
    "Former Megaupload Executives Sentenced to 2.5 Years in Prison",
    "Megaupload pair jailed for their part in Kim Dotcom's online empire",
    "Megaupload admins jailed after 11-year legal war",
    "The Guys Who Ran Piracy Site Megaupload Sentenced to 2.5 Years in Prison",
    "Megaupload sentencing: Judge asked to consider home detention but Crown wants prison",
    "Two Megaupload executives sentenced to jail",
    "New Zealand court sentences Megaupload coders to prison- report",
    "We are coming for you, Kim. https://twitter.com/...",
    "Men who helped run Megaupload sentenced to prison in New Zealand",
    "2 men who helped run popular pirating website Megaupload sentenced to prison in New Zealand",
    "Hong Kong Put Pressure on 3 Major Banks to Take On Crypto Exchanges as Clients: Report",
    "Hong Kong govt pressures banking giants to accept crypto clients: Report",
    "Hong Kong regulator urges banks to accept crypto clients",
    "Hong Kong Authorities Encourage Major Banks To Embrace Crypto Clients",
    "HSBC, Standard Chartered face pressure from Hong Kong to take on crypto clients - FT",
    "Hong Kong Monetary Authority Urges Banks To Sign Crypto Exchanges As Clients",
    "Why Hong Kong wants Bank of China, HSBC, and Standard Chartered to add crypto exchanges as clients",
    "Hong Kong urges major banks to embrace crypto exchanges as clients",
    "Hong Kong Mounts Pressure on HSBC and Standard Chartered Bank to Service Crypto Customers",
    "Hong Kong regulators push HSBC, Standard Chartered to embrace crypto clients: FT",
    "Hong Kong government pushes banks to embrace crypto",
    "Hong Kong Authorities Urge Three Major Banks to Embrace Crypto Exchanges, Reveals Report",
    "Hong Kong Monetary Authority urges banks to service crypto firms: Financial Times",
    "Hong Kong pushes HSBC and Standard Chartered to embrace crypto clients",
    "Hong Kong Urges HSBC, Standard Chartered To Support Crypto Exchanges",
    "Top Banks Reluctant to Accept Crypto Clients Despite Pressure from Hong Kong Regulators",
    "Hong Kong urges banks to accept crypto exchanges as clients",
    "Ahead of the curve. https://twitter.com/...",
    "Wow this is how you know HK is serious about becoming a crypto hub https://www.coindesk.com/...",
    "@film_girl@mastodon.social",
    "Can Apple Silicon Handle High-Level PC Games? An Interview With A ‘Resident Evil’ Developer",
    "Apple's Game Porting Toolkit's Support for DirectX 12 is a Big Deal for Gaming on the Mac",
    "We Got Diablo IV Running On A MacBook, Here's How With Apple's Game Port Toolkit",
    "‘Resident Evil’ developer: Apple Silicon Macs can handle high-level PC games",
    "Apple's Game Porting Toolkit is the first real step to fixing Mac gaming",
    "“The best thing to happen to the Mac gaming market in at least 30 years.” …",
    "Does Apple's porting toolkit change the game? ↦",
    "Uber will start showing video ads in its apps this week",
    "Uber will show ads in its apps while you wait for cars and food",
    "Get Ready For Video Ads In Uber And Uber Eats",
    "Uber will soon start playing video ads on your iPhone while waiting for your ride",
    "Uber Plans Rollout of Full-Length Video Ads Across Multiple Customer Touchpoints",
    "Me in the back of an Uber from now on. https://www.wsj.com/... [image]",
    "Sorry what? Ads while I book a ride or overpay for food? https://twitter.com/...",
    "@agreenberg@infosec.exchange",
    "US semiconductor firm sues Mattson over alleged espionage attempt",
    "Biden Applauds Ticketmaster's Plans for Fee Transparency After Taylor Swift Debacle",
    "Ticketmaster parent Live Nation, others agree to show ‘junk fees’ after Biden pressure",
    "Live Nation-Ticketmaster to disclose full ticket prices upfront",
    "Live Nation and Ticketmaster to start showing hidden ticket costs",
    "Ticketmaster, SeatGeek pledge to show all-in pricing for customers up front: White House",
    "Ticketmaster and Seat Geek to dump “junk fees” after White House pressure",
    "Ticket Giants, Under Pressure From Biden, Promise Transparency on Fees",
    "Biden praises companies for ending hidden fees",
    "Live Nation and Ticketmaster are pledging to President Biden to show fees up front",
    "Ticketmaster, SeatGeek to Show Ticket Buyers ‘All In’ Pricing That Includes Fees",
    "Biden hauls in Live Nation, Airbnb, other execs to White House amid crackdown over junk fees",
    "Ticketmaster to Announce Transparency on Fees at Biden Meeting",
    "Biden to announce Live Nation and Ticketmaster will allow consumers to see all fees up front",
    "Ticketmaster, SeatGeek agree to show ‘all-in’ prices after Biden's junk fee crackdown",
    "Ticketmaster To Offer “All-In” Pricing As Joe Biden Promotes Progress On Eliminating “Hidden Fees”",
    "Ticketmaster, SeatGeek Commit to All-In Pricing After “Junk Fees” Criticism",
    "Ticketmaster, Others Agree to All-In Pricing as White House Cracks Down on Hidden Junk Fees",
    "Comcast tells the FCC that it doesn't want to reveal its hidden broadband fees upfront",
    "Live Nation and SeatGeek will stop hiding junk fees",
    "Oh the junk fees will be there, this is just a new way to hide them",
    "This is great news. https://twitter.com/...",
    "Ticket giants promise fee transparency, under pressure from Biden https://www.nytimes.com/...",
    "‘Hey Disney’ Brings Mickey and Crew to Your Amazon Echo",
    "Amazon and Disney announce Hey Disney! launch for Echo devices",
    "‘Hey Disney!’ voice assistant is now available on US Echo devices",
    "‘Hey Disney:’ Dory and Mickey Can Now Respond to Your Kids on Amazon Echo",
    "Amazon Echo Devices Get Their First Custom Alexa-Based Assistant",
    "Amazon's ‘Hey Disney’ assistant finally arrives for U.S. Echo users",
    "Let Elsa be your new Alexa: Amazon adds ‘Hey Disney!’ voice assistant",
    "Free compensation benchmarking data from 3,000 startups",
    "@williamgunn@mastodon.social",
    "Delivering high-quality facial animation in minutes, MetaHuman Animator is now available!",
    "Epic Games launches MetaHuman Animator to capture high-quality human faces with an iPhone",
    "Blue Dot: A 3Lateral Showcase of MetaHuman Animator",
    "@Techmeme Are we all just going to ignore how much this is going to empower disinformation agents?",
    "Beware of fake security researchers who deliver malware",
    "Fake Security Researcher GitHub Repositories Deliver Malicious Implant",
    "Fake Security Researcher Accounts Pushing Malware Disguised as Zero-Day Exploits",
    "Watch out - a fake security researcher is pushing malware disguised as zero-day PoC",
    "Someone is posing as a fake security company to create malicious GitHub repositories",
    "Hackers impersonate security analysts to advertise bogus zero day exploits laced with malware",
    "Attackers set up rogue GitHub repos with malware posing as zero-day exploits",
    "Malicious Actors Exploit GitHub to Distribute Fake Exploits",
    "Fake Researcher Profiles Spread Malware through GitHub Repositories as PoC Exploits",
    "This is the fake account @TwitterSafety https://twitter.com/... [image]",
    "Nvidia's rivals struggle to gain ground in generative AI chip war",
    "Nvidia's competitors falter in AI chip war",
    "Personalized wealth management, built for tech people",
    "10 reasons why Zoho Sign is a better alternative to DocuSign",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Replit: From idea to software, fast.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "Airtable: What will you make?",
    "Adobe: Let’s create experiences that matter.",
    "PayPal: Opening opportunities for all.",
    "Character.AI: Build something smarter than you.",
    "Techmeme: You might have heard of us...",
    "Thu. 06/15 - Everbody Does Ads Now",
    "Jun 14-17Viva TechnologyParis",
    "Jun 15-16TNW ConferenceAmsterdam",
    "Jun 16-19Dreamhack SummerJonkoping, Sweden",
    "Jun 19-23Cannes LionsCannes",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Cruz, Graham, Grassley join Democrats to advance journalism antitrust bill",
    "Senate Judiciary advances journalism bargaining bill targeting Big Tech",
    "Senate Judiciary Committee Passes Journalism Competition And Preservation Act",
    "Senate Judiciary Committee Passes the Journalism Competition and Preservation Act",
    "American Economic Liberties Project",
    "Saving the News from Big Tech: The Journalism Competition and Preservation Act",
    "Alibaba aims to make Europe a top priority market, says president Michael Evans",
    "Instagram Broadcast Channels: New Features and Popular Channels in India",
    "Instagram is rolling out its Telegram-like broadcast channels worldwide",
    "Instagram Broadcast Channels Roll Out Globally: What You Need To Know",
    "Instagram's One-Way Broadcast Channels Roll Out Globally",
    "Instagram expands broadcast channels feature globally. Here's how to use it",
    "Instagram update: Zuck just announced the roll out of global Broadcast Channels [image]",
    "EU executive to block Huawei from its contracts",
    "EU countries' decision to ban Huawei, ZTE from networks justified, EU's Breton says",
    "If Huawei is banned in the EU and US, can you guess where it is developing its latest projects?",
    "Huawei denies rumors about Qualcomm resupplying 5G chips",
    "Huawei wins huge share of China Mobile's 5G base station contracts",
    "EU funds multiple Huawei projects despite European ban",
    "Logitech's Streamlabs Ultra Product Suite adds a powerful new podcast editor on PC",
    "Logitech's Streamlabs add Podcast Editor to streaming tools",
    "Streamlabs gets an AI-powered podcast editor",
    "Temu overtakes Shein in US sales amid inflation concerns",
    "Siemens to Make €2 Billion Investment to Boost High-Tech Plants",
    "Siemens presents €2 billion investment strategy to boost future growth, innovation and resilience",
    "Siemens unveils big investments in China and Singapore factories",
    "With €2B Investment, Siemens Is All-in on Industrial Metaverse & China",
    "Siemens invests $2.2b in high-tech manufacturing projects",
    "Siemens to invest $2.2 bln to ramp up global production",
    "EXCLUSIVE: LVMH Partners With Epic Games on 3D Technology for Immersive Experiences",
    "LVMH Expands Partnership With Epic Games",
    "LVMH Partners With Epic Games to Unleash Immersive Experiences",
    "LVMH Taps Epic Games to Bring New Immersive Experiences to Its Creative Pipeline",
    "Viva Tech: Why LVMH Is Partnering With Epic Games And Apple Tap To Pay",
    "TikTok to invest billions of dollars in Southeast Asia to boost e-commerce business",
    "TikTok to spend billions in SE Asia as e-commerce move pays off",
    "Ecommerce in Southeast Asia 2023",
    "TikTok rises, Alibaba's Lazada falters in ASEAN e-commerce",
    "SE Asia's e-commerce GMV hit $100b in 2022—almost half was from Shopee",
    "ByteDance Chasing WeChat in the Super-App Race With Douyin",
    "Google Made Millions From Ads for Fake Abortion Clinics",
    "Google Earned an Estimated $10.2 Million Showing Ads for Misleading Anti-Abortion Centers",
    "Google hosts, profits from fake abortion clinic ads: report",
    "Google Accepted Millions in Anti-Abortion Ad Money, Group Finds",
    "Google earns $10M from ads directing abortion seekers to pregnancy crisis center",
    "Google earned $10m from ads misdirecting abortion seekers to ‘pregnancy crisis centers’ |  Google",
    "Google earned $10m from ads misdirecting abortion seekers",
    "U.S. judge appears skeptical of Bankman-Fried's push to dismiss charges",
    "Federal Prosecutors Punt On Some Charges Against Bankman-Fried",
    "US Prosecutors Propose Separate Trial For FTX's Founder Amid New Charges",
    "Bankman-Fried Prosecutors Agree to Temporarily Withdraw Some Charges",
    "US Prosecutors Insist That SBF Trial Will Be On Original 8 Count Charge",
    "Sam Bankman-Fried FTX Trial: SBF Prosecution Date, Details in Full",
    "SBF to be prosecuted on original 8 charges",
    "Sam Bankman-Fried to face trial only on 8 initial charges",
    "US Prosecutors to Reduce Criminal Charges on FTX Founder SBF in October Trial",
    "Sam Bankman-Fried Trial Can Proceed on Original Charges Only, Says DoJ",
    "US DOJ Concedes to Try SBF on Original Charges",
    "Sam Bankman-Fried to Face Trial for Only Eight Charges: Here's Why",
    "U.S. Justice Department Agrees to Try Sam Bankman-Fried on Original Charges",
    "Bay Area woman is on a crusade to prove Yelp reviews can't be trusted",
    "AI text floods one of the most important human data sources",
    "It's too late, we poisoned MTurk https://twitter.com/...",
    "“Rechanical Turk” https://www.techmeme.com/...",
    "There goes every MTurk study... https://twitter.com/...",
    "33-46% of workers on MTurk used LLMs in a text production task"
]