[
    "Sony Made A Truckload Of Cash From Call Of Duty Players In 2021",
    "Leaked PlayStation intel reveals shocking number of Call of Duty players only play CoD",
    "Sony accidentally reveals trade secrets by using sharpie marker",
    "The Last of Us Part 2 and Horizon Forbidden West cost Sony over $200m to develop each",
    "Sharpie scanning goof reveals major PlayStation budgets and revenues",
    "Sony Accidentally Reveals Major PlayStation Game Budgets",
    "Sony accidently reveals confidential Call of Duty player and revenue data",
    "Sony accidentally reveals budgets for Horizon Forbidden West, The Last of Us Part 2",
    "Call Of Duty's Worth to PlayStation May Have Been Revealed by Sony",
    "Xbox won't make Call of Duty worse on PlayStation — here's why",
    "Call of Duty Netted Almost $1 Billion in Revenue for PlayStation in USA Alone",
    "Sony Knew Call of Duty Was a Major Revenue Driver, But Still Didn't See It as a Threat",
    "Sony's secrets: Poor redactions show first-party development costs",
    "A staggering number of PlayStation users only play Call of Duty and literally nothing else",
    "Jim Ryan Says Publishers “Unanimously” Hate Xbox Game Pass",
    "Sony just spilled confidential Playstation information because of a Sharpie",
    "Sony's PlayStation chief says publishers hate Xbox Game Pass",
    "Microsoft CEO says he wants to end Xbox exclusives but blames Sony",
    "Microsoft CEO Says Call of Duty to ‘100%’ Stay on PlayStation",
    "Microsoft CEO claims he'd ‘love to get rid of console exclusives entirely’",
    "Microsoft CEO Satya Nadella Says $75 Billion Activision Deal Won't Block Competition",
    "Microsoft, Activision CEOs expected to urge US judge to allow $69 billion merger",
    "Microsoft CEO Comments on Console Exclusivity",
    "Microsoft CEO Satya Nadella wants software company to become first class publisher in gaming",
    "Will the Biggest Tech Merger of All Time Go Through?",
    "Microsoft CEO Says He Would “Love” To Get Rid Of Xbox Exclusives But Can't Because Of Sony",
    "Microsoft's CEO Wants To Get Rid Of Console Exclusives Entirely",
    "Microsoft CEO: If It Were Up To Me, I'd Get Rid of Exclusives",
    "Microsoft CEO Wants To “Get Rid” Of Console Exclusives",
    "Bombshell PlayStation emails reveal Sony's true feelings about Xbox's Activision merger",
    "Sony provides an explanation for their decision to decline Microsoft's ‘Call of Duty’ deal",
    "Activision CEO wouldn't put Call of Duty, other titles on Xbox Game Pass",
    "Satya Nadella wants to remove all game exclusivity: ‘I have no love for that world’",
    "Sony's Deal For Call Of Duty Only Includes One More Game",
    "Activision would likely ditch Microsoft takeover if FTC pauses deal",
    "Microsoft's Lineup of Exclusive Games Draws Fire From Deal Foes",
    "Microsoft CEO heads to court to battle for $69B takeover of Activision",
    "Activision Will Be Jilted if Microsoft Deal Blocked, CEO Kotick Says",
    "WSJ News Exclusive | FTX Begins Talks on Reboot Amid Regulatory Crackdown on Crypto Exchanges",
    "FTX begins talks to relaunch international cryptocurrency exchange - WSJ",
    "FTX reboot on the way: CEO holds talks with ‘interested parties’ — Report",
    "FTT Flies 45% On Rumors Of FTX Planned Relaunch",
    "FTT jumps as much as 33% on news of potential FTX ‘reboot’",
    "FTX engages in talks to bring back international crypto exchange",
    "FTX ‘Reboot’ Talks Begin and Send FTT Token Soaring 15%",
    "Failed Crypto Exchange FTX Looks to Make a Comeback",
    "FTX Reportedly Seeking to Relaunch",
    "FTX would take the first steps to restart its operations",
    "FTX invites investors to register interest to restart rebranded exchange - report",
    "FTX Begins Talks on Rebooting Flagship International Crypto Exchange",
    "Kroll Restructuring Administration",
    "Issues With FTX's Recovery - $500 Million Anthropic Stake Sale Stops",
    "FTX Puts Sale Of $500 Million Stake In AI Firm Anthropic On Hold",
    "FTX Accuses Former Top Officer Of Helping Sam Bankman-Fried Steal Customer Funds",
    "Crypto Exchange FTX Puts a Pause on Anthropic Stake Sale",
    "FTX Suspends Sale of $500M Stake in Anthropic",
    "FTX Stops Sale of $500 Million Stake in AI Firm Anthropic: Report",
    "FTX Halts Sale of $500 Million Stake in AI Startup Anthropic",
    "FTX's $500m stake sale in AI startup delayed, hampering $2b deficit recovery",
    "FTX Freezes Sale of $500 Million Stake in AI Startup Anthropic",
    "FTX pauses sale of stake in AI firm Anthropic, once purchased for $500m",
    "FTX hits brakes on sale of $500 million stake in AI firm: Bloomberg",
    "FTX Holds Off On Selling Its Stake In AI Startup Anthropic",
    "FTX suspends $500M sale of stake in AI firm Anthropic: Report",
    "FTX Pauses Sale of $500M Stake in AI Firm Anthropic: Bloomberg",
    "International Business Times",
    "Sam Bankman-Fried fails to dismiss criminal charges related to FTX",
    "Judge denies Sam Bankman-Fried's motion to dismiss charges",
    "Judge Rejects Sam Bankman-Fried's Bid to Dismiss Criminal Charges Over FTX, Confirms Trial",
    "Sam Bankman-Fried Hits A Blank Wall As Judge Denies Motions To Dismiss Criminal Charges",
    "Judge's Decision on Sam Bankman-Fried's Motion to Dismiss Charges in FTX Case",
    "Judge rejects SBF's motions to dismiss criminal charges, citing lack of merit",
    "Judge Rules Against Sam Bankman-Fried's Motion to Dismiss Most Charges",
    "Judge Rejects SBF Motion as New FTX Fraud Details Emerge",
    "Judge says arguments behind SBF's motions to dismiss criminal charges are ‘moot or without merit’",
    "Judge Rejects FTX Founder Sam Bankman-Fried's Motions to Dismiss Criminal Charges",
    "Sam Bankman-Fried loses bid to toss criminal charges over FTX's collapse",
    "CZ and SBF taking procedural Ls in court on consecutive days. https://www.theblock.co/...",
    "Introducing Proton Pass - Protecting your passwords and online identity",
    "Proton Pass end-to-end encrypted password manager is here and free for everyone",
    "Proton's Password Manager Is Now Available for Everyone",
    "Proton Pass  —  Free and fully encrypted password manager to keep your login credentials safe.",
    "ProtonMail Developer Launches Free, Encrypted Password Manager",
    "Proton's password manager Proton Pass comes out of beta",
    "Proton Pass: Free Password Manager for iOS, Android and More",
    "Proton launches its password manager Proton Pass, now available for download",
    "Proton Pass password manager leaves beta: here is our take",
    "Proton's encrypted password manager is now available to everyone.  - The Verge",
    "Proton's new password manager has just landed for all users",
    "Save 80% Off ‘Proton Pass Plus’ Password Manager Forever! [Limited Time Deal]",
    "Proton's got a new password manager with email masking and more",
    "Proton Pass password manager launches with a deal that's just too good to pass up",
    "Proton Pass free password manager emerges from beta",
    "Proton Pass password manager is out of beta and available for free",
    "Proton Pass, the free password manager from Proton Mail, is out of beta",
    "Online Hate and Harassment: The American Experience 2023",
    "‘Dramatic increase’: Online harassment rates surge by 51% in a year, ADL report reveals",
    "‘I have over 30 threats to rape, kill, or assault me’: Being a doctor on social media",
    "Over half of Americans have faced online hate, survey finds",
    "New Report Suggests That Hate Speech via Tweet Has Increased Under Elon Musk",
    "Over half of Americans report targeted online harassment - ADL survey",
    "More than half of Americans have experienced online hate and harassment, report finds",
    "More than 50 percent of Americans report facing online harassment, hate: survey",
    "Most Americans Have Been Harassed Online: Survey",
    "@dangillmor@mastodon.social",
    "@EshuMarneedi@mastodon.social",
    "Minecraft Developer Mojang Quits Reddit Citing API Change, Protests",
    "Data suggests Reddit protests negatively affected traffic, advertiser engagement",
    "Fresh Blow To Reddit As Minecraft Makers Walk Out",
    "Reddit is telling protesting mods their communities ‘will not’ stay private",
    "@zackwhittaker@mastodon.social",
    "LetMeSpy Phone-Tracking App Hacked, Revealing User Data",
    "Ironic: LetMeSpy Spyware Hackers Were Hacked (by Hackers)",
    "This hidden spyware app was hacked revealing thousands of users' data — was it on your phone?",
    "LetMeSpy App Hacked, Sensitive Victim and User Data Leaked",
    "Mobile spyware app LetMeSpy breached",
    "This top mobile phone spying app says it has been hacked, with thousands of users at risk",
    "FuckStalkerware pt. 1 - the LetMeSpy hack",
    "Miscreants leak texts and info siphoned by Android stalkerware app LetMeSpy",
    "LetMeSpy data leak reveals users of digital stalking software",
    "Data stolen in hack of spyware provider LetMeSpy",
    "What secret phone-tracking app was recently hacked?",
    "Android Users, Beware! Major Security Breach Reported Via Stealth App",
    "LetMeSpy, a phone tracking app spying on thousands, says it was hacked",
    "LetMeSpy, a stalkerware app spying on thousands, says it was hacked",
    "Reclusive Binance co-founder Yi He speaks on SEC case",
    "Binance's Yi He sheds light on relationship with CZ, tells Bloomberg she's no Caroline Ellison",
    "🎉 Announcing Slang.ai's $20M in funding",
    "Slang.ai Raises $20M in Series A Funding Led by Homebrew",
    "Slang.ai Closes $20 Million Led By Homebrew to Empower Restaurants and Retailers with Voice AI",
    "Slang taps AI to answer phone calls for brick-and-mortar businesses",
    "Generative AI Voice Startup Slang.ai Raises $20M to Answer Phones at Restaurants and Retailers",
    "Slang.ai raises $20M to bring the power of voice AI to retailers and restaurants",
    "Micron's stock rises as CEO says memory chip market has bottomed out",
    "Can the coming AI boom help Micron outrun negative China effects?",
    "Live news: Micron upbeat on revenue prospects but warns on impact of China ban",
    "Micron Earnings May Disappoint. The Outlook Is More Important.",
    "Micron is ‘at the bottom of this deep downturn,’ but ‘China complicates the recovery plan’",
    "Chipmaker Micron beats revenue estimates on demand from booming AI",
    "@danilo.redeem-tomorrow.com",
    "DoorDash, Shifting Business Model, Will Offer Drivers Hourly Pay",
    "Introducing DoorDash's Biggest App Updates in a Decade",
    "DoorDash offers delivery workers hourly rate, but there's a catch",
    "DoorDash Adds Hourly Pay Option for Gig Economy Drivers",
    "DoorDash Introduces Hourly Minimum Wage Option for Dashers",
    "DoorDash updates to include a minimum hourly wage for drivers",
    "DoorDash introduces ‘Earn by Time’ option in select cities",
    "DoorDash Workers Can Finally Get Paid Hourly, But Only During Deliveries",
    "DoorDash will start offering couriers an hourly rate while they're fulfilling orders",
    "DoorDash introduces a slew of new features, including an ‘Earn by Time’ option for delivery people",
    "OpenAI opens first international office in London",
    "ChatGPT owner OpenAI to open first foreign office in UK",
    "OpenAI brings the competition to DeepMind's doorstep with new London office",
    "OpenAI's first global office will be in London, the company says",
    "OpenAI Picks London for 1st International Office",
    "Excited to announce OpenAI's first international expansion with a new office in London!  🇬🇧 🚀 …",
    "Announcing OpenAI London office: https://openai.com/...",
    "@kimzetter@infosec.exchange",
    "SEC notice to SolarWinds CISO and CFO roils cybersecurity industry",
    "ECB welcomes European Commission legislative proposals on digital euro and cash",
    "The case for a digital euro",
    "European Commission aims for universal acceptance with digital euro proposal",
    "Brussels unveils plans for a digital euro promising complete privacy",
    "EU proposes to establish legal framework for potential digital euro",
    "EU's plan to dominate global markets with digital euro",
    "EU could move step closer to digital euro this October, Lagarde says",
    "Digital Euro System Now Underway in Europe, EU Commission Says It 'Won't Replace Cash'",
    "Digital euro proposal from European Commission seeks universal approval",
    "Europe moves closer to creating the digital euro—but privacy fears persist",
    "ECB expresses support for European Commission's digital euro proposal",
    "Privacy fears dominate launch of digital euro plan",
    "European Commission Publishes Proposals to Preserve Cash and Create Digital Euro Framework",
    "Leaked Draft Reveals EU Commission's Plans for Digital Euro: A Closer Look at the CBDC",
    "European Union Moves Forward on CBDC, Digital Euro Framework Released",
    "EU Wants Digital Euro to Complement Cash, Not Replace It",
    "EC stresses privacy in digital euro plan",
    "EU Moves Ahead With Push to Create Digital Euro for Payments",
    "EU moves closer to launching digital euro",
    "Mairead McGuinness: EU must win people's trust for digital euro",
    "EU publishes draft bill for digital euro and cash payments",
    "EU to take one giant leap towards digital euro",
    "EU Publishes Digital Euro Bill Featuring Privacy Controls, Offline Guarantee",
    "App Spotlight: Phone and Email Verifier for Zoho CRM",
    "Visa to Acquire Core Banking Platform Pismo for $1 Billion",
    "Visa Buys Brazilian Techfin Pismo For $1 Billion",
    "Visa to Buy Brazilian Payments Provider Pismo for $1 Billion",
    "Visa Buys Brazilian Fintech Pismo for $1 Billion",
    "Visa to acquire Brazilian fintech Pismo for $1 billion in cash",
    "Smartphone Startup Nothing Raises $100 Million To Build The Apple Of Android",
    "Carl Pei's smartphone startup Nothing raises $96 million from investors for U.S. expansion",
    "Nothing Phone 2's U.S. Release Just Got One Step Closer To Reality",
    "London-based Startup Nothing Raises $96 Million in Funding Round",
    "Carl Pei's Nothing bags $96 million funding ahead of Phone (2) launch",
    "Here's the OnePlus folding phone expected for later this year",
    "Nothing Raises Something — $96M",
    "Nothing raises $96 mn to expand product and technology portfolio: Details",
    "Nothing is coming for Apple with fresh funding and the Phone 2",
    "Nothing Closes $96M Financing Round to Scale Product and Technology Portfolio",
    "Nothing closes $96 million round ahead of Nothing Phone 2 launch: Here's what we know",
    "Snowflake and Databricks are putting the data stored in their services to work",
    "Databricks reinforces commitment to truly open data lakehouses with Delta Lake 3.0",
    "Databricks Introduces New Generative AI Tools, Investing in Lakehouse AI",
    "Databricks AI Assistant Offers ‘Cemented’ Business Knowledge",
    "Databricks Unveils Lakehouse AI - A Platform For Building Generative AI Models",
    "Introducing Lakehouse Federation Capabilities in Unity Catalog",
    "Databricks adds federation, generative AI front end and development tools to its lakehouse",
    "Databricks Data + AI Summit: LakehouseIQ, Lakehouse AI and everything announced",
    "What is Delta Lake in Databricks?",
    "Leveraging Data in Snowflake and Databricks for Optimal Results",
    "Databricks Offers Data Unity Option With New Delta Lake Release",
    "Databricks continues generative AI push, launches LakehouseIQ, Lakehouse AI tools",
    "Databricks Unleashes New Tools for Gen AI in the Lakehouse",
    "Databricks Data + AI Summit 2023 Keynote Recap: LakehouseIQ, Delta Lake 3.0, and More!",
    "Snowflake, Databricks set to collide over AI",
    "Databricks Delta Lake 3.0 to counter Apache Iceberg tables",
    "Databricks rolls out AI assistant to help analyze business data",
    "Databricks builds a data mesh with the launch of Lakehouse Federation",
    "What's new with Unity Catalog at Data and AI Summit 2023",
    "Introducing LakehouseIQ: The AI-Powered Engine that Uniquely Understands Your Business",
    "Introducing Materialized Views and Streaming Tables for Databricks SQL",
    "What's New with Data Sharing and Collaboration on the Lakehouse",
    "Lakehouse AI: A Data-Centric Approach to Building Generative AI Applications",
    "Databricks' Delta Lake 3.0 bridges compatibility gaps with Apache Iceberg and Hudi",
    "Free compensation benchmarking data from 3,000 startups",
    "Personalized wealth management, built for tech people",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Lightmatter: Next-gen computing built for AI.",
    "Airtable: What will you make?",
    "Stripe: Help us build universal payments.",
    "Clear Street: Today's financial infrastructure.",
    "Figma: Make design accessible to everyone.",
    "PayPal: Opening opportunities for all.",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "Adobe: Let’s create experiences that matter.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Replit: From idea to software, fast.",
    "Techmeme: You might have heard of us...",
    "Wed. 06/28 - Who Needs A Mac Pro?",
    "Jun 26-29HYBRID: Databricks Data + AI SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Photonics To Make Celestial HBM3 Memory Fabric",
    "Celestial AI's $100M raise shines light on AI computing wall",
    "TuSimple prepares to exit US autonomous trucking market",
    "TuSimple may sell US business as it turns attention to Asia",
    "Astrix Security garners $25m Series A to enhance non-human identity security",
    "Astrix Security Raises $25M in Series A Funding",
    "Astrix Raises $25 Million to Help Enterprises Secure App-to-App Connections",
    "Astrix Security Raises $25M to Protect Nonhuman Identities",
    "Astrix Security raises $25 million to further secure non-human identities",
    "We Raised A Bunch Of Money",
    "On EQT Ventures' investment in Fly.io, a new public cloud for developers",
    "Fly.io raises $70M to help developers launch apps closer to users",
    "Fly.io Raises $70M in Series C Funding",
    "Why Some Artists Boycott Venues That Use Facial-Recognition Tech",
    "the new season of black mirror just dropped a new episode https://www.nytimes.com/...",
    "Y Combinator sees huge jump in AI-focused start-ups",
    "One-third of new Y Combinator startups focused on AI, CEO says",
    "Major League Baseball scouts use two iPhones and AI to identify player potential",
    "Baseball Scouts Use iPhones and AI to Evaluate Skills and Predict Injuries",
    "AI could help pick Major League Baseball's next big star",
    "Siemens Energy, Schneider Electric Targeted by Ransomware Group in MOVEit Attack",
    "Siemens Energy confirms data breach after MOVEit data-theft attack",
    "Extortion Group Clop's MOVEit Attacks Hit Over 130 Victims",
    "UCLA, Siemens Among Latest Victims of Relentless MOVEit Attacks",
    "Extortion Group Clop's MOVEit Attacks Hit 108 Victims",
    "Two major energy corporations added to growing MOVEit victim list",
    "UCLA, Siemens Energy latest MOVEit victims to confirm breaches",
    "Casualties keep growing in this month's mass exploitation of MOVEit 0-day",
    "Influencers Gas Up Shein After Sketchy Factory Tour: No Slave Labor Here!",
    "What Shein Influencer Backlash Can Teach Us About Taking On Opportunities",
    "How much money Instagram influencers make",
    "Shein's charm offensive is off to a rocky start",
    "Shein sent American influencers to China. Social media users are furious",
    "Shein invites influencers to China to showcase its ESG efforts, but backfires",
    "How Shein's influencer trip to a Chinese factory backfired",
    "What Are Social Media Influencers (and Why Does Everyone Want to Become One)",
    "They only invited people with zero critical thinking, eating this propaganda up! [video]",
    "You come to me, the day of my daughter's Shein influencer trip",
    "what the hell is a confidence activist [image]",
    "Roblox Trying To Describe Adult Poop Is Very Funny",
    "What Roblox wants to build next with CEO David Baszucki | Decoder",
    "The Risks of Cutting Off China",
    "Stocks Making the Biggest Moves Midday: Pinterest, Carnival, General Mills, Netflix and More",
    "China's AI firms might further lose chip access in new US ban",
    "These Stocks Are Moving the Most Today: Nvidia, AMD, AeroVironment, Micron, and More",
    "European Markets Expected to Open Higher After Tentatively Breaking Losing Streak",
    "US to impose new regulations limiting AI chip exports to China: report",
    "This is obviously why we need to build Skynet first. https://twitter.com/...",
    "ChatGPT can now access the internet on mobile. Here's how",
    "ChatGPT on iOS now comes with Bing built-in",
    "ChatGPT for iOS app shipped with Bing integration",
    "ChatGPT iOS App Adds Microsoft Bing Integration",
    "ChatGPT Gains Bing Support On iOS But You'll Have To Pay For It",
    "ChatGPT Plus Subscribers Can Now Surf the Web Via Bing",
    "ChatGPT app on iOS now allows users to access information from the web: Here's how to use it",
    "ChatGPT is adding Bing access on iPhone, but only if you pay up",
    "ChatGPT for iOS can now use Bing for AI results - but only if you pay",
    "ChatGPT iOS app now supports “Browse with Bing” feature",
    "ChatGPT iOS app gets Bing integration to access data beyond its cutoff date",
    "ChatGPT on iOS adds support for Bing, but locks it behind a subscription",
    "OpenAI's ChatGPT iOS app can now browse the web",
    "ChatGPT's iPhone app now has Bing built-in",
    "ChatGPT for iOS now lets paid subscribers use Bing right from the app",
    "Apple Glasses won't face competition from Google Iris smart glasses",
    "Google reportedly gives up on making AR glasses—for the third time",
    "Google Has Reportedly Killed its ‘Iris’ AR Glasses Project",
    "Google Kills ‘Project Iris’ Augmented Reality Glasses Project",
    "Google reportedly ends ‘Iris’ augmented reality glasses project",
    "Google Abandons Augmented Reality Glasses Project Iris to Focus on AR Software",
    "Apple Vision Pro is so good, Google trashed its next-gen Iris Glasses",
    "Google reportedly cans AR glasses hardware project",
    "Google canceled its Apple Vision Pro rival that might have been even better",
    "Iris is the latest Google AR/VR project headed for the graveyard",
    "Google ditching its plan to make AR glasses really doesn't matter: here's why",
    "Google kills off its Apple Vision Pro competitor",
    "Google has apparently killed its AR glasses - and that's good news for Apple",
    "Google's “Project Iris” goes to the graveyard",
    "Google won't be rivalling Apple Vision Pro as it scraps plans for Iris AR glasses",
    "Google refocuses AR strategy after ‘Iris’ shutdown",
    "Google killed its AR glasses to work on AR devices from Samsung, others",
    "Google shuts down its AR headset Project Iris: Here's what it plans to do next",
    "Vote now: Google kills off its AR glasses (again). Is this the right decision?",
    "Google is no longer building its own augmented reality glasses",
    "Report: Google canceled its AR Glasses hardware early this year",
    "Google's next-gen AR glasses join the Google graveyard",
    "Google building Android XR software, killed Iris AR glasses: Report",
    "Google has reportedly killed its Project Iris augmented reality glasses",
    "Looks like Google might have canceled its new AR glasses",
    "Google reportedly killed its AR glasses project",
    "[Rumor] Google Reportedly Killed Its AR Glasses Project",
    "TikTok Bankrolls Influencers' Lawsuit Against Montana Ban",
    "More Ways for Creators to Collaborate with Brands: TikTok Creative Challenge",
    "Advertisers win with TikTok's Creative Challenge—but creators' gains uncertain",
    "TikTok's “Creative Challenge” pays creators to produce video ads",
    "TikTok funds lawsuit by Montana users challenging statewide ban",
    "TikTok invites creators to make ads for marketers in new pilot",
    "TikTok updates: Creative Challenge, Youth Council, Montana lawsuit...",
    "TikTok connects brands to user-generated ads with new feature",
    "TikTok Is Funding Its Users' Suit Against Montana Ban",
    "TikTok launches ‘Creative Challenge’ to provide more opportunities for creators",
    "TikTok rolled out a new way for creators to make money - but there's a catch",
    "TikTok's new ‘Creative Challenge’ ad program is good for brands but terrible for creators",
    "TikTok's new feature asks creators to make branded videos for a chance at ad money",
    "Instagram and Messenger Give Parents More Control: All the New Tools",
    "Instagram tests feature to block explicit images in direct message requests",
    "Instagram Provides Key Ad Creative Tips [Infographic]",
    "Instagram might make it harder for you to send an unsolicited dick pic",
    "Giving Teens and Parents More Ways to Manage Their Time on Our Apps",
    "Instagram and Messenger get more parental supervision tools",
    "Meta adds parental supervision tools to Facebook, Instagram",
    "Meta Announces New Features for Parental Control on Facebook, Instagram, Messenger",
    "Both TikTok and Meta introduce new parental controls",
    "Meta Rolls Out New Parental Supervision Tools Across Instagram, Facebook And Messenger",
    "New Supervision Tools  —  We want to make sure our apps are as supportive as possible for teens …",
    "Meta rolls out expansive new parental controls for Instagram and Messenger",
    "Meta is making it easier to manage your kids' Instagram and Messenger addictions",
    "Facebook Messenger launches “parental control” mode",
    "Messenger and Instagram get new tools for parental control",
    "Meta Introduces Parental Supervision Tools for Messenger",
    "What to Know About Meta's New Parental Supervision Tools for Instagram",
    "Meta beefs up protections for teens on Messenger and Instagram, as new laws loom",
    "Vital new parental controls are rolling out on Facebook, Instagram, and Messenger",
    "Meta Adds Parental Control Tools to Instagram and Facebook Messenger",
    "Meta Launches New Parental Controls on Messenger and Instagram",
    "Parents Gaining More Control Over How Teens Use Messenger and Instagram",
    "Meta announces several new privacy features, supervision tools for teens and parents",
    "Meta rolls-out new parental controls for Facebook, Instagram",
    "Meta introduces new parental control across Instagram, Facebook, Messenger",
    "Facebook and Instagram with new parental tools to enhance teen safety",
    "Meta launches parental controls for Messenger. Here's how to use them.",
    "Facebook Messenger parental controls expanded to teens; new TikTok half-measure"
]