[
    "The White House on YouTube",
    "Schumer to call for AI regulation in keynote address",
    "Biden meets with tech company critics on AI",
    "Biden meets with AI experts on managing risks",
    "US must manage AI risks to society and national security, Biden says",
    "The Hill's Morning Report — Trump: Double standard in Hunter Biden plea deal",
    "Biden says there is need to address security, economic risks posed by AI",
    "Biden staff are meeting regularly to develop AI strategy, White House says",
    "President Biden's Vision for AI: Seizing Opportunities and Managing Risks",
    "President Biden Participates in a Meeting on Artificial Intelligence with Civil Society Leaders",
    "President Biden wraps up Bay Area visit",
    "Biden to discuss dangers of AI in San Francisco meeting with experts",
    "In San Francisco, Biden says AI has 'enormous promise but comes with risks",
    "Biden to meet with A.I. experts in San Francisco",
    "President Biden Gathers Experts in San Francisco to Discuss Responsible AI",
    "Biden meeting with technology leaders, academics on AI regulation",
    "How the White House is moving into the action phase of its effort to regulate AI",
    "Biden Says He's ‘Very Proud’ of Son Hunter After Plea Deal",
    "This is so important. I hope we get a strong readout of the discussion. https://twitter.com/...",
    "Honored to meet with President Biden. https://thehill.com/...",
    "Important person for Biden to meet on AI issues. https://twitter.com/...",
    "Europe, US urged to investigate the type of AI that powers systems like ChatGPT",
    "Consumer group calls on EU to urgently investigate ‘the risks of generative AI’",
    "EU consumer group calls for ‘urgent investigations’ of generative AI risks",
    "EU watchdogs demand Action: investigating the risks of AI chatbot algorithms",
    "EU consumer protection groups urge governments to investigate AI",
    "A nuanced and well-researched piece on AI x-risk: https://www.technologyreview.com/ ...",
    "The Download: China's counterfeit lawsuits, and Apple's accessibility failure",
    "Life in the trenches labeling AI data. https://www.theverge.com/...",
    "@alastairmrushworth@fosstodon.org",
    "A big round of applause to the king @joshdzieza for this one https://nymag.com/...",
    "Really good piece on where the HF part of RLHF comes from https://nymag.com/...",
    "Reddit API backlash continues, with moderators demonetizing subreddits",
    "Thousands of Reddit Communities Stay Dark as App Policy Protest Continues",
    "Popular subreddits welcomed porn content to protest Reddit's API changes",
    "Reddit Is Removing Mods Over NSFW Protests",
    "What we're learning from the Reddit blackout",
    "Reddit communities adopt alternative forms of protest as the company threats action on moderators",
    "Uhhhh, What the fuck is happening at /mildlyinteresting???",
    "Reddit starts removing moderators who changed subreddits to NSFW, behind the latest protests",
    "Removed from /r/searchandrescue, which was public, in retaliation for other subs being private.",
    "Reddit is bringing in scabs to replace mods",
    "Reddit starts removing moderators behind the latest protests",
    "Masayoshi Son is back and it's beautiful",
    "SoftBank's Son Goes Back on Offense to Cement His Tech Legacy",
    "SoftBank to shift from ‘defense mode’ to ‘offense mode,’ says CEO Masayoshi Son",
    "SoftBank's Masayoshi Son Had His Cry. Now He's in Love Again—With ChatGPT.",
    "Masayoshi Son launches ‘offensive’ on tech startups, boosts AI focus",
    "Oh my. How much of Nvda msft do they buy https://twitter.com/...",
    "Looking forward to the accompanying SoftBank slides https://twitter.com/... [image]",
    "SoftBank after their last $32B loss: https://twitter.com/... [image]",
    "Now just need Cathie Comeback magazine cover and All Clear Echo is a wrap. https://twitter.com/...",
    "Elon Musk bans the word “cis” on twitter",
    "Elon Musk Says ‘Cisgender’ Now Considered A Slur On Twitter",
    "MODS MODS MODS BAN HIM [image]",
    "@mysteriouskat Call yourself anything you want",
    "How it started, how it's going https://twitter.com/... [image]",
    "As a cis person, I hereby give all trans people the cis-word pass https://twitter.com/...",
    "Server Subscriptions Just Got Super Powered: Introducing Media Channels, Tier Templates and more!",
    "Discord expanding monetisation options with Media Channels",
    "Discord just ramped up monetization again with new subscription tiers",
    "Discord adds ‘Media Channels’ and tests ‘Server Shop’ feature",
    "Empowering our Creative Leaders to Drive Growth",
    "EA Sports and EA Games Are Splitting Up",
    "Electronic Arts Restructures, Names New Head of Entertainment",
    "EA King Solomons itself and, weirdly for a games publisher, EA Games no longer exists",
    "EA restructures its studios and divisions to start two separate organisations",
    "Electronic Arts restructures studios into EA Entertainment and EA Sports",
    "EA announces major restructure, splits EA Entertainment and EA Sports",
    "EA Is Splitting Into Two Separate Organisations",
    "Electronic Arts Restructures Its Studios Into Two Organisations",
    "EA Games to Become EA Entertainment in Major Corporate Reshuffle",
    "EA Games Changes Name After Massive Restructuring",
    "Electronic Arts is realigning studios into EA Sports and EA Entertainment",
    "EA Games And EA Sports Are Splitting In Two To “Empower” Creative Teams",
    "EA Games becomes EA Entertainment, splits from EA Sports in restructuring",
    "EA Games splits with EA Sports and becomes EA Entertainment",
    "EA Implements Reorganization, Divides into EA Entertainment and EA Sports",
    "EA realigns into EA Sports and EA Entertainment divisions",
    "Electronic Arts is restructuring its studios into two organisations",
    "EA splits into EA Entertainment and EA Sports",
    "Electronic Arts Is Changing Its Game Studio Structure Into EA Entertainment And EA Sports",
    "Electronic Arts Shake-Up: New CFO and Studio Reorganization",
    "EA splits Sports and Games in major organization shakeup",
    "Electronic Arts is Splitting into EA Entertainment and EA Sports",
    "EA undergoes C-suite and division restructure",
    "EA Sports and EA Games Splitting Apart in Internal Shakeup",
    "EA Sports and EA Games Splitting Apart in Internal Shakeup - IGN",
    "Introducing Content Classification Labels",
    "Twitch replaces its mature content mode with more granular ‘labels’",
    "Twitch introduces new content classification labels",
    "Twitch introduces new labels to classify mature content",
    "Twitch adds new labels for streams with mature content",
    "What is Kick, and how does it compare to Twitch?",
    "Twitch streamer catches live purse-snatching outside Gucci store in Paris",
    "Twitch introduces content classification labels",
    "Content Classification Labels",
    "Amazon Prime Day is back July 11-12! Here are 5 shopping tips to help you prepare.",
    "The Morning After: Amazon Prime Day kicks off July 11th",
    "Best Prime Day AirPods deals 2023",
    "Amazon Prime Day is July 11 & 12 — with new invitation deals",
    "The best Amazon Prime Day deals",
    "Amazon Prime Day is officially coming July 11-12, but the deals actually start right now",
    "Amazon Announces 2023 Prime Day Dates",
    "Best Prime Day 2023 iPhone deals",
    "Amazon Prime Day 2023 - When Is It And What Xbox Deals Can We Expect?",
    "Amazon officially announces Prime Day 2023 for July 11 and 12",
    "Will iPhones be cheaper on Prime Day 2023? Our prediction",
    "Amazon Prime Day 2023 Announced: 48-Hour Sale Kicks Off July 11",
    "Amazon Prime Day dates are here!",
    "Amazon locks in official dates for Prime Day 2023",
    "Amazon Prime Day 2023 will take place on July 11th and 12th",
    "Prime Day 2023 start date is July 11 — here are the first confirmed deals",
    "Amazon Prime Day kicks off July 11th this year",
    "Amazon Prime Day 2023 Dates Officially Announced",
    "Amazon will hold its Prime Day shopping event on July 11-12",
    "Amazon Prime Day 2023 starts July 11 — here's what to expect",
    "When is Amazon Prime Day in 2023?  —  Amazon has announced the dates for Prime Day 2023 …",
    "Amazon Prime Day 2023: July 11 & 12 locked in for the huge sale",
    "Amazon Announces Prime Day 2023 Dates With Fire TV & Cord Cutting Deals",
    "FTC Preliminary Injunction Trial Calls For Industry Heads, Mostly From MS, To Testify",
    "Xbox Activision deal allegedly aimed to put PlayStation out of business",
    "Microsoft is rallying its executives to defend Activision Blizzard acquisition in the US",
    "Major FTC Hearing Begins This Week With Microsoft & Activision CEOs In Attendance",
    "Microsoft, Activision CEOs to Defend $69 Billion Deal in Fight With FTC",
    "Microsoft, Activision CEOs on witness list for hearing on FTC bid to block merger",
    "Microsoft CEO Satya Nadella and many Xbox executives are set to defend its FTC case",
    "International Business Times",
    "A message from the CEO  —  Anthony Tan, Group CEO and Co-Founder",
    "Grab cuts around 1,000 jobs in biggest round of layoffs since the pandemic",
    "Singapore's Grab Plans Biggest Round of Job Cuts Since Pandemic",
    "Making sense of Grab's surprising U-turn from ‘no layoffs’ stance",
    "Singaporean superapp Grab delivers massive job cuts with after hours email",
    "Grab cuts 1,000 jobs, its biggest round of layoffs since the pandemic",
    "Tech Layoffs: Grab Cuts 1,000 Jobs; Olx Group Sacks 800 Employees, Closes Some Operations",
    "Singapore ride-hailing firm Grab slashes 1000 jobs in biggest layoff since pandemic",
    "Singapore's Grab cuts 1,000 jobs in first layoffs since 2020",
    "Singapore tech giant Grab to lay off over 1,000 employees",
    "Grab Prepares for Layoffs Amid Slowing Growth",
    "YouTube to launch its first official shopping channel in South Korea -Yonhap",
    "How to unsubscribe to a YouTube channel",
    "YouTube to debut live shopping channel in South Korea",
    "YouTube To Launch Its First Official Shopping Channel In South Korea 1",
    "The government is helping Big Telecom squeeze out city-run broadband",
    "Bernie Sanders Opens Investigation Into ‘Dangerous and Illegal’ Amazon Warehouse Conditions",
    "Bernie Sanders launches Senate investigation into Amazon labor practices",
    "Are Amazon warehouses safe? US Senator Bernie Sanders launches a probe",
    "US Senate is the latest to look into Amazon's warehouse safety practices",
    "Bernie Sanders announces investigation into Amazon's safety record",
    "Bernie Sanders Launches Senate Probe Into Amazon Workplace Safety",
    "Bernie Sanders launches investigation into working conditions at Amazon",
    "Amazon faces Senate probe over warehouse safety",
    "Intel soaks up Europe's chip anxieties and subsidies by the billions",
    "Chipmakers' plans for factories in Europe, US and Asia",
    "Intel spends $48 billion in Germany in landmark expansion",
    "Alibaba's Jack Ma and Joe Tsai show up at offices in Hangzhou amid restructuring",
    "Cloud unit spinoff approaches ‘crucial stage’: Alibaba CEO",
    "Alibaba Restructure Sees Zhang Replaced as CEO; EU to Probe Adobe-Figma Deal",
    "Alibaba's crypto-friendly transition: Joseph Tsai takes the helm as chairman",
    "Tech giant Alibaba names new CEO and chairman amid China's economic slowdown",
    "Alibaba CEO Daniel Zhang Steps Down, Eddie Wu and Joseph Tsai Step up",
    "Crypto Proponent Joseph Tsai Becomes the New Chairman of Alibaba",
    "Alibaba Names Crypto-Friendly Joseph Tsai as New Chairman",
    "Crypto enthusiast Tsai to steer Alibaba",
    "Alibaba's Crypto Friendly Joseph Tsai Set to Become Chairman",
    "Alibaba's New Chairman ‘Likes’ Crypto",
    "Crypto curious Joseph Tsai to take over as chair at Alibaba",
    "Alibaba Shakeup Brings Pro-Crypto Brooklyn Nets Owner to Top of China's Tech Giant",
    "Alibaba names new chairman and CEO in major shakeup",
    "Alibaba names new chairman and CEO in surprise shake-up",
    "Alibaba Says Chairman and CEO Daniel Zhang Will Be Replaced",
    "Alibaba appoints Joseph Tsai as chairman and Eddie Wu as CEO in management change",
    "Ant Group confirms it is working on own AI large language model",
    "17 Best ChatGPT Plugins You Can Use Right Now",
    "Ant Group to develop AI model for ChatGPT-like services",
    "Black Mirror season 6 is a hit on Netflix, but it's not the breakout TV show of the week",
    "Action-thriller series Bloodhounds gains explosive popularity on Netflix",
    "The 10 most-watched movies of all time on Netflix",
    "Netflix Updates Top 10 Charts to Include Estimated Viewers in Addition to Hours Viewed",
    "Free compensation benchmarking data from 3,000 startups",
    "DeepMind Co-Founder Wants the ‘New Turing Test’ to Be Based on How Good an AI Is at Getting Rich",
    "Deepmind founder proposes a new kind of Turing test: making money online",
    "Cannes Briefing: TikTok, Netflix, others expand presence at Cannes",
    "Apple machine learning chief is the new CEO of Allen Institute for AI",
    "Apple's machine learning head departs to run AI thinktank",
    "Allen Institute for Artificial Intelligence (AI2) Announces New CEO",
    "Apple vet to return to Allen Institute for AI as CEO",
    "Apple's ‘next-gen machine learning’ leader departs for AI non-profit",
    "Apple Machine Learning Head Departs to Become CEO of the AI2 Research Institute",
    "Personalized wealth management, built for tech people",
    "Data-driven customer experience on a unified platform",
    "Free Figma template of onboarding & activation designs",
    "Google: Bring questions. Build answers.",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Replit: From idea to software, fast.",
    "Airtable: What will you make?",
    "PayPal: Opening opportunities for all.",
    "Adobe: Let’s create experiences that matter.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "Clear Street: Today's financial infrastructure.",
    "Techmeme: You might have heard of us...",
    "Tue. 06/20 - Spotify To Go \"Supremium\"",
    "Jun 19-23Cannes LionsCannes",
    "Jun 20-22HPE DiscoverLas Vegas",
    "Jun 21-22HYBRID: ConfigSan Francisco",
    "Jun 22HYBRID: Bloomberg Technology SummitSan Francisco",
    "Jun 26-29Snowflake SummitLas Vegas",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 5-10HYBRID: Black Hat USALas Vegas",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: Dreamforce REGISTER NOWSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Oct 16-18WSJ Tech LiveLaguna Beach, CA",
    "Embracer Group Paid $396M For ‘Lord Of The Rings’ Rights",
    "Embracer Group Paid $395 million for ‘Lord of the Rings’ Rights",
    "Payments provider Volt scores £47m Series B round",
    "Real-time payments infrastructure provider Volt recharges with another $60 million",
    "Volt raises $60m Series B round led by Silicon Valley investor IVP",
    "Instagram finally lets users download Reels",
    "This is how much Samsung Galaxy Watch 6, Watch 6 Classic might cost..",
    "Instagram reels can now be downloaded on your device, says IG head",
    "Instagram now lets users download Reels, but Indian users can not download it yet!",
    "Instagram now lets you download Reels from public accounts",
    "Now you can officially download Reels from the Instagram app",
    "Instagram now lets some users download Reels, here is how",
    "Crib raises seed round from founders of Paytm, CRED, Mamaearth, and others",
    "San Francisco Business Journal",
    "A mining tech unicorn: KoBold's $195M round",
    "Bill Gates-backed Berkeley metal mining startup KoBold doubles funding",
    "Mining Startup KoBold Metals Hits Unicorn Status After $195M Raise",
    "The top of AI hysteria can't be far away if this is happening https://twitter.com/...",
    "Twitter workers sue over unpaid bonuses they were promised",
    "Easily Replaceable Smartphone Batteries Could Make A Comeback",
    "EU could force Apple to make iPhone batteries replaceable — what you need to know",
    "Apple braces for change as EU demands easy battery replacement for smartphones",
    "Future iPhones might have an easily replaceable battery due to new EU law",
    "It's a bad idea for the EU to force Apple into making iPhone batteries easily replaceable",
    "New European Union law requires smartphones, laptops to have easily replaceable batteries",
    "EU wants “readily removable” batteries in devices soon—but what does that mean?",
    "Pick a voice, any voice: Voicemod unleashes “AI Humans” collection of real-time AI voice changers",
    "The AI voice-generating platform that shocked the world is getting an update to fight abuse",
    "ElevenLabs Raises $19M in Series A Funding",
    "Now hear this: Voice cloning AI startup ElevenLabs nabs $19M from a16z and other heavy hitters",
    "Synthetic voice AI firm ElevenLabs raises $19M along with a new detection tool",
    "ElevenLabs' Powerful New AI Tool Lets You Make a Full Audiobook in Minutes",
    "Real estate investment and property management platform Picket lands $20M",
    "Generative AI Speech Startup ElevenLabs Raises $19M and Releases Deepfake Voice Detector",
    "Credo Ventures joins €17.3M round for ElevenLabs, voice technology research company",
    "Andreessen Horowitz co-leads £15m ElevenLabs Series A",
    "Quotient to Combine with Neptune Retail Solutions",
    "Quotient Technology Gets Buyout Offer From Neptune Retail Solutions",
    "Neptune Retail to buy Coupons.com parent company for $430 million in cash",
    "Spotify Desktop App Updated With Redesigned ‘Your Library’ and ‘Now Playing’ Views",
    "Spotify overhauls design of its desktop app",
    "Trevor Noah Signs With Spotify for Weekly Podcast Series (EXCLUSIVE)",
    "You can now use Spotify's new design on your Galaxy Book",
    "Spotify's desktop app gets new sections to show what's playing and what's in your library",
    "Prince Harry and Meghan Markle cut ties with Spotify.  So why are they facing backlash?",
    "Spotify's got a new desktop app, but it won't make me switch from Apple Music",
    "Spotify Desktop app gets a new look and upgraded library features",
    "Spotify updates Mac app with Your Library, Now Playing changes",
    "Spotify on desktop is about to look very different - here are the two big changes",
    "Spotify Launches Redesigned Desktop Experience",
    "Spotify's Bitter Break With Royals Also Ends Exclusive Podcast Deals Era",
    "Spotify launches new desktop experience for Mac and PC with three-column UI",
    "Spotify desktop app gets a brand-new look",
    "Spotify for Desktop Gets UI Makeover",
    "Trevor Noah to launch original Spotify podcast",
    "Trevor Noah To Make Weekly Spotify Podcast",
    "Trevor Noah to host new podcast on Spotify",
    "Spotify launching weekly podcast with Trevor Noah",
    "The federal government has a new cyber player",
    "DOJ establishes cybercrime enforcement unit as U.S. warnings mount over Chinese hacking",
    "Justice Department expands cybersecurity efforts with new NatSec Cyber",
    "DOJ launches cyber unit with national security focus as China, Russia threats mount",
    "Justice Department adds new cyber-threat focused litigating section",
    "DOJ launches new cyber unit targeting nat'l security threats",
    "Render's $50 Million Series B",
    "DevOps platform-as-a-service startup Render raises $50M",
    "Render ushers in a modern age of application development in the cloud",
    "Render Raises $50M in Series B Funding",
    "Best Cryptocurrency To Buy Now - June 2023 Top 5",
    "Render Raises $50M Series B",
    "Rose Rocket Raises $38M USD in Series B Funding",
    "Rose Rocket raises $50.2 million CAD Series B to expand trucking solution",
    "Rose Rocket raises $38M for its transportation management system",
    "Rose Rocket closes $38M Series B to expand into enterprise fleet solutions",
    "Introducing Experiences for People 17 and Older",
    "Roblox is introducing “experiences” for people aged 17+",
    "Roblox is starting to allow 17+ rated experiences with ‘violence, blood or crude humour’",
    "Roblox invites its community to build mature experiences for 17+ users",
    "Roblox will allow exclusive experiences for people 17 and over",
    "Roblox to Officially Allow 17+ Restricted Content on Its Gaming Platform",
    "Roblox now allows creators to build content for people 17 and older",
    "Roblox is adding content for its growing adult user base",
    "How to share passwords with family & friends in iOS 17",
    "Phasing Out Passwords: Apple To Automatically Assign Each User a Passkey",
    "Apple Introduces easy sign-in with Face ID and Touch ID for Apple ID accounts. All details here",
    "iOS 17, iPadOS 17, macOS Sonoma add Passkey support for Apple ID",
    "Apple ID on web offers passkeys support with iOS 17, iPadOS 17; boosts security [details]",
    "Thanks to iOS 17 and macOS Sonoma, I'll never have to remember my Apple ID password again",
    "iOS 17 and macOS Sonoma Add Passkey Support to Your Apple ID",
    "Apple iOS / iPadOS 17 and macOS Sonoma start enabling Passkey support",
    "Apple Passkeys in More Websites For iPhones and MacBooks Enabled",
    "iOS 17 will support Apple passkeys at launch and you can try them out today",
    "Apple IDs now support passkeys — if you're on the iOS 17 or macOS Sonoma betas",
    "Apple adds passkeys to Apple ID, iCloud logins",
    "Apple websites start implementing passkeys in place of passwords",
    "The apple.com website adds passkey support, but there's a catch",
    "Is this what we're calling it? “Sign in with iPhone”? 🤔 https://9to5mac.com/...",
    "@s_carruthtx When you click sign in with iPhone, you get this popup which says iOS 16 [image]",
    "‘Sign in with iPhone’ passkey support comes to Apple․com"
]