[
    "Europe pitches ‘AI Pact’ to curtail the booming tech's risks",
    "Sam Altman's threat to quit EU is met with criticism from lawmakers",
    "Sam Altman Says OpenAI Will Not Leave Europe",
    "OpenAI's Sam Altman Promises His Company Won't Leave the EU, Actually",
    "OpenAI CEO Altman ‘Blackmails’ EU Over AI Regulation",
    "Tech lords threatening to pull services should stop crying wolf",
    "OpenAI's Sam Altman charmed lawmakers in DC. In Europe, it's a different story",
    "OpenAI's Sam Altman downplays fears ChatGPT maker could leave Europe over AI rules",
    "OpenAI's Sam Altman makes U-turn, says ‘no plans of leaving Europe’",
    "OpenAI CEO Sam Altman Says the Company May Remove ChatGPT from Europe Then Backtracks",
    "OpenAI has ‘no plans to leave’ Europe due to regulations, CEO says",
    "OpenAI's Sam Altman reverses threat to cease European operations",
    "ChatGPT-maker U-turns on threat to leave EU over AI law",
    "OpenAI Considers Withdrawing from Europe Amid Regulatory Pressure",
    "OpenAI CEO Reverses Threat to Leave Europe Due to Regulations",
    "OpenAI says it's not going to leave Europe",
    "ChatGPT Could be Pulled from Europe, OpenAI CEO Warns",
    "Sam Altman's big European tour",
    "Sam Altman reverses threat to ‘leave Europe’ over AI regulations",
    "No plans to leave Europe: OpenAI CEO Sam Altman",
    "OpenAI says it could ‘cease operating’ in the EU if it can't comply with future regulation",
    "ChatGPT Could Leave Europe, OpenAI CEO Warns, Days After Urging U.S. Congress For AI Regulations",
    "OpenAI chief Sam Altman accused of ‘blackmail’ in EU dispute",
    "Methinks the lad doth protest too much https://twitter.com/...",
    "When life comes at you fast! https://twitter.com/...",
    "OpenAI offers US$100,000 grants for ideas on AI governance",
    "OpenAI launches grant for AI democratic governance project",
    "OpenAI unveils $1 Million grant program to revolutionize AI governance",
    "OpenAI offers $100,000 grants to develop AI governance frameworks",
    "OpenAI offers grants for democratic experiments in AI system rules",
    "DAO and discord should handle it, no? 😉 https://twitter.com/...",
    "Office of Attorney General …",
    "Office of the Arizona Attorney General",
    "48 states sue phone company that allegedly catered to needs of robocallers",
    "Company Behind Billions of Robocalls Is Being Sued by Nearly Every State",
    "Nearly 50 state AGs sue company that allegedly facilitated billions of spam calls",
    "Office of Attorney General for the District …",
    "AG Schwalb Sues Avid Telecom Over Illegal Robocalls",
    "Case 4:23-cv-00233-EJM  —  INTRODUCTION 19.  Every day, millions of American consumers receive …",
    "Company responsible for 7.5 billion robocalls sued by nearly every Attorney General",
    "Maryland sues Avid Telecom over alleged robocall scheme",
    "Company Allowing Billions of Robocalls to Your Phones Gets Sued by 48 US States",
    "New Jersey Office of Attorney General",
    "Firm Hit With Robocalls Suit: ‘Americans Are Sick and Tired’",
    "There is a New Plan to Stop Robocalls",
    "Robocalls are out of control but this could change things",
    "Just one company is allegedly responsible for 7.5 billion nuisance calls",
    "DeSantis' Twitter launch disaster shows Musk's platform isn't ready for prime time",
    "A top Twitter engineering boss says he quit the day of Ron DeSantis' botched campaign launch",
    "The GOP girlies are fighting",
    "Platformer: 'Inside Twitter's Failed Space Launch'",
    "DeSantis's Twitter Event Falls Short of the Reach of Past Livestreams",
    "How did announcing a presidential campaign ‘melt the Internet’?",
    "Twitter's Spaces team now has “roughly three” people.",
    "Silicon Valley Business Journal",
    "5 questions for Ampere CEO Renee James",
    "What Factors Contributed to Nvidia's Astonishing Rise as Top-Tier Global Corporation?",
    "Riding on AI wave, Nvidia inches closer to trillion-dollar market cap",
    "Azure Linux released at Build - where Microsoft revealed why it did not fork Fedora",
    "Introducing the Azure Linux container host for AKS",
    "Twitter set to exit EU Code of Practice on Disinformation, sources say",
    "Twitter to pull back from Europe's disinformation crusade",
    "Twitter likely to quit EU code against disinformation, EU official says",
    "Twitter Withdraws From EU Disinformation Code, Commissioner Says",
    "Twitter leaves EU's voluntary pact on fighting disinformation",
    "Twitter withdraws from EU disinformation code ahead of landmark new rules",
    "Twitter cannot hide from EU rules after exit from code, EU's Breton says",
    "Musk's Twitter Ditches EU Code of Practice on Disinformation",
    "Update Regarding Shipment Zero",
    "Personalized wealth management, built for tech people",
    "United States District Court, Northern District of California",
    "Google Hit With $32.5M Verdict In Sonos Speaker Patent Fight",
    "US jury says Google owes Sonos $32.5 million in smart-speaker patent case",
    "Google fined $32.5 million for infringing on Sonos patent",
    "Also looks like multi-room audio really isn't a primary use case for Google speakers.",
    "Sekoia.io Raises €35M in Series A Financing",
    "Cybersecurity firm Sekoia.io secures €35m in fresh funding",
    "Sastrify, the platform for managing SaaS Subscriptions raises $32m",
    "Streamlining SaaS usage: Sastrify raises $32M to transform procurement process",
    "German SaaS platform Sastrify raises Series B",
    "Sastrify Raises $32 Million to Tackle ‘SaaS Sprawl’",
    "SaaS tool procurement platform Sastrify raises $32 million",
    "Germany's Sastrify raises €29.6M in Series B funding led by Amsterdam-based Endeit Capital",
    "Free compensation benchmarking data from 3,000 startups",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "Replit: From idea to software, fast.",
    "Figma: Make design accessible to everyone.",
    "Fathom: The leader in medical coding automation.",
    "Character.AI: Build something smarter than you.",
    "Stripe: Help us build universal payments.",
    "Adobe: Let’s create experiences that matter.",
    "PayPal: Opening opportunities for all.",
    "Clear Street: Today's financial infrastructure.",
    "Airtable: What will you make?",
    "Discord: Building something you actually use.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "Techmeme: You might have heard of us...",
    "Fri. 05/26 - AI Google Search Is Here",
    "May 30-Jun 2COMPUTEXTaipei",
    "May 31-Jun 2Augmented World Expo USASanta Clara, CA",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 4-8Cisco Live!Las Vegas",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Sep 19-21TechCrunch DisruptSan Francisco",
    "Sep 26-27Code ConferenceDana Point, CA",
    "Bluesky launches alternative feeds with custom algorithms",
    "Bluesky rolls out feeds with custom algorithms",
    "Bluesky rolled out custom algorithm feeds to everyone",
    "Commission Nationale de l'Informatique et des Libertés",
    "Microsoft Successfully Evades Additional French Fines, Alters Bing's Data Tracking Procedures",
    "Closure of the injunction issued against MICROSOFT IRELAND OPERATIONS LIMITED",
    "Meta layoffs affected the teams that were fighting fake news on Facebook",
    "Ericsson whistleblower scoops record $279m payout from SEC",
    "Report: ‘massive’ Tesla leak reveals data breaches, thousands of safety complaints",
    "Tesla-Files nähren Zweifel an Elon Musks Versprechen",
    "Huge Tesla leak reveals thousands of safety concerns, privacy problems",
    "Shocking Leaked Tesla Documents Hint at Cybertruck Problems",
    "This is your brain on Elon Musk",
    "Tesla could face a $3.3 billion fine over a massive data leak",
    "Huge Tesla data leak reportedly reveals thousands of safety complaints. 4 things to know",
    "Tesla Whistleblower Leaks 100 Gb of Data to German News Outlet",
    "Tesla Whistleblower Leaks 100GB of Data, Revealing Safety Complaints",
    "Tesla leak reportedly reveals thousands of Autopilot safety complaints",
    "Tesla Keeps Doing Something No Other Company Dares To",
    "Tesla Data Leak Tips Thousands of Autopilot Safety Complaints",
    "Tesla data breach? 100GB of company information ‘leaked by whistleblower’",
    "Tesla's FSD Beta Goes Live Internationally, But Not Everywhere Just Yet",
    "Tesla customers reported thousands of Full Self-Driving complaints, leaked data shows",
    "Tesla leak reveals thousands of safety complaints",
    "Whistleblower Drops 100 Gigabytes Of Tesla Secrets To German News Site: Report",
    "Nvidia Stock Surge Is a Warning to Tesla—and Vice Versa",
    "Tesla Files: Insider dropped 100 Gb of data on German media outlet",
    "YouTube Stories are Going Away on 6/26/2023",
    "YouTube Stories Are Being Retired on June 27",
    "YouTube Stories To Be Discontinued",
    "YouTube is killing Stories",
    "YouTube Stories Heading for the Google Graveyard",
    "YouTube kills a feature you probably weren't using anyway",
    "YouTube to Sunset ‘Stories’ Feature on June 26th",
    "Google is mercy killing YouTube Stories",
    "YouTube Stories will be killed off next month",
    "YouTube to abandon Stories next month",
    "Time to bid farewell to YouTube Stories",
    "YouTube will shut down YouTube Stories next month: Check Stories' alternatives",
    "Google is killing a stolen YouTube feature",
    "“Stories” time for YouTube ends June 26th; platform tells creators to use Posts and Shorts",
    "YouTube's Retiring YouTube Stories Next Month",
    "The limited time YouTube Stories videos are going away for good on June 26",
    "YouTube Stories, Google's clone of Snapchat, is dying on June 26",
    "Add YouTube ‘Stories’ to the list of failed Snapchat copycats",
    "YouTube is killing off Stories in favor of Shorts",
    "YouTube Dropping Stories As It Shifts Attention To Shorts And Community Posts",
    "Long Story Short: YouTube Stories Are Shutting Down",
    "YouTube Axes Stories Feature and Encourages Creators to Make Shorts",
    "YouTube Stories are going away starting June 26",
    "YouTube Stories, which are not Shorts, are going away",
    "I did not know YouTube had stories. They plan to shut it down. 🤣🤣🤣🤣 https://techcrunch.com/...",
    "Microsoft's urgent plea to lawmakers and companies over AI",
    "Microsoft Calls for a New US Agency and Licensing for AI",
    "Microsoft Calls for A.I. Rules to Minimize the Technology's Risks",
    "Microsoft urges lawmakers, companies to ‘step up’ with AI guardrails",
    "Microsoft president Brad Smith raise concerns against deep fakes",
    "Microsoft's Brad Smith Calls for More Regulation of Artificial Intelligence",
    "Microsoft appeals for a new US agency to regulate AI",
    "AI trailblazers Microsoft and OpenAI push for regulation",
    "Microsoft chief calls for humans to rule AI, safeguard critical infrastructure",
    "Microsoft's View on AI Governance: A Blueprint for the Future",
    "Governments Need to ‘Move Faster’ on AI Rules, Says Microsoft President",
    "Microsoft chief says deepfakes are biggest AI concern",
    "Microsoft: We Need a New Government Agency to Regulate AI",
    "Microsoft leaps into the AI regulation debate, calling for a new US agency and executive order",
    "Microsoft President Says Deep Fakes Are Biggest AI Concern"
]