[
    "Updating our inactive account policies",
    "Warning: Google to Delete Accounts That Have Been Inactive for 2 Years",
    "Google will start deleting inactive accounts and wiping out user data later this year",
    "Google will purge inactive accounts as a security measure",
    "If you haven't logged into your Google account in over 2 years, it will be deleted",
    "Google will start hacking away at inactive accounts later this year",
    "Google is Deleting Accounts That Have Not Been Used in The Past Two Years",
    "Google's coming for your old accounts",
    "How to set up Google Inactive Account Manager: A step-by-step guide",
    "Google may delete your Gmail account if it's been inactive for too long",
    "Google says it will start deleting inactive accounts later this year",
    "Got an old Google account you want to keep? It may be in danger of permanent deletion",
    "Google will start deleting inactive accounts later this year",
    "Google to delete accounts that have been inactive for two years",
    "Here's why your Gmail account may be at risk of being deleted",
    "In December, Google's Deleting a Ton of Inactive Accounts",
    "Google Will Delete Accounts That Have Been Inactive For Two Years",
    "Your inactive Gmail accounts will get deleted — how to keep them active",
    "Google threatens to start deleting inactive Gmail accounts",
    "Google to delete accounts inactive for two years in security push",
    "Google Accounts That Sit Unused For Too Long Will Soon Be Deleted Entirely",
    "Google will delete inactive accounts starting December 2023",
    "Google plans to delete inactive accounts after two years",
    "Google To Delete Old Gmail And YouTube Accounts Not Used In Two Years",
    "Haven't used your Google account recently? It may be deleted",
    "Use it or lose it: Google says it will delete inactive accounts",
    "Google will start deleting inactive accounts after two years",
    "Google will start purging inactive accounts later this year",
    "Log in or lose it: Google will start deleting your unused personal accounts",
    "This is smart, assuming deletion really means deletion. https://blog.google/...",
    "CNBC Television on YouTube",
    "@Jonathanglick@mstdn.social",
    "Elon Musk keeps insisting the Texas shooter with a swastika tattoo is not a white supremacist",
    "CNBC Exclusive: CNBC Transcript: Elon Musk Sits Down with CNBC's David Faber Live on CNBC Tonight",
    "Facebook verification comes to UK; Musk says working from home ‘morally wrong’",
    "I will tweet what I want even if it loses me money",
    "Musks says ‘so be it’ to consequences of his tweeting",
    "Elon Musk: Working from home is ‘morally wrong’ when service workers still have to show up",
    "Elon Musk Speaks on Twitter's Hurdles, Tesla's Resilience, and AI Dominance",
    "Tesla is going to try advertising says Elon Musk who ‘hates’ it",
    "Elon Musk teases two new EVs, says Tesla is already building one",
    "Elon Musk says if his tweets lose his firms money then so be it",
    "Elon Musk says work from home is ‘bull**it’ and ‘morally wrong’",
    "Tesla may reverse its stance and start advertising",
    "Musk says will tweet thoughts regardless of business blowback",
    "Tesla will ‘try a little advertising’, Elon Musk says",
    "Elon Musk: I will say what I want even if it loses me money",
    "Elon Musk on Sam Altman and ChatGPT: I am the reason OpenAI exists",
    "he's so fucked up lol https://twitter.com/...",
    "Absolute nonsense all the way down https://twitter.com/...",
    "@Techmeme @rogoswami Those who live in la la land glass houses shouldn't throw ephemeral stones",
    "Texas police have confirmed the shooter had Nazi tattoos. https://twitter.com/...",
    "Spaces interview with @davidfaber starting now",
    "“the laptop class is living in la la land” - elon musk in a live cnbc interview right now",
    "Major win for Ripple as judge denies SEC's motion to seal Hinman documents",
    "Breaking: Court victory for Ripple as judge denies SEC motion to seal Hinman docs",
    "Judge denies SEC motion to seal Hinman speech documents in Ripple case",
    "XRP surges as judge orders SEC to release Hinman files",
    "SEC's Request to Seal Hinman Documents Denied by Court",
    "Waves founder denies Russian mafia links, Ripple judge denies SEC motion to seal crypto speech",
    "Coinbase And Ripple Playing Game Of Poker With The SEC, CNBC Correspondent Says",
    "Ripple's XRP Bucks Crypto Gloom After Latest Court Twist Sparks 8% Jump",
    "Ripple XRP rises 7% after judge denies SEC's motion to seal Hinman documents",
    "Pro-XRP Lawyer to Address Possible “Bad News” for Ripple in Latest Judge Torres Ruling",
    "Why Is XRP Surging by Over 8% Today?",
    "XRP lawsuit: Judge denies SEC motion to seal documents in win for Ripple",
    "Hinman documents to be made public in Ripple vs SEC lawsuit",
    "Ripple CEO Celebrates Key Milestone in SEC Lawsuit",
    "Ripple Vs. SEC: Judge Denies The Sealing of Hinman's Speech Once Again",
    "Judge Torres Rules That SEC Cannot Seal Hinman Docs in Ripple Case",
    "Court Denies SEC's Request To Seal Hinman Documents In Ripple Lawsuit",
    "Ripple acquires crypto custody startup Metaco for $250 million",
    "Ripple Acquires Crypto Custody Firm Metaco for $250M in Tokenization Push",
    "Ripple Buys Crypto Custody Firm Metaco for $250M",
    "Leading Enterprise Crypto Company Ripple Acquires Custody Provider Metaco for $250M",
    "Crypto firm Ripple acquires custody provider Metaco for $250m",
    "Ripple buys crypto custody firm Metaco for $250 million",
    "Ripple acquires crypto custodian Metaco for $250 million",
    "Crypto firm Ripple buys Swiss startup as SEC crackdown forces companies to consider overseas moves",
    "Ripple Takes on the Crypto Custody Market with Metaco",
    "The Dangers of Google's .zip TLD",
    "Don't panic.  Google offering scary .zip and .mov domains is not the end of the world",
    "New TLDs: Not Bad, Actually",
    "Hackers are using a devious new trick to infect your devices",
    "Want a new Google zip domain? It could be a serious security risk",
    "Is the new .zip top-level domain a cyber security risk?",
    "lol dont go to https://42.zip/ https://twitter.com/...",
    "@campuscodi@mastodon.social",
    "Lancefly: Group Uses Custom Backdoor to Target Orgs in Government, Aviation, Other Sectors",
    "New APT targets South and Southeast Asia with custom-written backdoor",
    "Lancefly APT uses powerful Merdoor backdoor in attacks on Asian orgs",
    "Researchers Uncover Powerful Backdoor and Custom Implant in Year-Long Cyber Campaign",
    "Stealthy MerDoor malware uncovered after five years of attacks",
    "Lancefly APT Custom Backdoor Targets Government and Aviation Sectors",
    "Threat Actor Uses Merdoor Backdoor to Hit Asian Orgs",
    "Lancefly APT Targeting Asian Government Organizations for Years",
    "Ledger Recover by Coincover",
    "‘Backdoor’ for Seed Phrases? Ledger's New Recovery Feature Spooks Users",
    "Hardware wallet manufacturer Ledger faces backlash over new feature",
    "Ledger Comes Under Fire Over Seed Phrase Recovery Service Fiasco",
    "Crypto hardware maker's recovery feature draws ire",
    "‘There Is No Backdoor,’ Ledger Says in Response to Recover Reactions",
    "Are ledger hardware wallets secure? A comprehensive analysis",
    "‘Backdoor’ in Ledger? Here's What's Going On—And How to Keep Your Crypto Safe",
    "Ledger Under Fire for Allegedly Exposing User Seed Phrases",
    "Stupidest idea you can make as a hardware wallet manufacturer.... https://twitter.com/... [image]",
    "teenage engineering has the opportunity to do something incredibly funny https://twitter.com/...",
    "@briankrebs@infosec.exchange",
    "Re-Victimization From Police-Auctioned Cell Phones",
    "United States District Court for the Northern District of California",
    "San Francisco Business Journal",
    "U.S. Tech Espionage Team Unveils First Cases Involving China and Russia",
    "Indictment  —  At all times relevant to this Indictment: 1.  Apple, Inc. (\"Apple\") …",
    "Ex-Apple engineer accused of stealing self-driving car secrets",
    "Ex-Apple Engineer Indicted in Crackdown on Flow of Restricted Tech to China, Russia",
    "Ex-Apple engineer accused of stealing self-driving cars technology for China. Details",
    "Feds: Apple Engineer on ‘Need to Know’ Project Took Data, Ran to China",
    "US charges Apple ex-employee for trying to steal technology",
    "Former Apple engineer charged for selling AppleCar tech to China",
    "DOJ charges former Apple engineer with stealing self-driving car technology for China",
    "Chinese ex-Apple engineer stole Apple Car secrets, says DoJ",
    "US charges former Apple engineer with attempt to steal self-driving car tech",
    "Weibao Wang charged with stealing Apple self-driving car secrets for China",
    "Apple autonomous driving tech secrets stolen by ex-engineer, feds say",
    "DOJ Indicts Ex-Apple Engineer for Stealing Self-Driving Car Tech for China",
    "US ‘strike force’ charges Chinese and Russian nationals with stealing sensitive tech",
    "they stole the apple car! 😂 that never launched",
    "‘FriendlyName’ Buffer Overflow Vulnerability in Wemo Smart Plug V2",
    "Critical security flaw is exposing older Wemo Smart Plugs to hackers",
    "PSA: time to recycle your old Wemo smart plugs (if you haven't already)",
    "Serious Unpatched Vulnerability Uncovered in Popular Belkin Wemo Smart Plugs",
    "PSA: Older Wemo Smart Plugs Have Vulnerability That Leaves Them Open to Attack",
    "Unpatched Wemo Smart Plug Bug Opens Countless Networks to Cyberattacks",
    "Researchers find exploit in Belkin's Wemo Mini Smart Plug V2",
    "International Business Times",
    "App Store stopped more than $2 billion in fraudulent transactions in 2022",
    "Apple blocked 1.7 million apps for privacy, security issues in 2022",
    "Apple says it blocked nearly two million malicious or insecure iOS apps last year",
    "Apple's App Store is a fortress; over $2 bn in fraudulent transactions in 2022 [details]",
    "Apple's App Store stopped over $2 billion in fraudulent transactions last year",
    "App Store stopped over $2 billion in fraudulent transactions in 2022, Apple claims",
    "App Store's anti-fraud measures halt more than $2 billion in 2022",
    "Apple Touts Fraud and Abuse Prevention in the App Store",
    "Apple's App Store prevented more than $2 billion worth of fraudulent transactions in 2022",
    "App Store thwarted $2 billion in fraudulent transactions in 2022",
    "Apple says it blocked over $2 billion in App Store fraud in 2022",
    "Apple says its App Store prevented over $2B in fraudulent transactions last year",
    "Apple rejected nearly 1.7 million App Store submissions in 2022",
    "Apple Reveals that their App Store Stopped more than $2 Billion in Fraudulent Transactions in 2022",
    "Apple says App Store stopped more than $2 billion in fraudulent transactions in 2022",
    "YouTube's recommendations are leading kids to gun videos, report says",
    "How to verify your YouTube account",
    "YouTube's recommendations send violent and graphic gun videos to 9-year-olds, study finds",
    "YouTube Accused Of Pushing Violent Content To Children",
    "Study shows YouTube is recommending gun videos to young gamers",
    "Study finds YouTube algorithm can push violent, graphic videos to young children",
    "Disturbing Results: YouTube's Algorithm Recommends Harmful Content to Young Viewers",
    "How to download YouTube videos on PC, iOS, Android, and Mac",
    "Ministers looking at body-worn facial recognition technology for police",
    "One of the many reasons I quit my job in facial recognition. https://twitter.com/...",
    "German Volkswagen met Huawei for car software",
    "Canada, South Korea sign critical minerals deal in bid to reduce China dependence",
    "Latch to Acquire Ring Founder Jamie Siminoff's Latest Company, Honest Day's Work",
    "Ring founder takes over as Latch CEO shortly after leaving Amazon",
    "Ring founder to become CEO of commercial smart home company Latch",
    "Ring co-founder, robotics vice president leave Amazon",
    "Ring founder Jamie Siminoff departs to join Latch",
    "Latch to Acquire Honest Day's Work",
    "HealthcareInfoSecurity.com",
    "U.S. Department of the Treasury",
    "Russian National Charged with Ransomware Attacks Against Critical Infrastructure",
    "Russian ransomware affiliate charged with attacks on critical infrastructure",
    "Alleged Russian Hacker Charged in $200 Million Ransomware Spree",
    "Russian man charged over ransomware attacks, including against D.C. police",
    "US Offering $10M Reward For Russian Man Charged With Ransomware Attacks",
    "Alleged Babuk Ransomware Hacker ‘Wazawaka’ Indicted in US",
    "US puts $10 million bounty on Russian hacker's head",
    "United States Sanctions and Charges Russia-based Ransomware Developer Mikhail Matveev",
    "DOJ Offers $10 Million Reward for Info on Alleged Russian Ransomware Hacker",
    "Alleged Babuk ransomware gang leader ‘Wazawaka’ indicted, sanctioned by US",
    "US sanctions Russian accused of being a ‘central figure’ in major ransomware attacks",
    "IBM to Help Automate Cloud Data Protection with Acquisition of Polar Security",
    "Acquisition amid layoffs? IBM confirms acquisition of Polar Security, reportedly for $60 mn",
    "IBM acquires Israeli co Polar Security",
    "IBM Snaps up DSPM Startup Polar Security",
    "IBM snags Polar Security to boost cloud data practice",
    "IBM buys data security startup Polar Security in reported $60M deal",
    "App Spotlight: Ringover for Zoho CRM",
    "What's more important for training AI — data or compute?",
    "From “you are the product” to “you are the input into a LLM” https://twitter.com/...",
    "Apple launches new concert discovery features on Apple Maps and Apple Music",
    "Apple adds more concert discovery features to Music and Maps apps",
    "How to use Set Lists on Apple Music",
    "Apple Adds Live Music Features to Maps and Music",
    "Apple rolls out new concert discovery features in Apple Music and Apple Maps: How to use it",
    "Apple introduces new concert discovery features for Apple Maps and Apple Music",
    "Apple Music, Maps Launch New Concert Discovery Features",
    "Apple introduces ‘concert discovery’ for Music and Maps",
    "How to find your favorite artist's Set List on Apple Music; see tour dates and get tickets",
    "Apple launches Maps and Apple Music with New Concert Discovery Features",
    "Apple launches concert discovery and venue guides on Apple Maps and Apple Music",
    "Apple brings new concert discovery features to Maps and Music",
    "Apple Music adding concert set list playlists, tour dates, and more",
    "Apple now helps you discover concerts in Maps and Music",
    "@viticci@mastodon.macstories.net",
    "@DavidNielsen@mastodon.social",
    "Apple says your iPhone will soon be able to speak in your voice with 15 minutes of training",
    "Apple's iOS 17 accessibility features, Apple Music updates",
    "Apple's AI-Driven Accessibility Updates Include Text-to-Speech That Can Mimic Your Voice",
    "Apple will let you teach your iPhone to speak in your voice",
    "Apple's latest iOS 17 feature creates a digital version of your voice in just 15 minutes",
    "Your iPhone will soon be able to speak with your voice",
    "Apple Adds Live Speech and AI-Based Voice Generation in iOS 17",
    "iPhones will soon be able to learn your voice and speak for you",
    "iPhones will soon be much easier to use",
    "Apple previews useful accessibility features coming to iOS 17",
    "Apple's next big iPhone update lets you create a digital voice that sounds like you",
    "Modest Apple talks up these ‘incredible’ advances in iOS",
    "Apple's upcoming accessibility features include text-to-speech AI that can imitate users' voices",
    "Apple previews new Assistive Access, Live Speech, and other accessibility coming in iOS 17",
    "Soon, your iPhone will be able to speak in your own voice",
    "The Next Major iPhone Update Will Be Capable of Digitally Reproducing Your Voice",
    "Apple to Expand Accessibility Options in 2023",
    "Made for iPhone hearing aids can now pair with Mac; customized audio, too",
    "Apple Unveils Groundbreaking Accessibility Features for iPhone and iPad",
    "Apple Previews iOS 17 Accessibility Features Ahead of WWDC",
    "Apple's Assistive Access simplifies iOS 16 for people with cognitive disabilities",
    "@johnvoorhees@mastodon.macstories.net",
    "@blakereid@mastodon.lawprofs.org",
    "Here I am wishing this level of simplicity was the default. https://twitter.com/...",
    "This looks similar to the Custom Accessibility Mode that leaked in iOS 16.2",
    "Google's latest AI tackles long and costly drug discovery",
    "How HPC and generative AI will accelerate drug discovery and precision medicine",
    "Google Cloud Launches Two New AI Solutions to Speed Up Drug Discovery & Precision Medicine",
    "Free compensation benchmarking data from 3,000 startups",
    "Turn product data into revenue without engineers",
    "The first AI navigator for your entire network",
    "Google: Bring questions. Build answers.",
    "TikTok: Inspire creativity and bring joy.",
    "Automattic: 43% down, 57% to go. WordPress.",
    "PayPal: Opening opportunities for all.",
    "Airtable: What will you make?",
    "Clear Street: Today's financial infrastructure.",
    "Discord: Building something you actually use.",
    "Stripe: Help us build universal payments.",
    "Fathom: The leader in medical coding automation.",
    "Figma: Make design accessible to everyone.",
    "Adobe: Let’s create experiences that matter.",
    "Character.AI: Build something smarter than you.",
    "Techmeme: You might have heard of us...",
    "Tue. 05/16 - Open Source Vs. Centralized AI, Part I",
    "May 17Earnings: CSCO, Tencent, TTWO",
    "May 18-20Bitcoin 2023Miami Beach, FL",
    "May 22Earnings: ZM, Kuaishou",
    "May 22-24HYBRID: GamesBeat SummitLos Angeles",
    "May 23-25HYBRID: Microsoft BuildSeattle",
    "May 24Earnings: NVDA, SNOW, PATH, Xiaomi",
    "May 30-Jun 2COMPUTEXTaipei",
    "Jun 1VIRTUAL: Meta Quest Gaming Showcase",
    "Jun 6-8VIRTUAL: The Six Five Summit: Navigating Rough Waters with Practical Innovation SPONSOR",
    "Jun 14-17Viva TechnologyParis",
    "Jul 10-12Fortune Brainstorm TechPark City, UT",
    "Aug 21-24VMware ExploreLas Vegas",
    "Sep 6-8SaaStr AnnualSan Francisco",
    "Sep 12-14HYBRID: DreamforceSan Francisco",
    "Insurtech Unicorn Bolttech Raises $196 Million, Nudging Up Valuation",
    "Insurtech Unicorn Bolttech Raises $196 Million",
    "Japanese security integration company Secom invests $192M into Eagle Eye and Brivio",
    "Bethesda's Brivo just raised $92.5M in a dual investment round",
    "Fashion giant Shein raises $2 billion but lowers valuation by a third",
    "Tencent's revenues accelerate as China emerges from Covid lockdowns",
    "China's Tencent marks return to revenue growth in first quarter",
    "China's Tencent Reports Solid First-Quarter Revenue After Tough 2022",
    "Tencent posts 11 per cent rise in first-quarter revenue",
    "Tencent Renews Growth Path in Music and Games, But Loses Ground in Streaming Video",
    "Tencent posts strong quarterly result on China's COVID reopening",
    "Tencent posts fastest jump in quarterly revenue in more than a year after China reopens",
    "TENCENT ANNOUNCES 2023 FIRST QUARTER RESULTS",
    "Baltimore Business Journal",
    "Cybersecurity firm Huntress raises $60M as it eyes international expansion",
    "New Investment Fuels Our Mission To Enable SMBs to Better Protect Their Business Assets",
    "Cybersecurity startup Huntress raises $60M Series C round",
    "Huntress Adds $60 Million in Funding to Expand Managed Security Business",
    "Huntress Raises $60M Series C for Its Cybersecurity Tech",
    "Huntress Closes $60M Series C for MDR Expansion",
    "Ellicott City-based Huntress raises $60M Series C",
    "Huntress Lands $60M, Eyes Potential IPO In Coming Years",
    "CORRECTION: Rumble Acquires Podcasting and Live Streaming Platform Callin",
    "Why companies still shy away from podcast ads",
    "How marketers should rethink digital ad channels, based on our forecast data",
    "Yet Another Bug in Facebook Ads",
    "These glitches never seem to benefit the buyer https://twitter.com/...",
    "Zoom Partners with Anthropic to Expand Federated Approach to AI",
    "Zoom makes a big bet on AI with investment in Anthropic",
    "Zoom announces partnership with Anthropic for AI call center services",
    "Zoom to use Anthropic's Claude AI to better its customer service",
    "Zoom To Inject Anthropic's AI Chatbot Into Video, Collaboration Products",
    "AI monetization! https://twitter.com/...",
    "Framework Laptop 13 review: cracking modular PC gets all-round upgrade",
    "Framework Laptop 13: Fully User-Repairable, but Can It Compete with MacBook Air?",
    "Framework 13 Intel 13th Gen mainboard",
    "Kustomer Embarks on a New Chapter as a Standalone Company",
    "Meta continues ‘year of efficiency’ by spinning out Kustomer",
    "Meta Moves on From Customer Service Platform Kustomer",
    "the boys are back. excited for the next phase. https://twitter.com/...",
    "WHO Issues a Warning About the Use of AI in Healthcare",
    "Investing in Hippocratic AI",
    "Meet the Startup Promising to Deliver the 1st Healthcare-focused Generative AI Model",
    "General Catalyst, Andreessen Horowitz bet on large language models for health care",
    "Hippocratic AI launches with $50M to build large language model for healthcare",
    "Hippocratic AI Launches with $50M for Safety Large Language Model for Healthcare",
    "Hippocratic AI Launches With $50M Seed Funding Round",
    "WHO urges caution over use of generative AI in healthcare",
    "Hippocratic AI Raises $50 Million To Power The Healthcare Bot Workforce",
    "Hippocratic Health raises $50 mln seed funding to build AI model",
    "Twitter sued over Saudi spying that allegedly landed popular user in prison",
    "Twitter Sued for Allegedly Helping to Silence Saudi Critics",
    "United States Senate Committee on the Judiciary",
    "OpenAI's Sam Altman Urges A.I. Regulation in Senate Hearing",
    "CEO behind ChatGPT warns Congress AI could cause ‘harm to the world’",
    "Mr. ChatGPT goes to Washington: OpenAI CEO Sam Altman testifies before Congress on AI risks",
    "Oversight of A.I.: Rules for Artificial Intelligence",
    "ChatGPT's Sam Altman Calls on Congress to Adopt Safety Standards for AI Systems",
    "OpenAI CEO calls for laws to mitigate ‘risks of increasingly powerful’ AI",
    "OpenAI's Sam Altman Urges Congress to Regulate Powerful New Technology",
    "OpenAI chief goes before US Congress to propose licenses for building AI",
    "Sam Altman wows lawmakers at closed AI dinner: ‘Fantastic...forthcoming’",
    "Spooked by ChatGPT, US Lawmakers Want to Create an AI Regulator",
    "Congress Helps Sam Altman Sell His Chatbot to the American People",
    "What you need to know about the Sam Altman hearing",
    "OpenAI CEO Testifies on Artificial Intelligence",
    "Sam Altman's testimony: Navigating the PR playbook in the soon-to-be-regulated AI industry",
    "OpenAI CEO Sam Altman Asks Congress to Regulate AI",
    "OpenAI CEO in “historic” move calls for regulation before Congress",
    "NEWSLETTERS  ·EYE ON A.I.  —  OpenAI CEO Sam Altman tells senators he wants to see A.I. licensed.",
    "Ctrl+Alt+Delete: Sam Altman urges reset in AI regulation",
    "OpenAI's Sam Altman Calls for AI Regulation in Senate Testimony",
    "Congress deliberates AI regulation to avoid mistakes of the past",
    "OpenAI's Sam Altman To Congress: Regulate Us, Please!",
    "6 takeaways from the OpenAI senate hearing",
    "Historic Senate hearing sees OpenAI CEO Sam Altman championing AI safety",
    "ChatGPT chief says AI should be regulated by a US or global agency",
    "ChatGPT chief issues AI warning",
    "OpenAI CEO to Congress: Regulate me",
    "Lawmaker asks ChatGPT if the government should regulate AI, and the answer won't surprise you",
    "OpenAI CEO asks Congress for AI regulation and a new agency",
    "Sam Altman's Washington charm offensive is working",
    "OpenAI CEO: If AI Goes Wrong, ‘It Can Go Quite Wrong’",
    "Sam Altman On AI Oversight: Balancing Risks & Advancements",
    "OpenAI CEO Sam Altman tells US Senate panel generative AI needs regulation",
    "Sam Altman: CEO of OpenAI calls for US to regulate artificial intelligence",
    "OpenAI stumps in Washington",
    "OpenAI CEO Sam Altman testifies in ‘historic’ Senate hearing on AI safety",
    "The C.E.O. of OpenAI Heads to Congress to Discuss Rules for A.I.",
    "OpenAI CEO Sam Altman Urges Congress to Create AI Regulation at Senate Hearing",
    "OpenAI's Sam Altman got a warm welcome on Capitol Hill",
    "OpenAI CEO Sam Altman's congressional testimony comes at a critical AI moment",
    "ChatGPT's chief to testify before Congress as concerns grow about artificial intelligence's risks",
    "Who is Sam Altman, the OpenAI CEO testifying at Congress?",
    "The man behind ChatGPT is about to have his moment on Capitol Hill",
    "OpenAI immediately going for AI regulation is lame as fuck",
    "Can you say, “pulling up the ladders”? https://twitter.com/..."
]