[
    "World Test Championship 2023",
    "Protesting wrestlers rejoin work after meeting Amit Shah, say their 'fight will continue'",
    "Mukhtar Ansari gets life term for Cong leader's murder",
    "Why children must earn money to learn money lessons",
    "Odisha train tragedy: Railway board orders safety drive in all zones",
    "Train crash: Man refused to believe son died, finds him alive",
    "Bihar: Rs 1,710cr under-construction bridge falls 2nd time",
    "How the Ukraine war crossed the border into Russia",
    "No relief for Sisodia as HC denies interim bail in Delhi liquor 'scam'",
    "Tejashwi says bridge over Ganga that collapsed was 'faulty'",
    "Here is how to become a Public Policy professional",
    "Shopping: Big Discounts & Coupons on Great Products You Can't Miss",
    "MIT xPRO Tech Leadership Programme",
    "3 days after Balasore tragedy, goods train derails on private tracks",
    "Rajit Kapur on how to say goodbye to eyeglasses",
    "02:00Patient dies: Oxygen supply cut off during brawl; kin, docs blame each other",
    "00:57Shubman Gill and Sara Tendulkar’s CHATS get leaked",
    "00:31Sara Ali Khan gets 'worried', shouts 'Ibrahim, Ibrahim'",
    "04:30'I don't want to do Mann ki Baat here...': Rahul Gandhi takes a jibe at PM Modi",
    "Odisha train crash live: NDRF ends operation, withdraws all 9 teams",
    "Watch: TOI's Medithon on occasion of National Cancer Survivors Day",
    "NIRF Ranking 2023: IIT Madras retains top position",
    "3-yr-old boy chews snakelet to its death in UP",
    "Mumbai student ends life, 2 kids (7, 10) among 5 booked",
    "Key architects of modern India were NRIs...:Rahul Gandhi",
    "‘Future of tigers depends on present protection of landscapes, corridors’",
    "Rajnath Singh holds talks with US defence secretary Lloyd Austin",
    "Unruly flyer incidents on board flights up by 37% in 2022:",
    "WTC Final: Can India's 'old' middle order play the new-age game?",
    "'PM driving Indian car looking into rear-view mirror, it's crashing'",
    "Delhi thaw: BJP & Naidu's TDP bend over backwards",
    "Manipur unrest: After viral social media message, Army slams bid to malign it the state",
    "Woman, 70, 'declared dead', struggles to prove she's alive",
    "'Signal interference root cause’; CBI to probe criminal angle",
    "Coromandel express accident",
    "Odisha Train Accident Reason",
    "3 CRPF jawans injured in IED blast in Chhattisgarh's Bijapur",
    "Three-year-old boy chews snakelet to its death in UP's Farrukhabad, is fine",
    "Ayodhya Class 10 girl's death in school was suicide: Cops",
    "Your micro RNA will reveal risk of a heart attack!",
    "Odisha train tragedy: ‘A few minutes under a pile of bodies seemed like hours’",
    "For many from West Bengal, search for kin ends at makeshift morgues",
    "Eknath Shinde does ‘Mujra’ in Delhi, says Sanjay Raut",
    "Patient dies in Gwalior hospital: Oxygen supply cut off during brawl; kin, docs blame each other",
    "10-year-old girl dies by suicide in Raisen district of Madhya Pradesh",
    "Three minor boys gang up to loot jeweller— all for a visit to Phuket",
    "Mukesh on his last conversation with Gufi",
    "It feels like my debut again: Sara Ali Khan",
    "Is Ranveer doing Baiju Bawra for free?",
    "B'wood celebs who decided to stay unmarried",
    "Mahabharat's Nitish praises late Gufi Paintal",
    "Celebs pay their last respects to Sulochana- PICS",
    "Boney chills with daughters Janhvi-Khushi",
    "Hansal talks about Pratik's cameo in Scoop",
    "Actors who initially rejected iconic roles",
    "Sara turns bodyguard for brother Ibrahim",
    "Mukesh breaks silence on Shaktimaan film",
    "Paratha lover Vicky Kaushal stays lean",
    "How to make sustainable fashion choices",
    "Nandini Gupta graces the ISTD Youth Fest",
    "Kapil struggles to talk in English with Brett Lee",
    "Watch: Gauahar-Zaid's life before and after baby",
    "'Gufi uncle spoke to us a bit in the morning'",
    "Megha Akash flaunted her beautiful smile",
    "Punjabi style goals ft Kiara Advani",
    "30Rhea nails all-black trend in pictures",
    "30Nysa attends Beyonce’s concert",
    "Malaika's stylish desi looks in pics",
    "Esha stuns in mirror selfie",
    "Rakul Preet oozes oomph in red bikini",
    "30Pics: Palak's summer wardrobe",
    "30Surbhi sets internet ablaze",
    "Sunny ups beach style quotient",
    "Rupali's ethnic grace in pictures",
    "Pichaikkaran 2Pichaikkaran 2 MovieCritic Rating2.5",
    "00:54'Mahabharat' famed Gufi Paintal aka Shakuni Mama passes away due to age-related health issues",
    "00:39Hotness alert! Nikki Tamboli leaves speechless with her pic in black bikini bralette",
    "00:57Amid dating rumours, Shubman Gill and Sara Tendulkar’s old chats get leaked on social media",
    "Jet fighters chase small plane in Washington area before it crashes in Virginia",
    "Talks with China ‘essential’ to curb risk of conflict, says US",
    "President Biden signs debt ceiling bill that pulls US back from brink of unprecedented default",
    "Gratified that Speaker McCarthy invited PM Modi to address joint session of Congress: Ro Khanna",
    "US, allies clash with Russia, China over North Korea's failed military spy satellite launch",
    "India’s counter to Chinese aggression in 2020 was amazing, says Pompeo",
    "US defence secretary in India, talks with defence minister Rajnath Singh",
    "Biden's 2024 pitch highlights pragmatism over Trump's pugilism",
    "Chinese warship passed in 'unsafe manner' near US destroyer in Taiwan Strait: US",
    "Big Tech sued over student mental health",
    "Why were grave red flags ignored: Kharge to PM Modi on Odisha rail tragedy",
    "Gangster-politician Mukhtar Ansari convicted in Cong leader Awadhesh Rai's murder",
    "​Rahul Gandhi slams BJP, RSS for dwelling in the past, blaming others​",
    "India moving ahead with clear roadmap on environment, climate change: PM Modi",
    "98% of India's rail tracks were laid between 1870 and 1930",
    "'Ambitious roadmap': India, US agree to deepen defence ties to counter China",
    "Gangster-politician Mukhtar Ansari gets life imprisonment in Congress leader's murder",
    "Odisha rail tragedy key points: Trains resume service 51 hours after deadly crash",
    "Unruly flyer incidents on board flights up by 37% in 2022: IATA",
    "India logs 174 new Covid-19 cases",
    "Rumour of EVs being made compulsory by year-end fake",
    "India reports 490 new Covid cases in last 24 hours; active caseload dips to 5,707",
    "India reports 535 new Covid cases; active caseload declines to 6,168",
    "Active Covid cases in country dip to 7,104",
    "Active Covid cases in country decrease to 7,623",
    "India logs 782 Covid cases",
    "Covid-19: India records 237 fresh cases, active caseload declines to 3,502",
    "Active Covid cases in country dip to 4,709",
    "Active Covid cases in country dip to 4,972",
    "India's active Covid case tally down to 5,259",
    "03:01Eknath Shinde does ‘Mujra’ in Delhi, says Sanjay Raut",
    "00:58OMG! 'Pushpa' actress' PRIVATE pic gets leaked",
    "02:18Shahbad Dairy murder: 'Girl's skull broken into pieces', reveals autopsy report",
    "00:54Mahabharat's Shakuni Mama aka Gufi Paintal dies",
    "01:04When SRK teased MS Dhoni with Deepika Padukone",
    "8Peeing often? Know the reasons",
    "Padma Lakshmi's fitness routine",
    "Heart attack risk rises on Monday!",
    "10Bollywood's champions of sustainability",
    "What these yesteryear actors wore for their wedding",
    "\"I didn't know I was my husband's second wife\"",
    "Secrets of emotionally stable people!",
    "Why do people still cheat in happy relationships?",
    "10How to make your own anti-ageing serum at home",
    "10 ways to avoid getting tanned this summer",
    "Beauty tips we wish we knew before",
    "7​Unique qualities of June born babies​",
    "Quirky toddler habits that are normal",
    "Why should parents save umbilical cord?",
    "10Exclusive: Sara's Green tea hack is so relatable!",
    "The Ayurvedic way of eating breakfast",
    "Tasty protein-rich Soy Cutlets recipe",
    "World Environment Day: Places that have banned plastic",
    "World’s shortest commercial flights!",
    "Bookmark these famous railway bridges in India",
    "Manushi Chhillar: Life has really spoilt me",
    "Natasha Assadi hitched to Gaurav Sharma",
    "R’Bonney Nola's fashion workshop in Bangkok",
    "Expert Tips To Help Your Daughter With Menarche",
    "Colourful and Fun Bags for the Season",
    "Does Fragrance Play A Role In Your Skincare? A Dermat Explains",
    "Shreya Bugde's beautiful photoshoot in Handloom sareestv",
    "11 foods that become bad when refrigeratedLifestyle",
    "Things a wife needs to hear from her husband every dayLifestyle",
    "10 foods that are making your hair weakLifestyle",
    "What gets in the way of intimacy for each zodiac sign?Lifestyle",
    "Vijay Devarakonda's diet and fitness secretsLifestyle",
    "How to make protein-rich Moong Dal Idli at homeFood",
    "From Shah Rukh Khan to Aishwarya Rai: Actors who rejected blockbuster moviesEntertainment",
    "00:01Watch: How to make Moong Chilla with Chutney",
    "04:58Watch: How to make Potli Samosa",
    "01:49Watch: How to make Millet Dahi Kebab",
    "Wrestlers Sakshi, Bajrang resume government duties after meeting Amit Shah",
    "In Pics: Indian batting power up against Australian pace attack",
    "WTC Final: Green in no mood to curb his attacking game",
    "In Pics: Ibrahimovic hangs up his boots at 41",
    "Sindhu, Prannoy eye good show in Singapore",
    "Benzema, Messi reportedly set for Saudi moves",
    "01:08CSK owner N Srinivasan visits Tirupati Temple with IPL Trophy in Chennai",
    "07:23CSK - The 'Kings' of consistency",
    "India must go with two spinners in WTC Final: Panesar",
    "WTC final: Rohit reveals challenges of batting in English conditions",
    "Djokovic edges closer to Grand Slam record with spot in last eight",
    "'Legendary' Benzema strikes on Madrid farewell",
    "Attacking icon Zlatan Ibrahimovic retires from football",
    "1st ODI: Ton-up King helps WI brush aside UAE",
    "Heat level NBA Finals with 111-108 win over Nuggets",
    "BYJU'S Aakash to go public next year",
    "Air India to have 70 new aircraft by March: CEO",
    "'Draft papers for PSU Ireda’s IPO by September’",
    "MapmyIndia CEO: After CCI fine, Google is ‘not infallible’",
    "Most sectors plan to step up capex: CII chief",
    "Former NBCUniversal executive Joe Benarroch to join Twitter",
    "Workers feel at home in office with hybrid",
    "Indian product engineering companies zoom amid IT slowdown",
    "RBI likely to hold repo rate this week as inflation dips",
    "Rupee falls 14 paise to 82.53 against US dollar",
    "Saudi Arabia cuts oil output by 1 million barrels per day to boost sagging prices",
    "FPIs investment hit 9-month high at Rs 43,838 crore in May",
    "India's import of Russian oil scales new high in May",
    "379 infra projects show cost overruns of Rs 4.64 lakh crore in April",
    "6Heart attack risk rises on Monday!",
    "75 foods to keep away from a blender",
    "10What yesteryear actors wore for wedding",
    "14Ways to stop expecting parents to change",
    "10Why people cheat in happy relationships",
    "109 ways to use string lights for decor",
    "Indian American Taral Patel running for county commissioner in Texas",
    "Pramila Jayapal named to top post in US Immigration subcommittee",
    "Indian-American astronaut nominated for appointment as Air Force brigadier gen",
    "Indian-origin man shot dead during armed robbery in US: Report",
    "US: Indian-American arrested for defrauding community members in Ponzi scheme",
    "British Indian entrepreneur conferred Freedom of City of London honour",
    "Indian-origin retired man charged with killing his 77-year-old wife in UK",
    "Indian American Vivek Ranadive bidding to buy ice hockey franchise in Canada",
    "Indian origin professor appointed dean of Alberta School of Business",
    "Indian-Americans stage peaceful rally against legislation on caste-based discrimination",
    "Terms of Use and Grievance Redressal Policy",
    "Slowest Countries In World",
    "World Test Championship Final"
]