[
    "Karnataka Assembly Election Results",
    "World's highest Shiva shrine in Uttarakhand tilting by 6-10°, cause still unknown: ASI",
    "K'taka CM race live: Sidda, DKS to meet Rahul shortly",
    "Why Islamic State failed to make inroads into India",
    "Green hydrogen: Why India is seeing it as a game changer",
    "No Quad meet next week after Biden cancels Australia visit",
    "'Look at EU council regulations': EAM on Russian crude import",
    "Did this talked-about FM pay for talking too much?",
    "Punjab eye big win against DC to keep playoff hopes alive",
    "First-time flyer smokes beedi midair, held at B'luru airport",
    "Here’s how to become a Chief Digital Officer",
    "Shopping: Amazing Discounts On Electronics, Laptops & More...",
    "Rajit Kapur on how to say goodbye to eyeglasses",
    "IAS officer held in Rs 1cr ‘cash for enhancement of work cost’ case",
    "AlUla through the eyes of Janhvi Kapoor",
    "01:30'Dogs disappeared from Munger after JDU president Lalan Singh’s meat-rice party'",
    "00:30OMG! Angry Rashmika reacts after bodyguard pushes fan away",
    "00:58Ananya forgets to remove TAG from her body-hugging dress",
    "03:31India, China hold major general-level talks amid continuing border row",
    "Government: US report on religious freedom biased & motivated",
    "IPL 2023: All playoffs probabilities in 9 points",
    "Theatres dropped 'Kerala Story' due to poor response: TN in SC",
    "Monsoon likely to hit Kerala three days late on June 4: IMD",
    "Amid row with China, India moves to boost conventional missile arsenal",
    "The boxer who grew up training at a graveyard",
    "Teen runs away for love, tops Telangana board Class 12 from shelter",
    "Collegium nominates adv Viswanathan; he could be CJI in 2030",
    "PM: Global CEOs bullish on India, helping boost jobs in private sector",
    "2yrs for Sidda & 3 for DKS? Cong buzz on rotational terms",
    "Dust haze over Delhi-NCR raises PM10 levels up to 10-­fold in 5 hours",
    "Delhi 5-stars can have more than one 24x7 eatery-bar",
    "India for international framework to regulate AI platforms like ChatGPT",
    "Get fit in 6 months or go, Assam cops told",
    "CBI searches 12 locations in case against journalist booked for spying",
    "Siddaramaiah vs DK Shivakumar",
    "Hari Shankar Tewari: A don whose netagiri flourished in successive UP govts over the years",
    "Assam cops given 6 months to get in shape or face axe",
    "Hindutva or target KCR? Telangana BJP split after Karnataka election result",
    "Varanasi court to hear pleas for scientific survey of entire Gyanvapi complex",
    "Hari Shankar Tewari, UP's 1st don-neta, dies",
    "After Mamata Banerjee’s call, SP chief Akhilesh Yadav too pushes for united Opposition",
    "This Amroha man collects 1,100 radio sets inspired by PM Narendra Modi's 'Mann Ki Baat’",
    "'Dogs disappeared from Munger after JDU president Lalan Singh’s meat-rice party'",
    "First-time flyer smokes beedi midair, held at Bengaluru airport",
    "Vande Bharat Exp to Goa may start from next month",
    "Live: Alia spotted with Korean star IU",
    "When John was offered a role in K3G",
    "WATCH: Pari-Raghav's fun banter with family",
    "Celebs who wore White and Ivory at Cannes",
    "Kapil on how men were in love with Mandakini",
    "Is Vijay getting Rs 150 cr for his next?",
    "Sharwanand-Rakshita to marry on June 3",
    "When Rishi did not want to do negative roles",
    "Glam pics of Nushrratt Bharuccha",
    "11 times Mouni Roy gave vacay fashion goals",
    "Nick: Life before Priyanka didn't exist",
    "8 fruits you should not have for breakfast",
    "Gauri Khan is the real Queen of Bollywood",
    "Manushi to debut at Cannes Film Festival '23",
    "Jennifer slams Mandar for defending Asit",
    "Shilpa invests in STI Company",
    "TV actresses who are ageing like fine wine",
    "Adah Sharma's dreamy saree looks",
    "Looks of Priyamani you will fall in love with",
    "Mrunal Thakur slays in saree looks",
    "Pics: Khushi Kapoor gives ethnic vibes",
    "26Keerthy amps up her style game",
    "12Tamannaah & Sara ace their airport look",
    "Bewitching vacay pics of Mouni Roy",
    "30​Adah Sharma updates post accident​",
    "Esha Gupta represents India at Cannes",
    "Lara Dutta's beauty secrets",
    "Shannon K to make debut at Cannes",
    "The Kerala StoryCritic Rating3.0",
    "00:51What! Shraddha Kapoor confesses she would marry someone who loves Vada Pav! Watch",
    "OpenAI CEO tells US senators regulation is 'critical'",
    "New York City converts hotels to shelters as pressure mounts to accommodate asylum seekers",
    "Recession, millions of jobs lost if US defaults: Treasury",
    "US border crossings down by half since rule change: Security chief",
    "Biden administration announces $11 billion for rural clean energy projects",
    "In new Telegram video, CIA urges Russians to leak 'the truth'",
    "US special counsel slams FBI probe of Trump-Russia collusion",
    "Elon Musk must still have his tweets approved by Tesla lawyer, federal appeals court rules",
    "Insurance 'scam' case: CBI searches at nine locations in J&K, Delhi",
    "WHO warns against artificial sweeteners",
    "Will India finally have a dedicated rocket force?",
    "Manipur official: No tribal bias in evictions or in war on drugs",
    "Kerala HC calls for mitigation probe in Jisha, Attingal murder cases",
    "Explainer: Why Delhi is so dusty and NCR choking",
    "Burning Manipur's demographic distribution",
    "Harman’s India engineers are trying to solve a 100-year-old problem",
    "Rahul Gandhi to visit US in first week of June, address NRIs in New York",
    "NIA raids over 100 places across six states in terror-narcotics-smugglers-gangsters nexus cases",
    "Calcutta HC judge modifies his own judgment",
    "'Look at EU council regulations': Jaishankar on import of Russian crude by India",
    "People returning from career breaks help boost talent pool",
    "Split Karnataka CM terms for Siddaramaiah, DK Shivakumar back on table, decision today?",
    "Active Covid cases in India dip to 13,037",
    "Active Covid cases in country dip to 15,515",
    "India reports 1,223 new Covid cases in last 24 hours",
    "Active Covid cases in India dip to 18,009",
    "Active Covid cases in country dip to 21,406",
    "Covid waning fast, weekly cases down 57%",
    "India reports 3,611 new Covid cases, active caseload decreases to 33, 232",
    "2,380 fresh Covid cases in India, active cases drop to 27,212",
    "Active Covid cases in country decline to 14,493",
    "India logs 1,690 Covid infections in a day; active cases below 20,000",
    "02:21Shocking video: PMC Officer kicks stall during anti-encroachment drive in Pune",
    "01:36This Amroha man collects 1,100 radio sets inspired by PM Narendra Modi's 'Mann Ki Baat’",
    "00:51Shraddha reveals she wouldn’t MARRY someone who doesn’t love Vada Pav",
    "00:56EAM Jaishankar responds to EU's Concerns on import of Russian crude by India",
    "01:00Aishwarya gets trolled for wearing sports shoes with fusion dress",
    "00:54Get ready for bridesmaid duties: Parineeti to Priyanka",
    "6Can high blood pressure harm your kidneys?",
    "Nushrratt Bharuccha's curvy figure secrets",
    "3 dinner recipes that aid weight loss",
    "5Esha Gupta's Cannes debut in Nicolas Jebran",
    "Sara Ali Khan walks as 'Princess of Pataudi' at Cannes",
    "Alia Bhatt attends Gucci show in Seoul",
    "6Priyanka Chopra says, “I was a doormat in my previous relationships\"",
    "Zodiacs who're the dominant ones in a relationship",
    "How likely will your zodiac sign cheat?",
    "5Day 1 at Cannes Film Festival saw some beautiful updos",
    "10 home remedies for a super soft skin",
    "Beauty routine of south sensation Keerthy Suresh",
    "15​14 ways to handle sibling fights​",
    "Beautiful baby names starting with 'Ch'",
    "Raising kid who accepts cultural differences",
    "10The art of making perfect dosa batter",
    "Tips to use aluminium foil effectively",
    "Green Bread wins \"Britain’s Best Loaf\" title",
    "Did you know that there is a ‘Bangladesh’ in India too?",
    "The incredibly idyllic world of Kerala’s Munroe Island",
    "This Nepali sherpa is world’s second person to climb Mt Everest 26 times!",
    "Model passes away in a tragic horse-riding accident",
    "Watch out for Miss India '23 finale telecast",
    "Miss Universe Pia Wurtzbach hitched for life",
    "How To Start A Sexting Conversation With Your Crush",
    "#TBT: Highlights From Femina Mamaearth Beautiful Indians Awards 2022",
    "Summer Fun: 5 Exciting Adventures To Add To Your Bucket List",
    "8 fruits you should never have for breakfastLifestyle",
    "10 iconic opening lines from classicsLifestyle",
    "10 fittest beauty queens of IndiaLifestyle",
    "10 looks of Gauri Khan which prove she's the real Queen of BollywoodLifestyle",
    "​6 foods you should avoid combining with curd​Lifestyle",
    "Inside Parineeti and Raghav's roka ceremonyEntertainment",
    "How to make Bengali Mango Fish Curry (Amm diye Macher Tok)Food",
    "9 Times Shehnaaz Gill Slayed With Her SmileEntertainment",
    "05:15Mumbai Street Food Diaries: Pizza Cheese Toast Sandwich",
    "04:02Watch: How to make Nalli Nihari",
    "03:41Watch: How to make Shukto",
    "We lost our way in second half of the innings: Rohit Sharma",
    "Inter win Milan derby to reach Champions League final",
    "Anderson aims to regain full fitness ahead of Ashes",
    "IPL: LSG beat Mumbai Indians to boost their playoff chances",
    "In Pics: LSG edge MI to boost playoff hopes",
    "02:13IPL 2023: Lucknow beat Mumbai to move closer to play-off berth",
    "01:41IPL 2023: Punjab Kings take on Delhi Capitals in crucial clash",
    "I played for my father, he was in ICU for last 10 days: Mohsin",
    "Yashasvi Jaiswal one hell of a talent: Joe Root",
    "Shubman Gill: Tons in Tests, ODIs, T20Is & IPL in same year",
    "'Think City will win UCL title; Liverpool disappointed me'",
    "Pics: Sensational centuries of IPL 2023 so far",
    "When boxer Mohammad Hussamuddin trained at a graveyard!",
    "Wrestlers contemplate shifting protest venue to Ram Lila ground",
    "IndianOil net jumps 67% on higher margins",
    "Airtel profit in Q4 rises 49% to Rs3,000 crore",
    "US investor cuts Swiggy valuation by 34% to $7 billion",
    "Wall Street closes lower after Home Depot outlook, US retail sales",
    "Jio-bp kicks off price war with ‘super’ diesel",
    "Infosys wins $1.5 billion deal from BP",
    "Top EU diplomat seeks action against India on Russian oil ahead of talks",
    "Markets fall for 2nd day running; IT counters drag",
    "Rupee falls 10 paise to 82.35 against US dollar in early trade",
    "IBC ecosystem may get common technology",
    "Career paths divert from one-way routes",
    "PESB leaves next IOC chief’s choice to oil min",
    "Sitharaman advises new recruits to sensitise public about Rozgar Mela scheme",
    "Sebi mulls expanding definition of QIB for debt securities",
    "13How likely will your zodiac sign cheat?",
    "4Green Bread wins Britain’s Best Loaf title",
    "10Gauri Khan is the real Queen of Bollywood",
    "6How to choose right pet breed for your kids",
    "Indian-origin retired man charged with killing his 77-year-old wife in UK",
    "Indian-American astronaut nominated for appointment as Air Force brigadier gen",
    "Indian-origin man shot dead during armed robbery in US: Report",
    "US: Indian-American arrested for defrauding community members in Ponzi scheme",
    "British Indian entrepreneur conferred Freedom of City of London honour",
    "Indian American Vivek Ranadive bidding to buy ice hockey franchise in Canada",
    "Indian origin professor appointed dean of Alberta School of Business",
    "Indian-Americans stage peaceful rally against legislation on caste-based discrimination",
    "Pramila Jayapal named to top post in US Immigration subcommittee",
    "Boat Storm Connect Plus Smartwatch",
    "Features Of Dashboard Camera",
    "Chat GPT for Graphic Designers",
    "Terms of Use and Grievance Redressal Policy",
    "Siddarmaiah vs DK Shivakumar"
]