[
    "Karnataka Assembly Election Results",
    "00:52Bharat Jodo impact: Rahul Gandhi rise & victory trail",
    "Consolidation of Muslim votes ensured big win for Cong",
    "Explained: 'Constitutional declaration' in same-sex union",
    "How these cab drivers are driving change in the urban jungle",
    "Yogi­-powered BJP sweeps all 17 mayoral polls in UP",
    "IPL 2023 playoffs race: One team out, 9 others vying for 4 spots",
    "Will India not help the US in a war with China?",
    "K'taka results live: Cong legislature party meet today",
    "WhatsApp international call scam: Things you need to watch out for",
    "This Mother's Day, colour the walls with your kid",
    "Shopping: Amazing Discounts On Electronics, Laptops & More...",
    "Rajit Kapur on how to say goodbye to eyeglasses",
    "K'taka won, tough CM call for Cong: Sidda or DKS?",
    "‘Karenge Poore,Sapne Adhoore’ the CSR initiative of Indo count",
    "00:55Parineeti Chopra-Raghav Chadha engaged! Ranveer, Anushka, others send wishes",
    "00:56At 42 Shweta Tiwari poses in BOLD outfit; TROLLS call her 'BESHARAM'",
    "Apple Mac mini (M2) review: Good things come in small packages",
    "04:02Karnataka results 2023: Did switching parties work for turncoats?",
    "Not sure if WhatsApp is using microphone in background?",
    "CSK aim to beat KKR to sustain push for a top-two berth",
    "Mother's Day: Google creates doodle to celebrate motherhood",
    "Do-or-die clash for Rajasthan Royals and Royal Challengers Bangalore",
    "Another student from Gujarat found dead in Toronto",
    "Man shoots at son for opposing firing",
    "Karnataka elections: Biggest win for any party in state since 1989; Congress 136, BJP 65",
    "UP polls: NDA gets 1st Muslim MLA in UP",
    "Haryana cos with 5k staffers can now serve liquor",
    "Karnataka polls: In Bengaluru, 15 for BJP & 12 for Congress",
    "India’s ‘biggest’ drug haul: NCB, Navy seize meth worth Rs 15k cr",
    "Karnataka polls: Congress fielded 46 Lingayats, 37 won",
    "Karnataka elections: Winners and losers",
    "Karnataka results: How Congress stalled BJP's quota move",
    "Karnataka Election Results 2023",
    "UP Municipal Election Result 2023",
    "Bangalore Election Results 2023",
    "Happy hours at office: Haryana companies with 5,000 staffers can now serve liquor",
    "Mother's Day: Amid a storm of sneer & opposition from kin, these moms stood by their queer kids",
    "Karnataka story is the beginning of the end for BJP: Mamata Banerjee",
    "11 years after brawl, Saif Ali Khan to be tried for hurting witness too",
    "Testing times: Homes razed, students in Tughlaqabad stare at uncertain future",
    "Rooftop garden: How these cab drivers are driving change in the urban jungle",
    "Heli tickets for Kedarnath reserved till May 27",
    "Breach of Azam Khan’s fortress gives NDA its 1st Muslim MLA in UP",
    "Kumar Sanu: Today music lacks good heroes - #BigInterview",
    "SLB: Have inherited mom's determination",
    "Kalki: I don’t think money is everything",
    "Meet Bollywood’s super moms!",
    "Life post marriage has been beautiful: Disha Parmar",
    "Video: Raghav kisses Parineeti Chopra",
    "Farhan is finishing the script of 'Don 3'",
    "Those trolling Ileana get schooled",
    "Times when Parineeti looked stunning in sarees",
    "Inside pic: Parineeti, Raghav perform ardas",
    "Parineeti, Raghav share first pics of engagement",
    "75+ Mother's Day messages for 2023",
    "Guests at Parineeti-Raghav's engagement",
    "Nandini Gupta crowned Miss India 2023",
    "My daughter is my biggest support: Shubhangi Atre",
    "Excl! Rashmeet on facing her fears in KKK 13",
    "Mouni shows off her figure from her vacation",
    "Heartwarming Films to Celebrate Mother's Day",
    "Mimi Chakraborty's jaw-dropping saree looks",
    "BTown's new moms in pictures",
    "Parineeti and Raghav’s engagement",
    "Guests at Parineeti's engagement",
    "Sonam Bajwa raises temperatures",
    "Amyra turns heads in lehengas",
    "Avantika Dassani’s ethnic looks",
    "40#EtimesTrendsetters: Madhuri Dixit",
    "60Simone Ashley slays in Versace",
    "24Ileana D'Cruz shows off her baby bump",
    "The Kerala StoryCritic Rating3.0",
    "One dead as tornado hits south Texas town near the Gulf coast",
    "Migrants rush across US border in final hours before Title 42 expires​",
    "US will continue to monitor situation in Pakistan closely, says official",
    "Migrants rush across US border in final hours before Title 42 expires",
    "Democratic lawmaker tables bill to end country quota for Green Card in US",
    "US borders 'are not open' as migration rules change: Official",
    "Border appears calm after lifting of pandemic asylum restrictions",
    "US 'doomsday' mother found guilty of murdering children",
    "In Trump and Bragg show US is witnessing a new low",
    "California State Senate passes caste discrimination bill",
    "Active Covid cases in country dip to 15,515",
    "Karnataka elections: From PM, a thank you & congrats",
    "Double engine that powered Congress quest in Karnataka",
    "Karnataka: Congress vows to roll out 5 guarantees in 1st cabinet meet",
    "‘PM Modi not invincible’: How opposition read Karnataka verdict",
    "Karnataka battle won, Congress now faces tough choice between Siddaramaiah & Shivakumar",
    "Assam Rifles men attacked, 2nd time in 3 days in Manipur",
    "11 years after brawl, Saif to be tried for hurting witness too",
    "BJP's vote-share rises in UP mayor polls; SP, Congress fail to open accounts",
    "Karnataka elections: Will repeat this feat in every state, says Rahul Gandhi",
    "Consolidation of Muslim votes ensured big win for Congress in Karnataka",
    "OBC quota: How Congress cleverly sidestepped BJP’s polarisation trap in Karnataka",
    "Karnataka elections: Congress hits back with ‘BJP-mukt south’ jibe at saffron camp",
    "India adds 1,839 Covid infections, active cases down to 25,178",
    "Active Covid cases in India decrease to 30,041",
    "India records 3,720 new Covid-19 cases",
    "India reports 7,171 new cases of Covid-19 in 24 hours, active case declines to 51,314",
    "India logs 9,355 fresh Covid infections; active cases dip to 57,410",
    "India reports 1,223 new Covid cases in last 24 hours",
    "Active Covid cases in India dip to 18,009",
    "Active Covid cases in country dip to 21,406",
    "Covid waning fast, weekly cases down 57%",
    "05:05Rooftop garden: How these cab drivers are driving change in the urban jungle",
    "04:02Did switching parties work for turncoats?",
    "00:34Newly engaged Parineeti Chopra-Raghav Chadha walk hand in hand",
    "04:45Congress wins Karnataka. Who will be the next Chief Minister?",
    "01:41Paparazzi ask Urfi Javed about Karnataka poll results. Watch her reaction!",
    "00:59'Moh Moh Ke Dhaage' singer Papon in hospital; drops emotional post",
    "6Why women miss risks of heart disease",
    "Woman's nails started peeling after manicure",
    "​5 high-risk sexual behaviors to avoid",
    "10B-Town's most stylish mother-daughter duos",
    "Guests at Parineeti-Raghav's engagement ceremony",
    "Parineeti and Raghav slay in stylish engagement pictures",
    "109 ways to get out of a toxic relationship",
    "Weekly horoscope: 15th to 21st May",
    "Expert decodes Adar & Natasha Poonawalla’s relationship",
    "1210 beauty lessons to take from Parineeti Chopra",
    "Meet KKR captain Nitish Rana's beautiful wife Saachi Marwah",
    "Best hairstyles of The Kerala Story actor Adah Sharma",
    "108 successful mother-child duo in business",
    "Mother's Day Wishes, Messages and Quotes",
    "Mother's Day 2023: Cards, Greetings, Pictures and GIFs",
    "108 tips for making the perfect pizza",
    "15 foods that have more fibre than apple",
    "This Korean glass skin facepack is all things edible",
    "Delhi’s famous old Yamuna Bridge to be replaced after 25 years!",
    "From golds to reds: Embrace the beauty of New Zealand's autumn",
    "Model passes away in a tragic horse-riding accident",
    "Watch out for Miss India '23 finale telecast",
    "Miss Universe Pia Wurtzbach hitched for life",
    "Learn All About Obsessive Love Disorder",
    "#BeautifulIndians:  Season 2 Of Femina Mamaearth",
    "How To Make Your Beauty Routine More Sustainable",
    "Virtual tour of UK PM Rishi Sunak’s propertiesLifestyle",
    "Pics that prove Madhubala was way ahead of her time in fashionLifestyle",
    "Yami Gautam breaks the internet with gorgeous saree look",
    "10 fittest beauty queens of IndiaLifestyle",
    "5 foods you should never combine with mangoLifestyle",
    "12 habits of fathers who raise confident kidsLifestyle",
    "Amala Paul's breathtaking saree looks every Bong girl can copyEntertainment",
    "11 foods that have more iron than spinachFood",
    "Mother's Day Special: Blackberry Chocolate Cake",
    "03:07Watch: How to make Matera Hara Pyaz",
    "06:16Watch: How to make Gluten-Free Bajra Pizza",
    "04:02Watch: How to make Kosha Mangsho",
    "03:54Do-or-die clash for Rajasthan Royals and Royal Challengers Bangalore",
    "IPL: Jonty says Prerak was 'hit on the head' by unruly SRH crowd",
    "IPL: Prabhsimran, Brar keep Punjab alive, Delhi out of playoffs race",
    "In Pics: Punjab Kings beat Delhi Capitals to boost play-off hopes",
    "IPL: Mankad, Pooran, Krunal keep LSG in play-off hunt",
    "01:48Prabhsimran, Brar shine as Punjab Kings end Delhi Capitals' IPL hopes",
    "01:39IPL 2023: CSK eye two points to improve play-off chances against KKR",
    "IPL playoffs race: One team out, 9 others vying for 4 spots",
    "IPL: Warner laments poor DC batting, Dhawan lauds Prabhsimran",
    "Unruly Sunrisers fans halt proceedings after 'umpiring howler'",
    "In T20s, if you don't take risk, there is no reward: Pooran",
    "Messi jeered on return as PSG hammer Ajaccio",
    "Inter win, Milan slump in Serie A ahead of CL semifinal date",
    "EPL: Man United beat Wolves 2-0 to consolidate fourth spot",
    "Rotated Real Madrid side beat Getafe, Villarreal cut gap on Real Sociedad",
    "2 Adani companies set to raise Rs 21,000 crore from share sales via QIP route",
    "April inflation validates RBI's repo rate pause move: SBI Research",
    "Adani to raise Rs 21,000 crore from share sale in two group companies",
    "D-Mart's Q4 net profit up 7.8% to Rs 460.1 crore, revenue up 20.5% to Rs 10,594 crore",
    "Go First fallout: Lessors file plea to repossess 5 SpiceJet planes this week",
    "No regulation without discussion: Power ministry to CERC",
    "Mcap of 8 of top 10 valued firms soars Rs 1.26 lakh crore",
    "Mutual funds' NFO collection drops 42% to Rs 62,342 crore in FY23",
    "Plea to repossess 2 more SpiceJet planes",
    "Bring surrogacy under insurance cover: Regulator",
    "Bankruptcy recoveries on the rise",
    "Foxconn’s Liu says India has labour cost advantage",
    "US stocks: Wall Street closes lower in risk-off mode",
    "Sweet medicine: Price of drug going off patent to drop 50%",
    "10Nitish Rana's beautiful wife Saachi Marwah",
    "10B-Town's stylish mother-daughter duos",
    "10JK Rowling's favourite books",
    "104 letter foods healthy for your body",
    "10Madhubala was ahead of her time in fashion",
    "116 foods you should avoid having with beer",
    "Indian-origin retired man charged with killing his 77-year-old wife in UK",
    "Indian-American astronaut nominated for appointment as Air Force brigadier gen",
    "Indian-origin man shot dead during armed robbery in US: Report",
    "US: Indian-American arrested for defrauding community members in Ponzi scheme",
    "British Indian entrepreneur conferred Freedom of City of London honour",
    "Indian American Vivek Ranadive bidding to buy ice hockey franchise in Canada",
    "Indian origin professor appointed dean of Alberta School of Business",
    "Indian-Americans stage peaceful rally against legislation on caste-based discrimination",
    "Pramila Jayapal named to top post in US Immigration subcommittee",
    "Facebook friend request bug",
    "Terms of Use and Grievance Redressal Policy",
    "Parineeti Chopra Engagement News",
    "Karnataka Election Result Live",
    "UP Municipal Election Result Live",
    "Bangalore Election Result 2023",
    "Varuna Constituency Result",
    "Mysore Constituency Result",
    "Ramanagara Constituency Results",
    "BTM Layout Constituency Result",
    "Kanakapura Constituency Result",
    "Channapatna Constituency Result",
    "Hassan Constituency Result"
]