[
    "Mumbai Covid scam: ED raids IAS officer, close aide of Aaditya Thackeray",
    "India slams China over 26/11 planner Sajid Mir row",
    "5 money choices that young earners must get right",
    "Cricket kills: Kanpur teen strangles boy who bowled him",
    "Ashes 2023: Cometh the hour, 'Cummins' the man",
    "Live: PM Modi addresses G20 Tourism Ministers Summit in Varanasi",
    "Why a revolution in cancer treatment may be within reach",
    "Kerala instructs registrars not to ask religions of bride & groom",
    "Live: PM Modi to lead Yoga session at UN HQ",
    "Rajit Kapur on how to say goodbye to eyeglasses",
    "Shopping: Big Discounts & Coupons on Great Products You Can't Miss",
    "AlUla through the eyes of Janhvi Kapoor",
    "Elon Musk meets Modi, says Tesla will be in India",
    "Last day today! Get 1 year of TOI+ at 40% off. Hurry!",
    "04:37Kejriwal steps up attack on Centre, writes to Opposition leaders",
    "02:03Rare picture! Dharmendra poses with 1st wife",
    "02:09Salman Khan calls katrina Kaif ‘Biwi’ in THIS viral video",
    "Australia pull off their highest successful chase in 75 years",
    "What PM said in his International Day of Yoga message",
    "Titanic tourist sub missing: Underwater noises detected",
    "Senthil Balaji undergoes bypass surgery in Chennai hosp, stable",
    "Top 10 popular scooters in May 2023",
    "India's Lithium hope: How significant is the find?",
    "Raj man hands over to court 280kg of coins for Rs 55k alimony",
    "Andhra: Preacher chains, repeatedly ‘rapes’ minor at ashram",
    "'Test cricket at its best': Twitter abuzz after Australia edge England",
    "Live: Yoga Day event in Surat set new Guinness world record",
    "UN rebuffs critics of yoga, backs PM Modi's outreach",
    "In Pics: Cummins the hero as Australia edge England",
    "Watch: PM Modi gets rousing welcome in New York",
    "Top10: Why rice is a boiling issue between Karnataka and Centre",
    "Ashes: Cummins leads Australia to thrilling win over England",
    "Elon Musk on why Twitter has to 'obey' what governments say",
    "Titanic Submersible Missing",
    "Hyderabad Flyover Collapse",
    "In UP, 17-year-old strangles boy for bowling him out during cricket match",
    "Uttarakhand: CISF man takes over as drunk bus driver passes out, saves 55",
    "Andhra Pradesh: Preacher chains, repeatedly ‘rapes’ minor at ashram, held",
    "Vendor mints coin 'charade' for Rs 55,000 alimony, court seeks 55 bags of Rs 1,000 each",
    "Ahmedabad: Yoga teachers transcend religious boundaries",
    "CM Yogi Adityanath performs yoga in Gorakhpur",
    "Former President Ram Nath Kovind performs Yoga in Delhi",
    "Latest news updates from cities",
    "Ranveer borrowed his mom’s earrings for RARKPK",
    "Saif and Jeh enjoy a Yoga session with Bebo",
    "Tamannaah refers to Vijay as ‘Prince’",
    "Bollywood's most iconic saree looks",
    "TV actresses who had premature babies",
    "Did Prabhas rent his Villa in Italy for 40 lakhs?",
    "Why Gadar 2 couldn't be made for 22 years?",
    "It's a wrap for 'Chandramukhi 2' - See PIC",
    "Who said what about Adipurush controversy",
    "‘Pasoori’ remake for ‘Satyaprem Ki Katha’",
    "Esha showers love on Karan and Drisha",
    "10 yoga asanas for a healthy liver",
    "Things I gave up for a stronger marriage",
    "Model celebrates pride month with nude shots",
    "Dipika and Shoaib blessed with a baby boy",
    "Krushna on Kartik's Rs 4 crore car purchase",
    "Nia is living the Hollywood dreams; pics",
    "Madhuri Braganza’s flawless snapshots",
    "Nayanthara's unbelievably chic style",
    "Pics: Sanya beats the heat in bikini",
    "Celeb-approved outfits for beach holiday",
    "Rashmika slays in stylish workwear",
    "Malaika's fitness routine in pictures",
    "391Alaya F's bewitching pictures",
    "25Malaika looks easy-breezy in green",
    "Palak exudes desi girl vibes, see pics",
    "Red carpet look by Tejasswi Prakash",
    "Huma stuns in a green co-ord set",
    "02:19Urfi Javed covers her MODESTY with yet another bizarre top- WATCH IT",
    "02:07Pictures finally out! Sunny Deol's wife Pooja Deol posing with Karan Deol and Drisha Acharya",
    "China lashes back as US President Joe Biden labels Xi Jinping a 'dictator'",
    "PM Modi arrives in New York on first leg of State visit to US",
    "Dozens of US lawmakers urge President Biden to raise rights issues with PM Modi",
    "\"Yoga has its foundation in India\": Co-founder of \"Yoga in Times Square\"",
    "US remains deeply confident in India's diversification of defence equipment: Pentagon",
    "Joe Biden calls Chinese President Xi Jinping a dictator",
    "International Yoga Day: Why it is India's pride across the world",
    "Former US NSA calls PM Modi a 'global leader', says big challenge for US and India is 'China'",
    "'What Elon Musk said, reveals a lot about India, PM Modi: Union Minister Anurag Thakur",
    "Yoga now a global movement: What PM Modi said in his International Day of Yoga message",
    "Biparjoy: How PM Modi emerged as Dhirodatta, says MP CM Shivraj Singh Chouhan",
    "India slams China for blocking proposal to designate 26/11 planner Sajid Mir 'global terrorist'",
    "Modi meets parade of intellectuals, business leaders, health experts in US",
    "'Yoga not just few asanas...,' Rajnath Singh on International Yoga Day in Kerala",
    "Day one of PM Modi's first state visit to US",
    "International Yoga Day: Anurag Thakur performs Yoga in Himachal Pradesh's Hamirpur",
    "Covid-19: India records 96 fresh cases, active case tally down to 2,017",
    "Active Covid cases in country dip to 4,972",
    "India's active Covid case tally down to 5,259",
    "India reports 490 new Covid cases in last 24 hours; active caseload dips to 5,707",
    "India reports 535 new Covid cases; active caseload declines to 6,168",
    "Active Covid cases in country dip to 7,104",
    "Active Covid cases in country dip to 3,001",
    "India logs 174 new Covid-19 cases",
    "Covid-19: India records 237 fresh cases, active caseload declines to 3,502",
    "Active Covid cases in country dip to 4,709",
    "04:59Will the Congress pay political price for its criticism of Gita Press?",
    "02:22Watch: 'The Kerala Story' actress Adah Sharma performs ‘Rope Yoga’",
    "02:01Adipurush's scene a 'copy-paste' version of The Avengers?",
    "03:12Are women equally prone to heart diseases as men? A heart surgeon explains.",
    "02:03'I was a drug addict and ill-tempered': Naseeruddin Shah",
    "03:10Adipurush row: 'This whole team should be burnt'",
    "8Vitamin D deficiency: 5 signs to know",
    "Yoga Day: 9 pranayama breathing techniques",
    "Medical conditions that can affect the young",
    "10Best dressed celebs at Karan- Drisha's wedding reception",
    "Tamannaah Bhatia is making a case for corset tops",
    "Dhruv Kapoor on his Milan Fashion Week SS'24 showcase",
    "10What profession should you have as per D.O.B",
    "Zodiacs who're afraid to confess their feelings",
    "1310 oils which help baby hair to grow faster",
    "10 drinks that can detox the skin",
    "All about Saif Ali Khan's Lankesh portrayal in Adipurush",
    "14Things only grandparents can teach better",
    "10 popular baby girl names in Australia",
    "10 baby names derived from the 'moon'",
    "10Eating food in this yoga posture boosts digestion and strength",
    "Leaves used for serving food and their benefits",
    "Have you heard of Beer Yoga?",
    "Visit the second-largest Tibetan settlement in the world outside Tibet",
    "India's coolest mountain breaks",
    "International Yoga Day: India’s famous yoga destinations",
    "Trans beauty queen celebrates pride month with nude shots",
    "Beauty queen found dead inside her home",
    "Miss Influencer Facebook Challenge begins!",
    "Meet The Custodian Of Maharashtrian Food: Saee Koranne Khandekar",
    "Last Minute Gift Ideas To Make Your Dad Feel Special",
    "Elevate Your Style With Tecno Camon 20 Series",
    "16 vegetarian sources of vitamin EFood",
    "Malaika Arora's 4-ingredient morning drink is perfect for weight loss and immunityFood",
    "Most iconic saree looks created by Bollywood beauties on-screen!Entertainment",
    "Things I gave up for a stronger marriageLifestyle",
    "10 most popular baby girl names in AustraliaLifestyle",
    "15 foods that are rich in Omega-3Food",
    "Best dressed celebrities at Karan Deol- Drisha Acharya's wedding receptionLifestyle",
    "India is world’s most picturesque country, reveals researchTravel",
    "02:22Watch: How to make Papanasam Pal Koottu",
    "02:36Watch: How to make Vetrilai Nattukozhi",
    "03:41Watch: How to make Shukto",
    "India beat Bangladesh by 31 runs to win Women's Emerging Asia Cup",
    "'I continued to fight till the end': How Bhavani beat the reigning World champion",
    "Ashes: Australia, England fined for slow over-rates",
    "03:47Grand Moscow Regatta in Russia",
    "09:31Another WTC Final, another loss for Team India",
    "SAFF C'ship: Pakistan arrive in batches due to ticket unavailability",
    "Stokes devastated but confident in England's aggressive approach",
    "Ronaldo hits late Portugal winner on 200th cap against Iceland",
    "Pat Cummins hails Ashes opener victory as 'number one' in his Test career",
    "Live Score: Ireland vs Scotland, World Cup Qualifiers",
    "Live Score: Oman vs UAE, ICC World Cup Qualifiers",
    "SAFF Championship: When and where to watch IND vs PAK clash",
    "Usman Khawaja's composure shines in an unpredictable Ashes Test",
    "Twitter employees sue social media company over bonuses they say weren't paid despite promises",
    "Rupee falls 1 paisa to 82.10 against US dollar",
    "Air India signs pacts with Airbus, Boeing to buy 470 planes",
    "Apollo expands advanced colorectal robotic surgery programme",
    "DBS Bank India reports 36 pc jump in FY23 net at Rs 228 cr",
    "Nandan Nilekani donates Rs 315 crore to IIT Bombay",
    "Sensex hits record high of 63,588.31 in early trade",
    "Wilful defaulter norms in place since 2007: RBI",
    "Govt clears Rs 22,000cr Micron investment for chip project",
    "Government signs MoU with AirBnB to promote tourism",
    "APM Terminals at Pipavav gets call from CCG Service, under Sagarmala Project",
    "Space awareness firm Digantara secures $10-million funding",
    "Alibaba announces new CEO and chairman in surprise reshuffle",
    "7All about special ​\"Modi ji thali\"",
    "14Things grandparents can teach better",
    "6​5 timeless books by Victor Hugo",
    "54 best pieces of advice from Bill Gates",
    "10Wedding procession of Karan Deol",
    "Indian American Taral Patel running for county commissioner in Texas",
    "Pramila Jayapal named to top post in US Immigration subcommittee",
    "Indian-American astronaut nominated for appointment as Air Force brigadier gen",
    "Indian-origin man shot dead during armed robbery in US: Report",
    "US: Indian-American arrested for defrauding community members in Ponzi scheme",
    "British Indian entrepreneur conferred Freedom of City of London honour",
    "Indian-origin retired man charged with killing his 77-year-old wife in UK",
    "Indian American Vivek Ranadive bidding to buy ice hockey franchise in Canada",
    "Indian origin professor appointed dean of Alberta School of Business",
    "Indian-Americans stage peaceful rally against legislation on caste-based discrimination",
    "Airtel Payments Bank Health Insurance",
    "Terms of Use and Grievance Redressal Policy",
    "England vs Australia Highlights",
    "2nd PUC Supplementary Result 2023",
    "Submarine Underwater Sounds",
    "International Yoga Day 2023",
    "Bigg Boss OTT 2 Contestant",
    "Rocky Aur Rani Kii Prem Kahaani"
]