[
    "The Babylon Bee + \n@elonmusk\n at Twitter HQ\n\nTOMORROW. Premiering exclusively on Twitter.",
    "Powerwall is one of the best products I've ever purchased. Nothing but sunny blue skies for over a week, yet power is out for 5k+ customers.\n\nCheck out more details of my \n@Tesla\n Powerwall experience here https://youtu.be/DA3fRMm3a0c",
    "Lil X just asked if there are police cats, since there are police dogs ",
    "Congratulations to Giga Shanghai & Tesla China SDS teams for their excellent work overcoming many obstacles over many years!!",
    "38 astronauts to orbit so far!",
    "Another step closer to Mars — the first flight test of a fully integrated Starship and Super Heavy rocket",
    "Thank you to Tesla owners for making Model Y the world’s bestselling car in Q1 this year!",
    "Lot of noise about \n@RonDeSantis\n announcing & discussing his Presidential bid on this platform. \n\nBut you what isn’t noise? Setting an all-time record for fundraising!\n\nWorth considering for announcements in general.",
    "Coming soon: More locations to charge your Ford® electric vehicle. Thousands of them. \n@Tesla\n   https://ford.to/FordTeslaEVCharging…",
    "Excited to welcome Ford owners to thousands of Superchargers across North America next year",
    "Congratulations Neuralink team!",
    "Starlink helping to connect schools in Rwanda ",
    "AKA, don’t pull out. \n@elonmusk",
    "",
    "I hope this platform increasingly brings you joy & elucidation",
    "Falcon 9 and Dragon vertical at 39A; targeting Sunday, May 21 at 5:37 p.m. ET for launch of Ax-2 → http://spacex.com/launches/mission/?missionId=ax-2…",
    "AI ",
    "3 Falcon 9 rockets on 3 SpaceX launch pads → http://spacex.com/launches",
    "I recommend subscribing to \n@shellenberger",
    "Starlink on Siargao Island in the Philippines  \n\n: \n@buddhasiargao",
    "Over one-third of secondary schools and two-thirds of primary schools around the world are not connected to the internet.\n\nOn the isolated island of Pangan-an in the Philippines, Starlink was set up to support 700+ elementary and high school students → http://sunstar.com.ph/article/1961567/cebu/local-news/satellite-connects-isolated-cebu-island-to-the-internet…… Show more",
    "Walter is incredibly thorough in his research. Highly recommend his other books!",
    "Happens a lot",
    "Was the Internet Archive manipulated for nepotistic reasons?",
    "Extremely destructive if accurate",
    "Explaining Constitutional Amendments",
    "If AGI is almost here, why doesn’t autocorrekt work!?",
    "Raptor V3 just achieved 350 bar chamber pressure (269 tons of thrust). Congrats to \n@SpaceX\n propulsion team!\n\nStarship Super Heavy Booster has 33 Raptors, so total thrust of 8877 tons or 19.5 million pounds.",
    "When you have Starlink on your ship, not only can you stay connected while on the vast majority of the Earth’s oceans and seas, but apparently it’s also easier to find sunken treasure → http://yachtworld.com/research/yacht-wifi-revolutionizes-sunken-treasure-discovery/…",
    "As soon as \n@LindaYacc\n is ready, we will do a Spaces where you can ask us anything"
]