[
    "Every parent should watch this",
    "Dagan Shani has IMHO made the most important film of the year -  about the harsh #AI truth:",
    "Starlink on Igloolik Island in the northern territory of Nunavut, Canada ",
    "BREAKING: \n@Tesla\n says ALL new Model 3 vehicles in the US now qualify for the full $7,500 EV tax credit, meaning the Model 3 now starts at $32,740 (with incentives). In some states, you can get it for under $30k.\n\nBefore, the RWD and Long Range versions only qualified for $3,750.",
    "Regenerative braking enables you to bring your Tesla to a complete stop without using the brake pedal, maximizing efficiency & reducing wear & tear\n\nAlso, traction & stability controls are active during regen, giving you more control during deceleration",
    "Deployment of \n@Arabsat\n BADR-8 confirmed",
    "Falcon 9’s first stage has landed the Just Read the Instructions droneship",
    "Watch Falcon 9 launch Dragon and Ax-2 to the \n@space_station\n → http://spacex.com/launches/mission/?missionId=ax-2…",
    "Sharing another update on the changes we’ve made to our open source repos this week and a preview of what’s next ",
    "Great statement by \n@votetimscott\n!",
    "Ending the digital divide requires making devices more accessible. \n\nStarlink kits are designed to include everything needed to connect. And they travel well too ",
    "One hell of a plasma beam!",
    "Second-gen satellites represent a step forward in Starlink capability with key technologies to provide ~4x more capacity per satellite than earlier iterations.\n\nThis means Starlink can provide more bandwidth with increased reliability and connect millions of more people around… Show more",
    "Watch Falcon 9 launch the Iridium OneWeb mission to orbit → http://spacex.com/launches",
    "Watch Falcon 9 launch 22 \n@Starlink\n satellites to orbit → http://spacex.com/launches",
    "Liftoff!",
    "Spaces interview with \n@davidfaber\n starting now",
    "Tesla shareholder meeting underway",
    "As more satellites & ground stations are added, latency & jitter will improve. Goal is <20ms latency.",
    "Soros reminds me of Magneto",
    "Tesla Powerwall does the seem for individual homes (if you have the backup switch installed)\nhttp://Tesla.com/Powerwall",
    "We are today sharing an update on our approach in Turkey.\n\nWe were in negotiation with the Turkish Government throughout last week, who made clear to us Twitter was the only social media service not complying in full with existing court orders.\n\nWe received what we believed to be… Show more",
    "Starlink enables greater access to healthcare and medical services, especially for those in remote locations.\n\nThanks to the \n@PolarisProgram\n, this \n@StJude\n hospital in the Philippines is better connected with researchers and doctors worldwide ",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    " Happy Mother’s Day! ",
    "Poetry with quill  \nWritten on rose  \nWith my blood ",
    "\"The most reliable way to predict the future is to create it.\"\n- Abraham Lincoln",
    "Also, which kind of bat – fruit eating bat or insect eating bat ?",
    "Vote at the 2023 Tesla Shareholder Meeting →",
    "The spice must flow"
]