[
    "As Chair of the National Space Council, I am thrilled to announce the public opening of \n@NASA\n's Earth Information Center (EIC).\n\nLeveraging 60 years of space-based Earth observation, the EIC will use life-saving data to tackle the climate crisis at home.\nhttps://gis.earthdata.nasa.gov/portal/apps/sites/#/earth-information-center…",
    "Spaceship update! \n@SpaceX\n's Dragon spacecraft for the uncrewed #CRS28 cargo mission is scheduled to undock from the \n@Space_Station\n at 12:05pm ET (1605 UTC) on Thursday, June 29, with splashdown early Friday morning. Here's the full timeline: https://go.nasa.gov/3NLmWCi",
    "As Chair of the National Space Council, I am thrilled to announce the public opening of @NASA's Earth Information Center (EIC).\n\nLeveraging 60 years of space-based Earth observation, the EIC will use life-saving data to tackle the climate crisis at home.\nhttps://gis.earthdata.nasa.gov/portal/apps/sites/#/earth-information-center…",
    "Spaceship update! @SpaceX's Dragon spacecraft for the uncrewed #CRS28 cargo mission is scheduled to undock from the @Space_Station at 12:05pm ET (1605 UTC) on Thursday, June 29, with splashdown early Friday morning. Here's the full timeline: https://go.nasa.gov/3NLmWCi",
    "Enceladus, Saturn's icy moon, is known for its geysers that erupt with water from a subsurface ocean. \n\nScientists have just detected phosphorus—an uncommon element that's a key building block for life—in the plumes that these geysers spray: https://go.nasa.gov/43FVtY1",
    "LIVE: Steve Bowen and \n@Astro_Woody\n are installing a new roll-out solar array outside the \n@Space_Station\n.\n\nToday's spacewalk is scheduled to start around 8:55am ET (1255 UTC) and run for six hours.",
    "Watch the \n@Space_Station\n's new roll-out solar array begin to unfurl in a process that takes about 12 minutes to complete. This is the helmet camera view from astronaut Steve Bowen:",
    "Another spacewalk in the books! \n\nToday’s spacewalk concluded at 2:17pm ET (1817 UTC) and lasted 5 hours and 35 minutes. Steve Bowen and \n@Astro_Woody\n installed a new roll-out solar array and completed numerous additional tasks outside the \n@Space_Station\n.",
    "Spacewalkers Steve Bowen and \n@Astro_Woody\n have successfully installed the roll-out solar array and released hinge bolts. The duo will move on to work-ahead tasks as they wait for the next eclipse to unfold the solar array. Watch live... http://nasa.gov/live",
    "Astronauts-eye view \n\nTake a look through the helmet cams of \n@Astro_Woody\n and Steve Bowen as they prepare to install a roll-out solar array during today's spacewalk.",
    "Astronauts Frank Rubio and \n@Astro_Alneyadi\n are closing the hatch in the \n@Space_Station\n's Quest airlock as Steve Bowen and \n@Astro_Woody\n prepare to step outside for today's spacewalk.",
    "Suits are set to battery power and today's spacewalk is underway!\n\nThis is Hoburg's second spacewalk and Bowen's 10th—tying a record for most spacewalks made by a U.S. astronaut.",
    "In collaboration with \n@GoogleArts\n, \n@NASAGoddard\n scientist Dr. Heather Graham sits down with \n@Astro_Kobi\n to discuss how we find answers to the age-old question: Is there life beyond Earth?",
    "LIVE: Steve Bowen and @Astro_Woody are installing a new roll-out solar array outside the @Space_Station.\n\nToday's spacewalk is scheduled to start around 8:55am ET (1255 UTC) and run for six hours.",
    "Watch the @Space_Station's new roll-out solar array begin to unfurl in a process that takes about 12 minutes to complete. This is the helmet camera view from astronaut Steve Bowen:",
    "Another spacewalk in the books! \n\nToday’s spacewalk concluded at 2:17pm ET (1817 UTC) and lasted 5 hours and 35 minutes. Steve Bowen and @Astro_Woody installed a new roll-out solar array and completed numerous additional tasks outside the @Space_Station.",
    "Spacewalkers Steve Bowen and @Astro_Woody have successfully installed the roll-out solar array and released hinge bolts. The duo will move on to work-ahead tasks as they wait for the next eclipse to unfold the solar array. Watch live... http://nasa.gov/live",
    "Astronauts-eye view \n\nTake a look through the helmet cams of @Astro_Woody and Steve Bowen as they prepare to install a roll-out solar array during today's spacewalk.",
    "Astronauts Frank Rubio and @Astro_Alneyadi are closing the hatch in the @Space_Station's Quest airlock as Steve Bowen and @Astro_Woody prepare to step outside for today's spacewalk.",
    "In collaboration with @GoogleArts, @NASAGoddard scientist Dr. Heather Graham sits down with @Astro_Kobi to discuss how we find answers to the age-old question: Is there life beyond Earth?",
    "How do places on Mars get their name? \n\nMore than 2,000 locations on the Red Planet have official names, recognizing places on Earth, explorers, and even cartoon characters. Learn what inspires names for Martian hills, craters, and rocks: https://go.nasa.gov/3CmCYMm",
    "Later this month, we're opening the Earth Information Center—a hybrid exhibit that offers an interactive look at our changing planet.\n\nMedia are invited to a ribbon-cutting ceremony on Wednesday, June 21, at NASA Headquarters in Washington: https://go.nasa.gov/43STHT7",
    "In the early universe, the gas between stars and galaxies was opaque – energetic starlight could not penetrate it. But 1 billion years after the big bang, the gas had become completely transparent. Why? New data from \n@NASAWebb\n has pinpointed the reason: https://go.nasa.gov/3qCcOmn",
    "Scientists detected a gamma-ray burst on Oct. 9, 2022, that they called the BOAT: Brightest Of All Time. Data from our \n@NASAUniverse\n NuSTAR telescope provided clues about the collapsing star that triggered this record-breaking event. https://go.nasa.gov/3qvQt9L",
    "Love space but nervous to travel 1.8 billion miles? That’s okay!\n\nLeave your mark by having your name engraved on the \n@EuropaClipper\n spacecraft! \n\n#SendYourName here: https://go.nasa.gov/449nDLd",
    "Another exciting week at NASA in the books!\n\nThe #CRS28 mission delivered cargo to the \n@Space_Station\n and \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n performed a spacewalk to upgrade the space station’s power supply.\n\nGet all the details: http://nasa.gov/subscribe",
    "Smoke from wildfires in Quebec moved across eastern portions of Canada and the U.S. this week. This \n@NASAEarth\n computer model used satellite, aircraft, and ground-based data to track the black carbon particles (soot) and hazardous air. https://go.nasa.gov/3J4yaiu",
    "To-do: Become a NASA Intern \n\nToday our #NASAInterns completed their first week at \n@NASA\n. Already these #ArtemisGeneration interns are putting their talent and creativity to work for the betterment of all. \n\nWelcome to the team!",
    ".\n@NASA_Astronauts\n Stephen Bowen and \n@Astro_Woody\n successfully installed and deployed the space station's fifth roll-out solar array during a six-hour and three-minute spacewalk today.",
    "\"'NASA for all.' That's something that I think is really important because we are the universe, right? We are made of star stuff.\"\n\nCelebrate #Pride and learn how Rebecca Sirmons helps tell the story of the universe as NASA TV's executive producer: http://go.nasa.gov/3IVxzj7"
]