[
    "Watch Falcon 9 launch 22 \n@Starlink\n satellites to orbit → http://spacex.com/launches",
    "Liftoff!",
    "I have spaceships",
    "AI ",
    "Tesla Powerwall does the seem for individual homes (if you have the backup switch installed)\nhttp://Tesla.com/Powerwall",
    "We are today sharing an update on our approach in Turkey.\n\nWe were in negotiation with the Turkish Government throughout last week, who made clear to us Twitter was the only social media service not complying in full with existing court orders.\n\nWe received what we believed to be… Show more",
    "Starlink enables greater access to healthcare and medical services, especially for those in remote locations.\n\nThanks to the \n@PolarisProgram\n, this \n@StJude\n hospital in the Philippines is better connected with researchers and doctors worldwide ",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    " Happy Mother’s Day! ",
    "Poetry with quill  \nWritten on rose  \nWith my blood ",
    "\"The most reliable way to predict the future is to create it.\"\n- Abraham Lincoln",
    "Until the Supreme Court struck down Biden’s vaccination decree, he tried to demand that we fire all unvaccinated personnel – some of our finest people",
    "Feels so long ago …",
    "Starlink enables greater access to healthcare and medical services, especially for those in remote locations.\n\nThanks to the @PolarisProgram, this @StJude hospital in the Philippines is better connected with researchers and doctors worldwide ",
    "Starlink is self-orienting and connects in minutes as long as it has a clear view of the sky. Open the Starlink App to check for any obstructions ",
    "When you walk on to a plane with Starlink, the internet just works – it's that simple",
    "NASA Spaces about space!",
    "Model S Plaid track pack coming soon",
    "Falcon Heavy long exposure looks like 3 laser beams from space",
    "¡Notas de la Comunidad sigue creciendo! Bienvenidos a los contribuyentes de Argentina, Chile, Colombia, Ecuador, Guatemala, Perú y Venezuela\n\n",
    "May the 4th be with you ",
    "Falcon 9’s first stage has landed on the A Shortfall of Gravitas droneship",
    "Watch Falcon 9 launch 56 Starlink satellites to orbit → http://spacex.com/launches/",
    "Major software upgrades underway across the board. \n\nEncrypted DMs & other DM upgrades rolling out this week.",
    "Support content creators around the world in near & far away places!\n\nFor many this represents a vital source of income & enables them to put more time into creating great content for you.",
    "I propose the lmfao test for AI",
    "Falcon Heavy is green for launch",
    "About to do Falcon Heavy risk review. I love that rocket, but it’s scary. So many state changes post liftoff.",
    "On \n@billmaher\n show tonight",
    "Starship liftoff in slow motion"
]