[
    "Interview with \n@BillMaher",
    "Explaining Constitutional Amendments",
    "If AGI is almost here, why doesn’t autocorrekt work!?",
    "Raptor V3 just achieved 350 bar chamber pressure (269 tons of thrust). Congrats to \n@SpaceX\n propulsion team!\n\nStarship Super Heavy Booster has 33 Raptors, so total thrust of 8877 tons or 19.5 million pounds.",
    "When you have Starlink on your ship, not only can you stay connected while on the vast majority of the Earth’s oceans and seas, but apparently it’s also easier to find sunken treasure → http://yachtworld.com/research/yacht-wifi-revolutionizes-sunken-treasure-discovery/…",
    "As soon as \n@LindaYacc\n is ready, we will do a Spaces where you can ask us anything",
    "Yup",
    "First passenger rail service in the world to adopt Starlink! ",
    "Trust nothing, not even nothing",
    "¡Notas de la Comunidad sigue creciendo! Bienvenidos a los contribuyentes de Argentina, Chile, Colombia, Ecuador, Guatemala, Perú y Venezuela\n\n",
    "May the 4th be with you ",
    "Falcon 9’s first stage has landed on the A Shortfall of Gravitas droneship",
    "NASA Spaces about space!",
    "Model S Plaid track pack coming soon",
    "Falcon Heavy long exposure looks like 3 laser beams from space",
    "Watch Falcon 9 launch 56 Starlink satellites to orbit → http://spacex.com/launches/",
    "Vegas Loop is expanding - 65 miles and 69 stations!  Thanks to @ClarkCountyNV for the great partnership.",
    "More Community Notes! Today’s new algorithm update boosts the number of Helpful notes by 10%+. It builds on last week’s change that uses confidence scores to identify notes that are broadly found helpful with high precision. https://communitynotes.twitter.com/guide/en/under-the-hood/ranking-notes#modeling-uncertainty…",
    "Great song",
    "Such a great day in so many ways",
    "A pressurant valve appears to be frozen, so unless it starts operating soon, no launch today",
    "Cryogenic propellant load of Starship is underway, liftoff in T minus 1 hour",
    "As we venture into new territory, we continue to appreciate all of the support and encouragement we have received from those who share our vision of a future where humanity is out exploring among the stars!",
    "The Starship team is go for prop load. Now targeting 8:20 a.m. CT→ http://spacex.com/launches",
    "Starship launch attempt in ~7 hours",
    "T-12 hours until the first flight test of a fully integrated Starship and Super Heavy rocket; targeting ~8:00 a.m. CT for liftoff → http://spacex.com/launches",
    "Starship's flight test window opens at 7:00 a.m. CT tomorrow; a live webcast will begin ~45 minutes before liftoff → http://spacex.com/launches/mission/?missionId=starship-flight-test…",
    "Launch attempt tomorrow",
    "Teams are completing final checkouts and reviews ahead of Starship’s first flight test attempt; weather is looking pretty good for tomorrow morning but we're keeping an eye on wind shear http://spacex.com/launches/mission/?missionId=starship-flight-test…",
    "Starship fully stacked at Starbase"
]