[
    "Interview with \n@BillMaher",
    "Tesla shareholder meeting underway",
    "As more satellites & ground stations are added, latency & jitter will improve. Goal is <20ms latency.",
    "Soros reminds me of Magneto",
    "Tesla Powerwall does the seem for individual homes (if you have the backup switch installed)\nhttp://Tesla.com/Powerwall",
    "We are today sharing an update on our approach in Turkey.\n\nWe were in negotiation with the Turkish Government throughout last week, who made clear to us Twitter was the only social media service not complying in full with existing court orders.\n\nWe received what we believed to be… Show more",
    "Starlink enables greater access to healthcare and medical services, especially for those in remote locations.\n\nThanks to the \n@PolarisProgram\n, this \n@StJude\n hospital in the Philippines is better connected with researchers and doctors worldwide ",
    "Early version of encrypted direct messages just launched.\n\nTry it, but don’t trust it yet.",
    "Falcon 9’s first stage has landed on the Of Course I Still Love You droneship",
    "Liftoff!",
    "I read \n@paulg\n’s  “How to Make Wealth” in Hackers & Painters when I was in my mid twenties. It’s one of those pieces that blew my mind because it made me realize that I’d been wrong about something my whole life. The key section for me was the “Pie Fallacy”:",
    "Automatically QTs \n@CommunityNotes\n that have been rated Helpful by contributors. To appear here, notes must have kept their status of Helpful for 24hr, and have a high helpfulness score (0.45+ intercept score). How do notes become Helpful?",
    "“A new philosophy of the future is needed. I believe it should be curiosity about the Universe – expand humanity to become a multiplanet, then interstellar, species to see what’s out there.” \n@elonmusk",
    "",
    "Feeling nostalgic",
    "Dragon is go for docking",
    "Thank you to our 1.5M+ customers around the world! ",
    "I read @paulg’s  “How to Make Wealth” in Hackers & Painters when I was in my mid twenties. It’s one of those pieces that blew my mind because it made me realize that I’d been wrong about something my whole life. The key section for me was the “Pie Fallacy”:",
    "Automatically QTs @CommunityNotes that have been rated Helpful by contributors. To appear here, notes must have kept their status of Helpful for 24hr, and have a high helpfulness score (0.45+ intercept score). How do notes become Helpful?",
    "“A new philosophy of the future is needed. I believe it should be curiosity about the Universe – expand humanity to become a multiplanet, then interstellar, species to see what’s out there.” @elonmusk",
    "Your Tesla can automatically navigate to destinations based on your calendar",
    "All systems and weather are looking good for tonight's Falcon Heavy launch of \n@ViasatInc\n's ViaSat-3 Americas mission → http://spacex.com/launches/mission/?missionId=ViaSat-3-Americas…",
    "Home",
    "Rolling out next month, this platform will allow media publishers to charge users on a per article basis with one click.\n\nThis enables users who would not sign up for a monthly subscription to pay a higher per article price for when they want to read an occasional article.… Show more",
    "While other car manufacturers struggle with updates, Tesla continuously improves its fleet and features. With its latest update, AEB now works in reverse and up to 124 mph (200 km/h).",
    "Imagine the countless lives we could save if more people drove Teslas. With safety as a top priority, Tesla is leading the charge towards a safer future on our roads.",
    "All systems and weather are looking good for tonight's Falcon Heavy launch of @ViasatInc's ViaSat-3 Americas mission → http://spacex.com/launches/mission/?missionId=ViaSat-3-Americas…",
    "Censor not, lest ye be censored",
    "Or maybe just X",
    "Given the moves by Fox and CNN news today with the firings of Don Lemon and Tucker Carlson, I think what we have is mainstream media realizing that change is needed. People don't want to be mislead by news stations. They also don't want misogynistic viewpoints to flourish.\n\nAs… Show more"
]