[
    "Interview with \n@BillMaher",
    "When you have Starlink on your ship, not only can you stay connected while on the vast majority of the Earth’s oceans and seas, but apparently it’s also easier to find sunken treasure → http://yachtworld.com/research/yacht-wifi-revolutionizes-sunken-treasure-discovery/…",
    "As soon as \n@LindaYacc\n is ready, we will do a Spaces where you can ask us anything",
    "You asked (loudly), we listened.\n\nWe’ve reduced the signup flow for creators from 27 steps to just 4.\n\nIt’s never been easier to earn a living on Twitter. Tap on “Monetization” in settings to apply today.",
    "One-third of humanity remains offline, and many users only have basic connectivity.\n\nThe Ministry of Education in El Salvador—among many others around the world—is installing Starlink in schools to help close the digital divide ",
    "I am excited to welcome Linda Yaccarino as the new CEO of Twitter!\n\n\n@LindaYacc\n will focus primarily on business operations, while I focus on product design & new technology.\n\nLooking forward to working with Linda to transform this platform into X, the everything app.",
    "[correction: \n@wsj\n trailed by several years]",
    "Remarkable how \n@nytimes\n, \n@latimes\n & \n@washingtonpost\n moved in lockstep, with \n@WSJ\n trailing by ~6 months",
    "Massive public manipulation",
    "Watch Falcon 9 launch 56 Starlink satellites to orbit → http://spacex.com/launches/",
    "Vegas Loop is expanding - 65 miles and 69 stations!  Thanks to \n@ClarkCountyNV\n for the great partnership.",
    "Liftoff!",
    "Two Falcons on two SpaceX pads in Florida. If the weather cooperates, launch windows open 2+ hours apart for these two missions → http://spacex.com/launches",
    "Note, it takes a few days longer for subscriptions to go active on iPhone vs web, as all subscriptions currently have to be approved by Apple",
    "Such a great day in so many ways",
    "Starship Liftoff",
    "Starship Supersonic",
    "Creators can now sign up and earn a living directly on Twitter in the EU, UK, and EEA.\n\nTap on “Monetization” in settings to apply today.\n\nFor a full list of available countries see our Help Center:",
    "More Community Notes! Today’s new algorithm update boosts the number of Helpful notes by 10%+. It builds on last week’s change that uses confidence scores to identify notes that are broadly found helpful with high precision. https://communitynotes.twitter.com/guide/en/under-the-hood/ranking-notes#modeling-uncertainty…",
    "Great song",
    "In a short time, \n@NASAWebb\n has revealed new info about the composition & atmospheres of \n@NASAExoplanets\n, while continuing to perfect techniques that we'll need to identify habitable worlds outside our own. Peruse some unexpected findings discovered so far: https://go.nasa.gov/3Ai2cdI",
    "First fully integrated Starship lifting off for the first time!",
    "Liftoff from Starbase",
    "Starship launch attempt in ~7 hours",
    "T-12 hours until the first flight test of a fully integrated Starship and Super Heavy rocket; targeting ~8:00 a.m. CT for liftoff → http://spacex.com/launches",
    "Starship's flight test window opens at 7:00 a.m. CT tomorrow; a live webcast will begin ~45 minutes before liftoff → http://spacex.com/launches/mission/?missionId=starship-flight-test…",
    "Launch attempt tomorrow",
    "Teams are completing final checkouts and reviews ahead of Starship’s first flight test attempt; weather is looking pretty good for tomorrow morning but we're keeping an eye on wind shear http://spacex.com/launches/mission/?missionId=starship-flight-test…",
    "Starship fully stacked at Starbase",
    "Yay! Nice work Dragon Team!"
]