[
    "Yikes",
    "Sorry this app takes up so much space",
    "End Poem of minecraft is literally the best thing I've ever read?? So worth reading the whole thing: https://en.m.wikisource.org/wiki/End_Poem",
    "AI Fashion Show in Azkaban\nDate & Details to Follow",
    "And works almost everywhere on Earth with global roaming enabled!",
    "Both quality & quantity of high quality posts of all kinds (short text, long essays, pictures, audio & video) have improved dramatically. \n\nThank you for contributing your voice to humanity’s digital public square!",
    "Starlink for RVs can be used anywhere Starlink provides service and is ideal for camping and other activities in rural or remote locations where internet access has been unreliable or completely unavailable → http://starlink.com/rv",
    "fwiw you can post thirst pics on twitter too",
    "All those moments, \nwill be lost in time\nlike tears in rain …",
    "Welcome aboard the station #Ax2! The four \n@Axiom_Space\n private astronauts entered the orbital outpost after opening the \n@SpaceX\n Dragon crew ship hatch at 11am ET today.",
    "Dragon performed a series of burns on its way to the \n@space_station",
    "Let's go!",
    "The Starlink team is proud to support humanitarian efforts around the world",
    "Falcon 9’s first stage booster has landed on Landing Zone 1, a first for a human spaceflight mission",
    "Watch Falcon 9 launch Dragon and Ax-2 to the \n@space_station\n → http://spacex.com/launches/mission/?missionId=ax-2…",
    "It was really unfair to Magneto",
    "I’d like apologize for this post",
    "\"A lot of people still think Teslas are super expensive...but now we're at the point where the starting point of a Tesla is actually below the average selling price of a car in the United States,\" Elon Musk said Tuesday after Tesla's shareholder meeting. http://cnb.cx/42HSsWG",
    "Super easy to use Starlink out of the box, no professional installer needed!",
    "J. Robert Oppenheimer's grandson: \"We must get over our cognitive and political bias: Nuclear energy is necessary and safe, and not the same as nuclear weapons\"",
    "Verified organization is one of the most important additions to Twitter. \n@elonmusk",
    "Thanks Dave!",
    "Starship is the largest, most capable rocket ever developed and will allow us to achieve a shared vision of a future where humanity is out exploring stars → http://youtube.com/spacex",
    "Early version of encrypted direct messages just launched.\n\nTry it, but don’t trust it yet.",
    "Falcon 9’s first stage has landed on the Of Course I Still Love You droneship",
    "Liftoff!",
    "Contributors’ time is valuable, and best spent reviewing high quality notes. Today we’re making the number of notes one can write in 24h proportional to their track record. The more helpful notes you’ve written, the more you can write. If you hit your limit, you’ll see this:",
    "S3XY vehicles  hot engineers \n\nOur field quality engineers head to Dubai at the hottest time of the year for extreme heat & durability testing—temperatures reach over 50°C",
    "Yesterday in the pit",
    "I read \n@paulg\n’s  “How to Make Wealth” in Hackers & Painters when I was in my mid twenties. It’s one of those pieces that blew my mind because it made me realize that I’d been wrong about something my whole life. The key section for me was the “Pie Fallacy”:"
]