[
    "",
    "Am TS fan – of course – but how do we know for sure they’re different people?",
    "Yes",
    "Deployment of \n@Arabsat\n BADR-8 confirmed",
    "Falcon 9’s first stage has landed the Just Read the Instructions droneship",
    "Liftoff!",
    "Hold on to your horse as the carousel of destiny spins ever faster",
    "Bruh do you even AI",
    "Is this true, \n@Target\n?",
    "Another step closer to Mars — the first flight test of a fully integrated Starship and Super Heavy rocket",
    "Thank you to Tesla owners for making Model Y the world’s bestselling car in Q1 this year!",
    "Lot of noise about \n@RonDeSantis\n announcing & discussing his Presidential bid on this platform. \n\nBut you what isn’t noise? Setting an all-time record for fundraising!\n\nWorth considering for announcements in general.",
    "I have spaceships",
    "AI ",
    "Poetry with quill  \nWritten on rose  \nWith my blood ",
    "\"The most reliable way to predict the future is to create it.\"\n- Abraham Lincoln",
    "Until the Supreme Court struck down Biden’s vaccination decree, he tried to demand that we fire all unvaccinated personnel – some of our finest people",
    "Feels so long ago …",
    "Extremely destructive if accurate",
    "Explaining Constitutional Amendments",
    "If AGI is almost here, why doesn’t autocorrekt work!?",
    "Raptor V3 just achieved 350 bar chamber pressure (269 tons of thrust). Congrats to \n@SpaceX\n propulsion team!\n\nStarship Super Heavy Booster has 33 Raptors, so total thrust of 8877 tons or 19.5 million pounds.",
    "Raptor V3 just achieved 350 bar chamber pressure (269 tons of thrust). Congrats to @SpaceX propulsion team!\n\nStarship Super Heavy Booster has 33 Raptors, so total thrust of 8877 tons or 19.5 million pounds.",
    "Falcon 9’s first stage has landed on the A Shortfall of Gravitas droneship",
    "Watch Falcon 9 launch 56 Starlink satellites to orbit → http://spacex.com/launches/",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "Two Falcons on two SpaceX pads in Florida. If the weather cooperates, launch windows open 2+ hours apart for these two missions → http://spacex.com/launches",
    "Creators can now sign up and earn a living directly on Twitter in the EU, UK, and EEA.\n\nTap on “Monetization” in settings to apply today.\n\nFor a full list of available countries see our Help Center:",
    "More Community Notes! Today’s new algorithm update boosts the number of Helpful notes by 10%+. It builds on last week’s change that uses confidence scores to identify notes that are broadly found helpful with high precision. https://communitynotes.twitter.com/guide/en/under-the-hood/ranking-notes#modeling-uncertainty…",
    "Great song"
]