[
    "After delivering 72 spacecraft to orbit, Falcon 9 returns to Earth and completes SpaceX’s 200th landing of an orbital class rocket",
    "Falcon 9’s first stage has landed on Landing Zone 4, marking SpaceX’s 200th successful recovery of an orbital class rocket!",
    "Watch Falcon 9 launch 72 spacecraft to orbit → http://spacex.com/launches",
    "Falcon 9 launches 52 \n@Starlink\n satellites to orbit from Florida",
    "Sentry Mode enables your Tesla to monitor & record potential threats while parked",
    "Archived version",
    "Powerful article",
    "Over 7,000 pounds of new experiments, new solar arrays, and other cargo has arrived at the station after the \n@SpaceX\n Dragon cargo craft docked to the Harmony module at 5:54am ET today.",
    ".",
    "On now",
    "An example of great interaction between brands  \n@McDonalds\n \n@AXE",
    "I still hear tons of friends just coming on Twitter for information. You should consider sharing your voice and contributing more to this epic platform.",
    "Dragon separation confirmed; autonomous docking with the \n@space_station\n on Tuesday, June 6 at ~5:50 a.m. ET",
    "Liftoff!",
    "Watch Falcon 9 launch Dragon to the \n@space_station\n → http://spacex.com/launches/mission/?missionId=crs-28…",
    "Beat previous record by >8 seconds!",
    "Hosting \n@RobertKennedyJr\n’s upcoming Space",
    "Starlink on Igloolik Island in the northern territory of Nunavut, Canada ",
    "BREAKING: \n@Tesla\n says ALL new Model 3 vehicles in the US now qualify for the full $7,500 EV tax credit, meaning the Model 3 now starts at $32,740 (with incentives). In some states, you can get it for under $30k.\n\nBefore, the RWD and Long Range versions only qualified for $3,750.",
    "Starlink set an altitude and speed record for use in-flight during Starship’s first flight test, providing connectivity at 123,600+ feet and while traveling at Mach 1.7! ",
    "Let that sink in",
    "X",
    "Consenting adults should do whatever makes them happy, provided it does not harm others, but a child is not capable of consent, which is why we have laws protecting minors.",
    "Three years ago this week we launched our first human spaceflight mission to orbit. \n\nThank you to \n@NASA\n, \n@inspiration4x\n, \n@Axiom_Space\n, and the 38 astronauts from all around the world for flying SpaceX!",
    "Insane",
    "Every parent should watch this",
    "The Babylon Bee + \n@elonmusk\n at Twitter HQ\n\nTOMORROW. Premiering exclusively on Twitter.",
    "Powerwall is one of the best products I've ever purchased. Nothing but sunny blue skies for over a week, yet power is out for 5k+ customers.\n\nCheck out more details of my \n@Tesla\n Powerwall experience here https://youtu.be/DA3fRMm3a0c",
    " For those who died for freedom ",
    "Dragon and the Ax-2 astronauts are set to depart the \n@space_station\n tomorrow at 11:05 a.m. ET → http://spacex.com/launches/mission/?missionId=ax-2…"
]