[
    "",
    "Am TS fan – of course – but how do we know for sure they’re different people?",
    "Yes",
    "From SJM",
    "Dagan Shani has IMHO made the most important film of the year -  about the harsh #AI truth:",
    "Starlink on Igloolik Island in the northern territory of Nunavut, Canada ",
    "BREAKING: @Tesla says ALL new Model 3 vehicles in the US now qualify for the full $7,500 EV tax credit, meaning the Model 3 now starts at $32,740 (with incentives). In some states, you can get it for under $30k.\n\nBefore, the RWD and Long Range versions only qualified for $3,750.",
    "Starlink set an altitude and speed record for use in-flight during Starship’s first flight test, providing connectivity at 123,600+ feet and while traveling at Mach 1.7! ",
    "Let that sink in",
    "X",
    "Consenting adults should do whatever makes them happy, provided it does not harm others, but a child is not capable of consent, which is why we have laws protecting minors.",
    "Three years ago this week we launched our first human spaceflight mission to orbit. \n\nThank you to @NASA, @inspiration4x, @Axiom_Space, and the 38 astronauts from all around the world for flying SpaceX!",
    "Insane",
    "Watch Falcon 9 launch the Iridium OneWeb mission to orbit → http://spacex.com/launches",
    "Watch Falcon 9 launch 22 \n@Starlink\n satellites to orbit → http://spacex.com/launches",
    "Liftoff!",
    "I have spaceships",
    "AI ",
    "3 Falcon 9 rockets on 3 SpaceX launch pads → http://spacex.com/launches",
    "I recommend subscribing to \n@shellenberger",
    "Starlink on Siargao Island in the Philippines  \n\n: \n@buddhasiargao",
    "Watch Falcon 9 launch 22 @Starlink satellites to orbit → http://spacex.com/launches",
    "I recommend subscribing to @shellenberger",
    "Starlink on Siargao Island in the Philippines  \n\n: @buddhasiargao",
    "\"The most reliable way to predict the future is to create it.\"\n- Abraham Lincoln",
    "Until the Supreme Court struck down Biden’s vaccination decree, he tried to demand that we fire all unvaccinated personnel – some of our finest people",
    "Feels so long ago …",
    "Extremely destructive if accurate",
    "Explaining Constitutional Amendments",
    "If AGI is almost here, why doesn’t autocorrekt work!?"
]