[
    "Due to strong upper-level winds, launch of two small satellites for our cyclone-tracking TROPICS mission on a \n@RocketLab\n Electron rocket is now targeted for no earlier than Thurs., May 25 at 11:30pm ET (0330 UTC). https://go.nasa.gov/3MUXZ6Y",
    "We and \n@RocketLab\n are targeting 12am ET Thursday, May 25 (0400 UTC), for the second launch of our cyclone-studying TROPICS mission.\n\nTune in here and at https://go.nasa.gov/424tYpt at 11:40pm ET (0340 May 25 UTC) for live launch coverage from New Zealand: https://go.nasa.gov/42071E4",
    "Simply the best. Music legend Tina Turner sparkled across the stage and into millions of hearts as the Queen of Rock 'n' Roll. Her legacy will forever live among the stars.",
    "Victor Glover: captain, pilot, astronaut.\n\nGlover most recently served as the pilot of the NASA \n@SpaceX\n #Crew1 mission and will be one of four astronauts flying aboard the #Artemis II mission around the Moon. https://go.nasa.gov/31cfXJh\n\nCelebrate #MilitaryAppreciationMonth.",
    "A \n@NASAWebb\n finding is making a splash!\n\nWater vapor was confirmed around a comet in the main asteroid belt for the first time, indicating that water from the primordial solar system can be preserved there. Is this a clue to the origin of Earth's water? https://go.nasa.gov/3BvAHhz",
    "Who made you the star you are today? Mention them to give them cosmic #MothersDay flowers.  \n\nThe Rosette Nebula, about 5,000 light-years from Earth, is a region in space where stars are formed. This image by the Spitzer Space Telescope shows the stellar nursery in infrared.",
    "Happy 50th, Skylab!\n\nOur first space station launched into orbit on May 14, 1973. Skylab hosted three crews of \n@NASA_Astronauts\n, proving that humans could live and work in space for extended periods of time. Learn more with \n@NASA_History\n: https://go.nasa.gov/3nVqFmz",
    "This week was busy.\n\n\n@Space_Station\n crew members relocated their \n@SpaceX\n Dragon to a new docking port, \n@NASAWebb\n imaged a nearby star, and \n@RocketLab\n launched two small satellites to study hurricanes.\n\nSubscribe to our newsletter and get the full scoop: http://nasa.gov/subscribe",
    "For the first time, two \n@NASA\n super pressure balloons are in flight at the same time!\n\nThe two balloons launched from New Zealand with a primary goal of testing & qualifying the super pressure balloon tech for flight, while also flying science missions. https://go.nasa.gov/3pzfNvk",
    "We're holding a public meeting of our independent study team on unidentified anomalous phenomena (UAP) on Wednesday, May 31, at 10:30am ET (1430 UTC), with a media teleconference to follow. \n\nHow to watch: https://go.nasa.gov/42tSGAX\n\nSubmit your questions: https://go.nasa.gov/42uzK4J",
    "Over their eight days on the \n@Space_Station\n, the private astronauts of \n@Axiom_Space\n's Axiom Mission 2 will run activities from student outreach to scientific experiments.\n\n#Ax2 is set to lift off from \n@NASAKennedy\n on Sunday, May 21—here's how to watch: https://go.nasa.gov/41yAdlp",
    "14 years ago, \n@Astro_Mike\n wrote the first tweet from space. Since then, we’ve been sharing snippets of our life in orbit—and what it’s like to gaze upon our home planet.\n\nFollow along: http://nasa.gov/astronauts/biographies/active…",
    "A @NASAWebb finding is making a splash!\n\nWater vapor was confirmed around a comet in the main asteroid belt for the first time, indicating that water from the primordial solar system can be preserved there. Is this a clue to the origin of Earth's water? https://go.nasa.gov/3BvAHhz",
    "Happy 50th, Skylab!\n\nOur first space station launched into orbit on May 14, 1973. Skylab hosted three crews of @NASA_Astronauts, proving that humans could live and work in space for extended periods of time. Learn more with @NASA_History: https://go.nasa.gov/3nVqFmz",
    "This week was busy.\n\n@Space_Station crew members relocated their @SpaceX Dragon to a new docking port, @NASAWebb imaged a nearby star, and @RocketLab launched two small satellites to study hurricanes.\n\nSubscribe to our newsletter and get the full scoop: http://nasa.gov/subscribe",
    "For the first time, two @NASA super pressure balloons are in flight at the same time!\n\nThe two balloons launched from New Zealand with a primary goal of testing & qualifying the super pressure balloon tech for flight, while also flying science missions. https://go.nasa.gov/3pzfNvk",
    "Over their eight days on the @Space_Station, the private astronauts of @Axiom_Space's Axiom Mission 2 will run activities from student outreach to scientific experiments.\n\n#Ax2 is set to lift off from @NASAKennedy on Sunday, May 21—here's how to watch: https://go.nasa.gov/41yAdlp",
    "14 years ago, @Astro_Mike wrote the first tweet from space. Since then, we’ve been sharing snippets of our life in orbit—and what it’s like to gaze upon our home planet.\n\nFollow along: http://nasa.gov/astronauts/biographies/active…",
    " LIVE from #SpaceSymposium: a look at our \n@NASAArtemis\n \"Moon to Mars\" strategy, and what it takes as an agency to make it all possible—from engaging the #Artemis Generation to supporting our workforce and improving our infrastructure. https://bit.ly/3GZ6rPk",
    "A solar eclipse will be visible over parts of Western Australia and Southeast Asia today. No matter where you are, you can watch the Moon block the Sun with us.\n \n At 10:30pm ET (0330 UTC), watch #NASAScience Live and ask NASA experts your questions, plus get a preview of… Show more",
    "On Friday, April 21, \n@NorthropGrumman\n's uncrewed Cygnus cargo craft is scheduled to depart the \n@Space_Station\n. Live coverage begins at 7am ET (1100 UTC). More info: https://go.nasa.gov/3UObN5r",
    "Houston, we have Posty\n\nAs we approach #EarthDay, watch @PostMalone get astronaut-struck as he chats with two crew members aboard the @Space_Station, Stephen Bowen & Woody Hoburg, about how their unique perspective changes the way they see our home planet. http://nasa.gov/earth-day-2023",
    "Congrats to @SpaceX on Starship’s first integrated flight test! Every great achievement throughout history has demanded some level of calculated risk, because with great risk comes great reward. Looking forward to all that SpaceX learns, to the next flight test—and beyond.",
    "LIVE: Watch a total solar eclipse in Australia with us! We're sharing live telescope views and answering your #AskNASA questions on NASA Science Live.",
    " LIVE from #SpaceSymposium: a look at our @NASAArtemis \"Moon to Mars\" strategy, and what it takes as an agency to make it all possible—from engaging the #Artemis Generation to supporting our workforce and improving our infrastructure. https://bit.ly/3GZ6rPk",
    "On Friday, April 21, @NorthropGrumman's uncrewed Cygnus cargo craft is scheduled to depart the @Space_Station. Live coverage begins at 7am ET (1100 UTC). More info: https://go.nasa.gov/3UObN5r",
    "Two cosmonauts are about to venture outside the @Space_Station for a six-and-a-half-hour spacewalk. Live coverage begins at 9pm ET (0100 UTC April 19) on https://go.nasa.gov/3Lc1mFI.",
    "To help defend Earth from potentially hazardous asteroids and comets, we developed the #PlanetaryDefense Strategy & Action Plan. We’re eager to work with @WHOSTP in implementing it. https://go.nasa.gov/3mI3MlZ\n\nNote: There are no known asteroid impact threats for 100+ years.",
    "NASA astronaut Steve Bowen and UAE astronaut @Astro_Alneyadi will step outside the @Space_Station on Friday, April 28, to prepare for new solar arrays that will boost the station's power capacity.\n\nTune in Monday, April 24, for a live spacewalk preview: https://go.nasa.gov/3KJ8isB",
    " LIVE: Deputy Administrator @Astro_Pam delivers a plenary address at #38Space discussing progress towards a blueprint for sustained human exploration of the Moon and beyond with @NASAArtemis. https://bit.ly/3GQNi1S"
]