[
    "Join us and \n@LibraryCongress\n as U.S. Poet Laureate Ada Limón reveals her poem for the \n@EuropaClipper\n mission. The poem will be engraved on the spacecraft, and travel 1.8 billion miles (2.89 billion kilometers) to an icy moon of Jupiter. \n\nTune in: https://bit.ly/42eJZJO",
    "I just reached a milestone only surpassed by Opportunity: 30 km on Mars   \n\nI've explored so much in my 10-plus-year trek through Gale Crater, but there are many more rocks to sample and analyze! Retrace my tracks with this interactive map: http://go.nasa.gov/3EtmSCi",
    "Join us and @LibraryCongress as U.S. Poet Laureate Ada Limón reveals her poem for the @EuropaClipper mission. The poem will be engraved on the spacecraft, and travel 1.8 billion miles (2.89 billion kilometers) to an icy moon of Jupiter. \n\nTune in: https://bit.ly/42eJZJO",
    "The diversity of our NASA team is what brings different perspectives to our missions, and we celebrate and share their stories. To protect our people from personal attacks, we have decided to limit comments on this post.",
    "This month and every month, we recognize the achievements and contributions of our Asian American, Native Hawaiian, and Pacific Islander workforce.\n\nCheck out the gallery and celebrate #AANHPIHeritageMonth with us: https://go.nasa.gov/3MHtxf9",
    "Simply the best. Music legend Tina Turner sparkled across the stage and into millions of hearts as the Queen of Rock 'n' Roll. Her legacy will forever live among the stars.",
    "Victor Glover: captain, pilot, astronaut.\n\nGlover most recently served as the pilot of the NASA @SpaceX #Crew1 mission and will be one of four astronauts flying aboard the #Artemis II mission around the Moon. https://go.nasa.gov/31cfXJh\n\nCelebrate #MilitaryAppreciationMonth.",
    "LIVE: An uncrewed Progress cargo spacecraft is set to lift off from Baikonur Cosmodrome in Kazakhstan at 8:56am ET (1256 UTC), and dock with the @Space_Station at 12:20pm ET (1620 UTC). Watch with NASA TV: http://nasa.gov/live",
    "Hey, you: Get a load of this cloud! High-altitude ice clouds (like this one) can help regulate Earth's temperature by reflecting energy from the Sun.\n\nA new @NASAEarth mission called PoISIR aims to study them in greater detail to improve climate forecasts. https://go.nasa.gov/3IAfgjj",
    "Wow, Uranus is showing off more these days.\n \n@NASASolarSystem researchers found a polar cyclone on the gas giant for the first time. Microwave observations and the planet's particular orbit gave scientists a better view: https://go.nasa.gov/427AvQi",
    "A Progress cargo ship carrying food, fuel, and supplies for the @Space_Station is scheduled to lift off and dock on Wednesday, May 24. NASA TV coverage begins at 8:30am ET (1230 UTC): https://go.nasa.gov/3IBjfvZ",
    "Recent studies from @NASAAmes shed new light on Saturn’s rings, pointing to evidence that the rings—comprised of almost entirely pure ice—are a relatively new addition to the gas giant and may only last a few 100 million years more. http://go.nasa.gov/3ooyku0",
    "Welcome aboard the station #Ax2! The four @Axiom_Space private astronauts entered the orbital outpost after opening the @SpaceX Dragon crew ship hatch at 11am ET today.",
    "#Ax2 has arrived! The @SpaceX Dragon crew ship with four private astronauts from @Axiom_Space docked to the station at 9:12am ET today. They will enter the orbital outpost soon live on @NASA TV.",
    "NOW: Watch the @Axiom_Space #Ax2 astronauts arrive at the @Space_Station. The @SpaceX Dragon is set to dock at around 9:16am ET (1316 UTC).",
    "Astronauts Steve Bowen and \n@Astro_Alneyadi\n concluded today’s seven-hour spacewalk at 4:12 p.m. ET (20:12 UTC). It was the eighth for Bowen and the first for any UAE astronaut: https://go.nasa.gov/3ADIeuf",
    " Live: TROPICS experts discuss the mission, which aims to improve understanding of tropical cyclones through regular measurements of precipitation, temperature & humidity.\n \nUse #AskNASA and your questions may get answered on air.",
    "Today's spacewalk is officially underway! The two astronauts have switched their spacesuits to battery power. Steve Bowen of \n@NASA_Astronauts\n and \n@Astro_Alneyadi\n will route power cables to prepare for future power system upgrades outside the \n@Space_Station\n.",
    "Shine bright like a ULIRG \n\nWith the light of a trillion suns, an ultra-luminous infrared galaxy (ULIRG) shines in the latest \n@NASAWebb\n image. Located 250 million light-years away, this target is actually the result of two colliding spiral galaxies: https://go.nasa.gov/3L7dojN",
    "We’re broadcasting live from #38Space Symposium this week!\n\nApril 18, 11:15am ET (1515 UTC) \n@Astro_Pam\n on \"Our Next Steps to the Moon and Beyond\"\n\nApril 19, 4pm ET (2000 UTC) NASA leaders discuss \"Moon to Mars\" strategy\n\nInfo on NASA at #SpaceSymposium: https://go.nasa.gov/3o8i6ob",
    "Having trouble sleeping? Try some of these seven techniques our astronauts use to get better sleep in space!\n \nThese methods help \n@NASA_Astronauts\n sleep well through the disruptions of their natural sleep cycle — and they may help you too: https://go.nasa.gov/3MNWYhA",
    "Whistles. Crunches. Whooshes.\n\nThese are a few of the space sounds heard in a new citizen science project called HARP.\nBy participating, you can investigate cosmic vibrations recorded by NASA spacecraft that help sing the song of the Sun and Earth.\n\nMore: http://go.nasa.gov/3mDXm7o",
    "Last year was pretty busy. \n\nWe launched to the Moon. We yeeted a spacecraft into an asteroid (on purpose.) And we unveiled images from a brand new space telescope. NBD. \n\nOh yeah, we also nabbed nine noms for the #Webbys. If you like what you saw, vote? http://go.nasa.gov/3KBXNZl",
    "Dragon is soaring home! \n\n\n@SpaceX\n's cargo spacecraft separated from the \n@Space_Station\n at 11:05am ET (1505 UTC), carrying space-grown tomatoes and other \n@ISS_Research\n for analysis back on the ground. Follow our ISS blog for the latest #CRS27 updates: http://blogs.nasa.gov/spacestation",
    "LIVE: \n@SpaceX\n's #CRS27 cargo mission is scheduled to undock from the \n@Space_Station\n at 11:05am ET (1505 UTC) today.\n\nLearn more about the \n@ISS_Research\n it's bringing back to Earth: https://go.nasa.gov/4059R9F",
    " \n@NASAAero\n gets closer to quiet supersonic flight, \n@NASA_Orion\n’s solar arrays are tested for Moon travel, and the #LucyMission spots the distant asteroids that it will one day visit—This Week at NASA.\n\nSmash that subscribe button for the latest videos: http://bit.ly/3mFZr2s",
    "Together, we've explored Earth, flight, and space. From the #Artemis I launch to the Moon to the DART asteroid impact to \n@NASAWebb\n’s first cosmic images. You're part of it all, including nine nominations for the #Webbys!\n\nVoting is open through April 20: https://go.nasa.gov/3KBXNZl",
    "NASA experts will join \n@Axiom_Space\n at noon ET (1600 UTC) on Thursday, April 6, to discuss the upcoming launch of Axiom Mission 2. #Ax2 is the second all-private mission to the \n@Space_Station\n. How to tune in: https://go.nasa.gov/412KmqK",
    "Get to know the #Artemis II astronauts headed to the Moon! Learn more about \n@Astro_Christina\n, \n@Astro_Jeremy\n, \n@AstroVicGlover\n, and \n@Astro_Reid\n: https://nasa.gov/specials/artemis-ii/…",
    "\"We choose to return to the Moon together…children who watch that flight are going to learn the names of those new pioneers. They'll be the ones who carry us into the future we hope to build.\"\n\n—\n@POTUS\n on the NASA-\n@CSA_ASC\n crewed #Artemis II Moon mission: https://youtube.com/live/4E2G75r0ekI?si=EnSIkaIECMiOmarE&t=5619…"
]