[
    "Sharing another update on the changes we’ve made to our open source repos this week and a preview of what’s next ",
    "Great statement by \n@votetimscott\n!",
    "Ending the digital divide requires making devices more accessible. \n\nStarlink kits are designed to include everything needed to connect. And they travel well too ",
    "It was really unfair to Magneto",
    "I’d like apologize for this post",
    "\"A lot of people still think Teslas are super expensive...but now we're at the point where the starting point of a Tesla is actually below the average selling price of a car in the United States,\" Elon Musk said Tuesday after Tesla's shareholder meeting. http://cnb.cx/42HSsWG",
    "Spaces interview with \n@davidfaber\n starting now",
    "Tesla shareholder meeting underway",
    "As more satellites & ground stations are added, latency & jitter will improve. Goal is <20ms latency.",
    "Soros reminds me of Magneto",
    "Tesla Powerwall does the seem for individual homes (if you have the backup switch installed)\nhttp://Tesla.com/Powerwall",
    "We are today sharing an update on our approach in Turkey.\n\nWe were in negotiation with the Turkish Government throughout last week, who made clear to us Twitter was the only social media service not complying in full with existing court orders.\n\nWe received what we believed to be… Show more",
    "Starlink enables greater access to healthcare and medical services, especially for those in remote locations.\n\nThanks to the \n@PolarisProgram\n, this \n@StJude\n hospital in the Philippines is better connected with researchers and doctors worldwide ",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "Liftoff!",
    "Contributors’ time is valuable, and best spent reviewing high quality notes. Today we’re making the number of notes one can write in 24h proportional to their track record. The more helpful notes you’ve written, the more you can write. If you hit your limit, you’ll see this:",
    "S3XY vehicles  hot engineers \n\nOur field quality engineers head to Dubai at the hottest time of the year for extreme heat & durability testing—temperatures reach over 50°C",
    "Thanks Dave!",
    "Starship is the largest, most capable rocket ever developed and will allow us to achieve a shared vision of a future where humanity is out exploring stars → http://youtube.com/spacex",
    "Early version of encrypted direct messages just launched.\n\nTry it, but don’t trust it yet.",
    "Falcon 9’s first stage has landed on the Of Course I Still Love You droneship",
    "Also, which kind of bat – fruit eating bat or insect eating bat ?",
    "Vote at the 2023 Tesla Shareholder Meeting →",
    "Home",
    "Rolling out next month, this platform will allow media publishers to charge users on a per article basis with one click.\n\nThis enables users who would not sign up for a monthly subscription to pay a higher per article price for when they want to read an occasional article.… Show more",
    "More photos from the first flight test of a fully integrated Starship and Super Heavy rocket",
    "FIRST STARSHIP LAUNCH.\n3 PEOPLE  SHARE THEIR EXPERIENCES.\n\n(April 22, 2023) S. Padre Island, Texas\n\nI wanted to write about my first rocket launch. I realized that to best write for you, I had to talk to other people about their experiences.  I’m sharing with you some of the… Show more",
    "Given the moves by Fox and CNN news today with the firings of Don Lemon and Tucker Carlson, I think what we have is mainstream media realizing that change is needed. People don't want to be mislead by news stations. They also don't want misogynistic viewpoints to flourish.\n\nAs… Show more",
    "We’re rapidly improving transparency & fairness on this platform, but there is still a lot of work to do",
    "Hard to believe Starship actually did launch on 4/20 lol"
]