[
    "With a phone or computer, you can help astronomers \n@DoNASAScience\n and uncover some of the most elusive objects in the universe—brown dwarfs. These balls of gas never became stars, so this is your chance to shine a light on them: https://go.nasa.gov/3r4wdMO",
    "Our next cargo mission to the \n@Space_Station\n is set to lift off from \n@NASA_Wallops\n on Tuesday, Aug. 1!\n\n\n@NorthropGrumman\n's #NG19 launch will carry gene therapy research, materials to study fires in space, and digital art from students around the world: https://go.nasa.gov/3JAWhFE",
    "As Chair of the National Space Council, I am thrilled to announce the public opening of \n@NASA\n's Earth Information Center (EIC).\n\nLeveraging 60 years of space-based Earth observation, the EIC will use life-saving data to tackle the climate crisis at home.\nhttps://gis.earthdata.nasa.gov/portal/apps/sites/#/earth-information-center…",
    "Spaceship update! \n@SpaceX\n's Dragon spacecraft for the uncrewed #CRS28 cargo mission is scheduled to undock from the \n@Space_Station\n at 12:05pm ET (1605 UTC) on Thursday, June 29, with splashdown early Friday morning. Here's the full timeline: https://go.nasa.gov/3NLmWCi",
    "Beethoven wasn’t the only one with dramatic flair 200 years ago—Sagittarius A*, the Milky Way’s supermassive black hole, may have also composed an intense flare as it consumed nearby material.\n\nTune in for #IXPE and @ChandraXray’s sonification: http://go.nasa.gov/46da7rL",
    ".\n@POTUS\n Biden and Prime Minister \n@narendramodi\n know that discovery deepens diplomacy. \n\nWe look forward to all that we will accomplish here on Earth and in space, including our joint Earth science mission NISAR, and are especially grateful for India’s signing of the Artemis… Show more",
    "On Friday, June 23, \n@NASAAero\n leaders will give an update on the experimental X-57 all-electric aircraft. Tune in at 12pm ET (1600 UTC) for a media teleconference: https://go.nasa.gov/3NJOxE0",
    "The diversity of our NASA team is what brings different perspectives to our missions, and we celebrate and share their stories. To protect our people from personal attacks, we have decided to limit comments on this post.",
    "\"And when we do things that improve equity for the people who have it the worst, we are improving equity across the board.\" — S. J. Ralston, Mars research scientist, advocates for transgender and nonbinary people in the workplace. #PrideMonth https://nasa.gov/faces-of-nasa/sj-ralston…",
    "LIVE: Two cosmonauts are stepping outside the \n@Space_Station\n to install equipment and retrieve experiments. Today's spacewalk is scheduled to start around 10:20am ET (1420 UTC) and last up to seven hours—follow along at http://nasa.gov/live.",
    "U.S. and international media: You are invited to \n@NASAKennedy\n to interview subject matter experts and view the \n@NASA_Orion\n spacecraft slated for the next three #Artemis missions.\n \nFor more information, including deadlines and how to apply, click here: http://go.nasa.gov/42Lm58M",
    "\"I try to be visible, to show folks who may still be in the closet that one can live their authentic life and be a part of something so amazing.\" Celebrate #Pride and read the story of Amy Lendian, a systems engineering supervisor at \n@NASAKennedy\n. https://go.nasa.gov/3NfJcCU",
    "Steve Bowen, 10-time spacewalker.  ",
    "@Astro_Kobi\n asked a \n@NASASolarSystem\n scientist some of the biggest questions about the universe.\n\nHere’s 3 cosmic facts you might not know…\n\n“Great Observatories Unique Views of the Milky Way”\nNASA/JPL-Caltech/ESA/CXC/STScI\n2009\n\n@NASA\n\n#UnpackItNASA",
    "Enceladus, Saturn's icy moon, is known for its geysers that erupt with water from a subsurface ocean. \n\nScientists have just detected phosphorus—an uncommon element that's a key building block for life—in the plumes that these geysers spray: https://go.nasa.gov/43FVtY1",
    "Another spacewalk in the books! \n\nToday’s spacewalk concluded at 2:17pm ET (1817 UTC) and lasted 5 hours and 35 minutes. Steve Bowen and \n@Astro_Woody\n installed a new roll-out solar array and completed numerous additional tasks outside the \n@Space_Station\n.",
    "Watch the \n@Space_Station\n's new roll-out solar array begin to unfurl in a process that takes about 12 minutes to complete. This is the helmet camera view from astronaut Steve Bowen:",
    "Spacewalkers Steve Bowen and \n@Astro_Woody\n have successfully installed the roll-out solar array and released hinge bolts. The duo will move on to work-ahead tasks as they wait for the next eclipse to unfold the solar array. Watch live... http://nasa.gov/live",
    "Astronauts-eye view \n\nTake a look through the helmet cams of \n@Astro_Woody\n and Steve Bowen as they prepare to install a roll-out solar array during today's spacewalk.",
    "JUST ANNOUNCED @ #AIAAaviation: We've got an X designation for the Sustainable Flight Demonstrator!\n\nIntroducing, X-66A \n\nThe new X-plane seeks to inform a potential new gen of more sustainable single-aisle aircraft-the workhorse of passenger airlines. https://nasa.gov/press-release/next-generation-experimental-aircraft-becomes-nasa-s-newest-x-plane/…",
    "How do places on Mars get their name? \n\nMore than 2,000 locations on the Red Planet have official names, recognizing places on Earth, explorers, and even cartoon characters. Learn what inspires names for Martian hills, craters, and rocks: https://go.nasa.gov/3CmCYMm",
    "Later this month, we're opening the Earth Information Center—a hybrid exhibit that offers an interactive look at our changing planet.\n\nMedia are invited to a ribbon-cutting ceremony on Wednesday, June 21, at NASA Headquarters in Washington: https://go.nasa.gov/43STHT7",
    "Congrats to \n@SpaceX\n on the impressive milestones in spaceflight! \n\nThe space shuttle was a workhorse for \n@NASA\n helping build \n@Space_Station\n, & now crew and cargo Dragons are helping support long-duration missions aboard humanity’s home in space. NASA’s investment in commercial… Show more",
    "How do we know what Earth's climate was like long ago? If you look closely, there are clues just about everywhere across our globe. Some are easy to see and others are more subtle. \n@NASAClimate\n scientist Dr. Gavin Schmidt explains.\n\nWant even more?: http://go.nasa.gov/3NihKpm",
    "What does it take to get ready for a spacewalk?\n\nHere's a behind-the-scenes look with \n@Astro_Woody\n, who will make his first trip outside the \n@Space_Station\n on Friday, June 9:",
    "Live from \n@LibraryCongress\n: U.S. Poet Laureate Ada Limón reveals her Poem for Europa, an original work that will fly aboard the \n@EuropaClipper\n spacecraft to Jupiter's icy moon.",
    "LIVE: Join NASA and \n@BoeingSpace\n officials as we share an update on the first #Starliner Crew Flight Test. Tune in.",
    " \n@NASA\n and \n@BoeingSpace\n will host a media teleconference at 5pm ET today for an update on Boeing's first crewed flight on the CST-100 Starliner to the \n@Space_Station\n.\n\nListen in: http://nasa.gov/live",
    "\"Congratulations on an outstanding mission.\"\n\nThe crew of the \n@Space_Station\n shared their thanks and farewells after Axiom Mission 2 undocked from the orbiting lab at 11:05am ET (1505 UTC). #Ax2 is scheduled to splash down off the coast of Florida tonight: https://go.nasa.gov/3MK1kUW",
    "LIVE: The Axiom Mission 2 crew is heading home in \n@SpaceX\n's Dragon Freedom spacecraft after wrapping up the second all-private astronaut mission to the \n@Space_Station\n. #Ax2 undocking is scheduled for 11:05am ET (1505 UTC)."
]