[
    "\"'NASA for all.' That's something that I think is really important because we are the universe, right? We are made of star stuff.\"\n\nCelebrate #Pride and learn how Rebecca Sirmons helps tell the story of the universe as NASA TV's executive producer: http://go.nasa.gov/3IVxzj7",
    "Peer pressure.\n\n\n@NASAHubble\n spots a galaxy about 50 million light-years away that holds some surprises: Two nearby galaxies are influencing it and it may or may not have a supermassive black hole at its center. http://go.nasa.gov/45It84O",
    "\"Congratulations on an outstanding mission.\"\n\nThe crew of the \n@Space_Station\n shared their thanks and farewells after Axiom Mission 2 undocked from the orbiting lab at 11:05am ET (1505 UTC). #Ax2 is scheduled to splash down off the coast of Florida tonight: https://go.nasa.gov/3MK1kUW",
    "LIVE: The Axiom Mission 2 crew is heading home in \n@SpaceX\n's Dragon Freedom spacecraft after wrapping up the second all-private astronaut mission to the \n@Space_Station\n. #Ax2 undocking is scheduled for 11:05am ET (1505 UTC).",
    "LIVE: After more than a week of science, outreach, and on-orbit activities, the all-private astronaut crew of #Ax2 is boarding their \n@SpaceX\n Dragon Freedom spacecraft to return to Earth. Hatch closure is scheduled for 9:10am ET (1310 UTC): http://nasa.gov/live",
    "Ad astra per aspera \n\nJoin us this #MemorialDay in remembering and honoring all those who made the ultimate sacrifice in service to our country.",
    "After just over a week in space, \n@Axiom_Space\n's #Ax2 astronauts are set to return to Earth on Tuesday, May 30. Here’s how to watch live coverage, from closing of the hatches to splashdown: https://go.nasa.gov/43vWzp6",
    "Two \n@NASA_Astronauts\n will do a pair of spacewalks on June 9 and June 15 to install new solar arrays on the \n@Space_Station\n. We’ll stream them live.\n \nJoin us for a preview on June 1: https://go.nasa.gov/3MGCCFj",
    "We completed a joint checkpoint review with \n@BoeingSpace\n ahead of the first #Starliner flight to carry astronauts, set for no earlier than July 21. Teams will provide updates leading up to the inaugural Crew Flight Test to and from the \n@Space_Station\n: https://go.nasa.gov/3MZR1xG",
    "Hot new bombshells enter the villa.\n\nOtherwise invisible to the unaided eye, infrared data from \n@NASAWebb\n and x-ray data from \n@ChandraXray\n make details in these proper fit cosmic wonders available by mapping the data to colors that humans can perceive:\nhttps://go.nasa.gov/43wTsx9",
    "Completing a squad of severe weather satellites, testing out a ssssnake-like robot, and sending the second all-private astronaut mission to the \n@Space_Station\n—all in a week’s work at NASA. See what we’ve been up to.",
    "LIVE NOW: We are announcing which company will develop the human landing system for the #Artemis V mission to the Moon. This system will help us establish recurring, long-term access to the lunar surface: http://nasa.gov/live",
    "Insights on InSight: Chat LIVE with experts from the mission that detected more than 1,000 marsquakes.",
    "Are you there, Moon? It’s me, #CAPSTONE \n\nOur microwave-oven sized #CubeSat has taken its first images! And tested a new navigation tech with our Lunar Reconnaissance Orbiter. Learn how it lays the groundwork for future peer-to-peer navigation at the Moon: https://go.nasa.gov/3o8O4Bk",
    "We can’t imagine a more beautiful thing than May’s full moon – the Corn Moon. \n\nSet to peak on May 5 at 1:34pm ET (1634 UTC ), this full moon, also known as the Flower Moon, will appear full till Sunday. Discover how it got its names: http://go.nasa.gov/3piIAUs",
    "Four of Uranus’ largest moons—Ariel, Umbriel, Titania, and Oberon—may have oceans beneath their icy crusts, according to a re-analysis of Voyager 2 data. https://go.nasa.gov/3VQtF0l",
    "This week at NASA, we marked the Ingenuity #MarsHelicopter's 50th flight on the Red Planet, the planet-hunting satellite TESS entered its fifth year, and we celebrated our favorite planet—Earth!\n\nCelebrate #EarthDay with us: https://go.nasa.gov/40AeM2G",
    "Share if you love Earth.  #EarthDay",
    "Happy #EarthDay \n\nFrom the tallest peaks to ocean depths, from arid deserts to lush forests, we observe our home from a unique perspective. Learn about the activities all around NASA, and about the picture that kicked off this celebration of our planet: https://go.nasa.gov/41yzVvI",
    "Astronaut \n@Astro_Watkins\n spent 170 days in space as a member of #Crew4. In our Curious Universe podcast season finale, she talks about how her background and training prepared her for life and work in space. https://go.nasa.gov/41j8YLT",
    "Designed to endure at least 7 passes through Jupiter's intense radiation, the JunoCam instrument has survived 50 so far – and it’s still going strong. In this new @googlearts exhibition, celebrate the otherworldly vistas “the public’s camera” has shown us: https://artsandculture.google.com/story/XwUxhKx1GDOOTA…",
    "The #JunoMission completed its 50th close pass of Jupiter this past weekend. Relive highlights from its journey around the solar system’s largest planet, download high-res images and learn more: https://go.nasa.gov/40ZRrIQ",
    "A new \n@NASAEarth\n & \n@CenterForAstro\n mission preparing for launch will be the first to take hourly observations of air quality in North America. Data from #TEMPO will improve forecasts & reveal disparities in pollution exposure within cities and communities. https://go.nasa.gov/3K3Zhd4",
    "Our crawler-transporter was recognized as the world's heaviest self-powered vehicle, DC welcomed the #Crew4 astronauts, and we prepare to recover asteroid samples returning in September—This Week at NASA.\n\nSubscribe for videos on Earth, flight & space at http://bit.ly/3mFZr2s",
    "Through #WomensHistoryMonth and every day, we honor the women at NASA who brought us to where we are and inspire generations past, present, and future to explore the cosmos. http://nasa.gov/women",
    "\"People need to realize not to make assumptions. Be open and curious about the abilities of everybody.\"\n \nDana Bolles is an External Information Technology Lead at NASA Headquarters. Discover how her community shapes her life, professionally and personally http://go.nasa.gov/3lgEBXb",
    "When Irish skies are smiling...\n\nThis cloud-free view of Ireland, the Emerald Isle, was captured from space by our Aqua satellite back in 2010. Happy #StPatricksDay!",
    "What could we do if an asteroid threatened Earth? 65 actor Adam Driver and \n@AsteroidWatch\n discuss how we monitor asteroids, preventing a possible impact, and why we’re bringing asteroid samples here with #OSIRISRex. (There are no known threats to Earth for 100+ years.)",
    "Teachers: Celebrate #PiDay in your classroom!\n\nChallenge your students to use pi to solve some of the same problems our scientists and engineers face while exploring other worlds. Answer key is available on March 15. Slice into our #NASAPiDayChallenge: https://go.nasa.gov/3mJ7mfq",
    "Digital creators – join our \n@NASASocial\n April 3-4 at \n@NASA_Johnson\n as we name the four astronauts who will travel around the Moon with #Artemis II.\n\nThe second \n@NASAArtemis\n mission is key to establishing a long-term presence on the Moon. Apply by March 14: http://go.nasa.gov/3mKnBsI"
]