[
    "I think we win this one. Happy #NationalSelfieDay ",
    "We've reaffirmed our shared commitment with the \n@USDA\n to benefit people everywhere. Our continued collaboration aims to address climate challenges and bolster plant-based research on the \n@Space_Station\n that could help improve food security on Earth. https://go.nasa.gov/3qXbYAN",
    "You know about earthquakes, but what about moonquakes and marsquakes? We asked a NASA scientist about what otherworldly quakes can tell us: https://go.nasa.gov/3N68hP1",
    "Oh, those summer nights! It's the #SummerSolstice, the longest day in the Northern Hemisphere—and the shortest in the Southern Hemisphere where winter starts.\n\nGlance up tonight for a planetary cameo, with Mars and Venus just beside the Moon: https://go.nasa.gov/3CDqMaj",
    "@Astro_Kobi\n asked a \n@NASASolarSystem\n scientist some of the biggest questions about the universe.\n\nHere’s 3 cosmic facts you might not know…\n\n“Great Observatories Unique Views of the Milky Way”\nNASA/JPL-Caltech/ESA/CXC/STScI\n2009\n\n@NASA\n\n#UnpackItNASA",
    "Enceladus, Saturn's icy moon, is known for its geysers that erupt with water from a subsurface ocean. \n\nScientists have just detected phosphorus—an uncommon element that's a key building block for life—in the plumes that these geysers spray: https://go.nasa.gov/43FVtY1",
    "Another spacewalk in the books! \n\nToday’s spacewalk concluded at 2:17pm ET (1817 UTC) and lasted 5 hours and 35 minutes. Steve Bowen and \n@Astro_Woody\n installed a new roll-out solar array and completed numerous additional tasks outside the \n@Space_Station\n.",
    "JUST ANNOUNCED @ #AIAAaviation: We've got an X designation for the Sustainable Flight Demonstrator!\n\nIntroducing, X-66A \n\nThe new X-plane seeks to inform a potential new gen of more sustainable single-aisle aircraft-the workhorse of passenger airlines. https://nasa.gov/press-release/next-generation-experimental-aircraft-becomes-nasa-s-newest-x-plane/…",
    "How do places on Mars get their name? \n\nMore than 2,000 locations on the Red Planet have official names, recognizing places on Earth, explorers, and even cartoon characters. Learn what inspires names for Martian hills, craters, and rocks: https://go.nasa.gov/3CmCYMm",
    "Later this month, we're opening the Earth Information Center—a hybrid exhibit that offers an interactive look at our changing planet.\n\nMedia are invited to a ribbon-cutting ceremony on Wednesday, June 21, at NASA Headquarters in Washington: https://go.nasa.gov/43STHT7",
    "Large amounts of smoke have been pouring into the eastern U.S. from fires in Quebec. The wildfire smoke is degrading the quality of surface-level air that tens of millions of people breathe.\n\nSeveral NASA satellites are collecting data on the plumes: https://go.nasa.gov/3p1pPFk",
    "Our Artifacts program is open! Eligible institutions can apply to receive historic NASA artifacts to use in STEM education. Create an account and search for items including shuttle tiles, science instruments and spacecraft models like this \n@NASA_SLS\n model: https://go.nasa.gov/3MXGvpc",
    "Congrats to \n@SpaceX\n on the impressive milestones in spaceflight! \n\nThe space shuttle was a workhorse for \n@NASA\n helping build \n@Space_Station\n, & now crew and cargo Dragons are helping support long-duration missions aboard humanity’s home in space. NASA’s investment in commercial… Show more",
    "How do we know what Earth's climate was like long ago? If you look closely, there are clues just about everywhere across our globe. Some are easy to see and others are more subtle. \n@NASAClimate\n scientist Dr. Gavin Schmidt explains.\n\nWant even more?: http://go.nasa.gov/3NihKpm",
    "What does it take to get ready for a spacewalk?\n\nHere's a behind-the-scenes look with \n@Astro_Woody\n, who will make his first trip outside the \n@Space_Station\n on Friday, June 9:",
    "\"'NASA for all.' That's something that I think is really important because we are the universe, right? We are made of star stuff.\"\n\nCelebrate #Pride and learn how Rebecca Sirmons helps tell the story of the universe as NASA TV's executive producer: http://go.nasa.gov/3IVxzj7",
    "Peer pressure.\n\n\n@NASAHubble\n spots a galaxy about 50 million light-years away that holds some surprises: Two nearby galaxies are influencing it and it may or may not have a supermassive black hole at its center. http://go.nasa.gov/45It84O",
    "U.S. Poet Laureate Ada Limón’s poem celebrates water—what connects the two ocean worlds \n@EuropaClipper\n travels between. \n\nMake your special connection to Europa & #SendYourName aboard our spacecraft on this 1.8 billion-mile journey to Jupiter’s moon: http://go.nasa.gov/MessageInABottle…",
    "Keep your eyes in the sky throughout June — you may see the Moon, Mars, Venus, Saturn, Jupiter, or even the Stars of the Summer Triangle!\n\nGet the details with our monthly episode of What’s Up: http://go.nasa.gov/37ePy0B",
    "The diversity of our NASA team is what brings different perspectives to our missions, and we celebrate and share their stories. To protect our people from personal attacks, we have decided to limit comments on this post.",
    "There’s space for everyone this #PrideMonth, and we’re celebrating the LGBTQI+ employees who help us reach for the stars, examine humanity’s place in the universe, and study our home planet: http://go.nasa.gov/3C9ncnU",
    "Live from \n@LibraryCongress\n: U.S. Poet Laureate Ada Limón reveals her Poem for Europa, an original work that will fly aboard the \n@EuropaClipper\n spacecraft to Jupiter's icy moon.",
    "LIVE: Join NASA and \n@BoeingSpace\n officials as we share an update on the first #Starliner Crew Flight Test. Tune in.",
    " \n@NASA\n and \n@BoeingSpace\n will host a media teleconference at 5pm ET today for an update on Boeing's first crewed flight on the CST-100 Starliner to the \n@Space_Station\n.\n\nListen in: http://nasa.gov/live",
    "LIVE: Experts at \n@NASA_Johnson\n are discussing our upcoming spacewalks, scheduled for June 9 and June 15, to set up new solar arrays outside the \n@Space_Station\n.\n\nWe're taking questions from media and the public—share your spacewalk Qs with #AskNASA.",
    "Hurricane season in the Atlantic begins today. Our unique perspective from space allows us to study storms and their evolution, providing data to support forecasting and disaster responses: https://go.nasa.gov/3fYNZYE",
    "Join us and \n@LibraryCongress\n as U.S. Poet Laureate Ada Limón reveals her poem for the \n@EuropaClipper\n mission. The poem will be engraved on the spacecraft, and travel 1.8 billion miles (2.89 billion kilometers) to an icy moon of Jupiter. \n\nTune in: https://bit.ly/42eJZJO",
    "I just reached a milestone only surpassed by Opportunity: 30 km on Mars   \n\nI've explored so much in my 10-plus-year trek through Gale Crater, but there are many more rocks to sample and analyze! Retrace my tracks with this interactive map: http://go.nasa.gov/3EtmSCi",
    "\"Congratulations on an outstanding mission.\"\n\nThe crew of the \n@Space_Station\n shared their thanks and farewells after Axiom Mission 2 undocked from the orbiting lab at 11:05am ET (1505 UTC). #Ax2 is scheduled to splash down off the coast of Florida tonight: https://go.nasa.gov/3MK1kUW",
    "LIVE: The Axiom Mission 2 crew is heading home in \n@SpaceX\n's Dragon Freedom spacecraft after wrapping up the second all-private astronaut mission to the \n@Space_Station\n. #Ax2 undocking is scheduled for 11:05am ET (1505 UTC)."
]