[
    "NOW: Get the latest status update on the all-private #Ax2 mission, set to lift off on Sunday, May 21 at 5:37pm ET (2137 UTC) from \n@NASAKennedy\n. https://youtube.com/watch?v=63TWnnZhePo…",
    "LAUNCH UPDATE \nDue to weather, \n@RocketLab\n and \n@NASA\n are now targeting 1 am EDT Tues, 23 May (5 pm NZST) for the final TROPICS launch. Two #CubeSats are set to join a constellation to improve forecasting of typhoons and hurricanes. For updates https://blogs.nasa.gov/smallsatellites/…",
    "Liftoff! Two TROPICS shoebox-sized satellites are on their way to join the fleet of \n@NASAEarth\n missions studying our home planet. Together, TROPICS will have the potential to gather near-hourly data on the formation and development of tropical cyclones.",
    "LIVE: Watch two small satellites for our storm tracking TROPICS mission launch to orbit. Liftoff on a \n@RocketLab\n Electron rocket is targeted at 9pm ET (0100 UTC May 8), with a two-hour window.",
    "NASA and \n@RocketLab\n are targeting 9pm ET Sunday, May 7 (0100 May 8 UTC), for the first launch of our cyclone-studying TROPICS CubeSats.\n\nTune in here and at http://nasa.gov/live at 8:40pm ET (0040 May 8 UTC) for live launch coverage from New Zealand: https://go.nasa.gov/42xYE3n",
    " LIVE: \n@VP\n Kamala Harris & \n@President_KR\n Yoon Suk Yeol deliver remarks during their tour of \n@NASAGoddard\n to see our climate change research.",
    "People travel to national parks every year to be surrounded by the beauty of nature. #NationalParkWeek\n\nNational parks seen from space are just as beautiful. Maybe more? \n\nYou be the judge. https://go.nasa.gov/4449VtO",
    "What's your favorite \n@NASAHubble\n image? http://bit.ly/3NauIG3\n\nLaunched 33 years ago today, the orbiting telescope captured this image of a nebula where stars are born -- 960 light-years away. http://go.nasa.gov/3VizSlr",
    "Two cosmonauts will conduct a series of spacewalks outside the \n@Space_Station\n beginning Tuesday, April 18, to transfer hardware. Full schedule and NASA TV coverage: https://go.nasa.gov/3L18AfG",
    "Six months from today – on October 14 – a “ring of fire” annular eclipse will cross the U.S.!\n\nBut what is an annular eclipse?\nWhy does it happen?\nWhy does it look like a “ring of fire” in the sky?\n\nThis new video will tell you all about it! ",
    "This #WorldQuantumDay, discover what the quantum realm is really like and how NASA studies it every day—with Ant-Man actor Paul Rudd!\n\nFind out how our exploration of quantum science could help unlock the universe’s biggest mysteries. https://go.nasa.gov/3U0RjG9",
    "Congratulations, \n@ESA\n! #ESAJuice is on its way to Jupiter's large ocean-bearing moons – Callisto, Europa, and Ganymede – to help see whether these icy worlds have the conditions to harbor life. Here's to science. ",
    "Ingenuity perseveres.\n\nOur #MarsHelicopter just flew its 50th flight on the Red Planet (out of a planned five), nearly two years after it first took to the Martian skies. This demo is giving a glimpse of the future of powered flight on other worlds. https://mars.nasa.gov/ingenuity",
    "We love Lucy!\n\nThe \n@NASASolarSystem\n #LucyMission captured its first views of four of its Trojan asteroid targets, from 330 million miles (530 million kilometers) away. Set to fly by in 2027-2028, Lucy will be the first mission ever to visit them:\nhttps://go.nasa.gov/43tu8c3",
    "Space tomatoes, heart studies, and other \n@ISS_Research\n experiments are heading back to Earth this weekend on \n@SpaceX\n's #CRS27, the latest cargo return from the \n@Space_Station\n.\n\nUndocking coverage begins Saturday, April 15, at 10:45am ET (1445 UTC): https://go.nasa.gov/3zRgx0q",
    "We’re bringing back a bit of Bennu. Have questions about our asteroid sample return mission? Submit your question below and hear from experts starting at 2 pm ET.",
    "Representing the \n@csa_asc\n on #Artemis II to the Moon is \n@Astro_Jeremy\n, from London, Ontario. \n\nJeremy Hansen was a fighter pilot before joining CSA, and currently works with NASA on astronaut training and mission operations. This will be Hansen’s first mission in space.",
    "Meet the first member of our #Artemis II Moon crew: mission specialist \n@Astro_Christina\n! \n\nChristina Koch visited the \n@Space_Station\n in 2019, where she took part in the first all-woman spacewalk. She began her career as an electrical engineer at \n@NASAGoddard\n.",
    "LIVE NOW: Who’ll fly around the Moon aboard the #Artemis II mission? You’re about to find out.\n\nThese astronauts will take the next giant leap — paving the way for future lunar landings and human exploration of Mars.",
    "Our #Artemis II pilot is \n@AstroVicGlover\n! \n\nVictor Glover is part of our 2013 class of \n@NASA_Astronauts\n  and was the pilot for NASA’s \n@SpaceX\n Crew-1 mission. He’s logged 3,000 flight hours in more than 40 different aircraft, and will pilot \n@NASA_Orion\n around the Moon.",
    "If you’re on \n@Facebook\n, you can hit “going” for our watch event to get notifications and updates: https://fb.me/e/2BZNQrYBt",
    "You can learn which astronauts will fly around the Moon while you chat on \n@Twitch\n:",
    "Set a reminder on \n@YouTube\n to find out which astronauts are a part of the \n@NASAArtemis\n II mission:",
    "One mission. Four astronauts. So many ways to watch the #Artemis II astronaut announcement.     The thread below tells you all the places you can find this historic event. We make history on Monday, April 3, starting at 11am ET (1500 UTC).",
    " Need more space in your inbox? Subscribe to our weekly newsletter for the latest stories from across the universe.\n\nSign up: http://nasa.gov/subscribe\n\n¡También en español! http://nasa.gov/suscribete",
    "A new \n@NASAEarth\n & \n@CenterForAstro\n mission preparing for launch will be the first to take hourly observations of air quality in North America. Data from #TEMPO will improve forecasts & reveal disparities in pollution exposure within cities and communities. https://go.nasa.gov/3K3Zhd4",
    "Live outside of the continental United States? You can check out upcoming eclipses around the world here.",
    "Where will you be during the eclipses in 2023 and 2024?\n\nThis map shows the path of the Moon’s shadow as it crosses the contiguous U.S. during the eclipse on Oct. 14, 2023 and total solar eclipse on April 8, 2024. Will you get a chance to see them? https://go.nasa.gov/40pj5hL",
    "When we plan missions to send science off Earth, we have to prepare for inhospitable circumstances like acid clouds or extreme heat. Discover how we design spacecraft to travel through dangerous environments in this episode of the Curious Universe podcast: https://go.nasa.gov/42wtU3c",
    "Reporters: Interview the four astronauts who will travel around the Moon and deeper into space than any humans before them.\n\nMedia credentialing to cover the joint \n@NASA\n-\n@CSA_ASC\n reveal of the #Artemis II crew in Houston on April 3 is open now: https://go.nasa.gov/404oRpc"
]