[
    "Interview with \n@BillMaher",
    "Starlink enables greater access to healthcare and medical services, especially for those in remote locations.\n\nThanks to the \n@PolarisProgram\n, this \n@StJude\n hospital in the Philippines is better connected with researchers and doctors worldwide ",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "Liftoff!",
    "Also, which kind of bat – fruit eating bat or insect eating bat ?",
    "Vote at the 2023 Tesla Shareholder Meeting →",
    "Thank you to our 1.5M+ customers around the world! ",
    "Highly recommend that organizations sign up and validate their affiliates to prevent impersonation",
    "Rolling out next month, this platform will allow media publishers to charge users on a per article basis with one click.\n\nThis enables users who would not sign up for a monthly subscription to pay a higher per article price for when they want to read an occasional article.… Show more",
    "While other car manufacturers struggle with updates, Tesla continuously improves its fleet and features. With its latest update, AEB now works in reverse and up to 124 mph (200 km/h).",
    "Imagine the countless lives we could save if more people drove Teslas. With safety as a top priority, Tesla is leading the charge towards a safer future on our roads.",
    "Home",
    "Not all active safety systems are created equal. Even within the 5-star category, there can be considerable differences in the effectiveness of assistance systems like AEB.",
    "All proceeds go to content creators, we keep nothing",
    "Major software upgrades underway across the board. \n\nEncrypted DMs & other DM upgrades rolling out this week.",
    "Support content creators around the world in near & far away places!\n\nFor many this represents a vital source of income & enables them to put more time into creating great content for you.",
    "I propose the lmfao test for AI",
    "Falcon Heavy is green for launch",
    "About to do Falcon Heavy risk review. I love that rocket, but it’s scary. So many state changes post liftoff.",
    "On \n@billmaher\n show tonight",
    "On @billmaher show tonight",
    "Content creators may wish to enable subscriptions on this platform. \n\nJust tap on Monetization in settings.",
    "We live in the most interesting of times",
    "More photos from the first flight test of a fully integrated Starship and Super Heavy rocket",
    "FIRST STARSHIP LAUNCH.\n3 PEOPLE  SHARE THEIR EXPERIENCES.\n\n(April 22, 2023) S. Padre Island, Texas\n\nI wanted to write about my first rocket launch. I realized that to best write for you, I had to talk to other people about their experiences.  I’m sharing with you some of the… Show more",
    "The least bad solution to the AGI control problem that I can think of is to give every verified human a vote",
    "What makes \n@CommunityNotes\n so powerful is that people with different points of view have to agree that a note is correct for it to be shown",
    "check mate",
    "Every vehicle we sell, battery we install & solar panel we add moves the needle in the direction of a sustainable future.\n\nThank you to the Tesla team, customers & supporters for bringing us closer to our goal!\n\nHappy Earth Day ",
    "Starship liftoff in slow motion"
]