[
    "Falcon 9’s first stage has landed on the A Shortfall of Gravitas droneship",
    "Liftoff!",
    "“Highlights Tab” is now live on Twitter. You can now showcase your favorite tweets on your profile. ",
    "This conspiracy theory that birds are actually government spy drones is … totally false",
    "Quanto sei bella Roma!",
    "Ho accolto con grande piacere oggi a Palazzo Chigi \n@elonmusk\n. Un incontro molto proficuo e un momento di grande cordialità dove abbiamo affrontato alcuni temi cruciali: innovazione, opportunità e rischi dell'intelligenza artificiale, regole europee di mercato e natalità. Avanti… Show more",
    "… attack on the military-industrial complex. \n\nThe lobbying power of large government contractors is far higher than it should be for the good of the people.",
    "Powerwall with Backup Switch automatically detects grid outages & powers your home when you need it most → https://tesla.com/support/energy/powerwall/learn/tesla-backup-switch…",
    "“What are you thinking?”",
    "Starlink is now available in Trinidad and Tobago   → http://starlink.com/map",
    "Kim Jong Un Attends Ivy League University To Learn New Brainwashing Techniques",
    "Augmented reality is amazing",
    "Looking to hire a VP of Witchcraft & Propaganda",
    "Best WW3 song ever",
    "In-flight internet that works as soon as you walk on your flight  \n\nh/t \n@flyjsx",
    "Credit to Larry Page for alerting me to the importance of air filtration",
    "Extremely concerning",
    "Starlink connecting schools in Peru ",
    "This platform will provide email addresses of subscribers (who opt in) to content creators, so that creators are able to leave this platform easily & take their subscribers with them if they want",
    "2,000 sites now live in North America, delivering up to 500 million miles per month ",
    "Congrats Tesla Plaid racing team!",
    "From SJM",
    "Falcon 9 launches 52 \n@Starlink\n satellites to orbit, completing this first stage booster’s 14th launch and landing",
    "Starlink satellites are equipped with optical space lasers (pew pew), which allow us to provide truly global coverage and serve customers in the most remote locations on Earth http://starlink.com/technology",
    "Also, you can now change video playback speed",
    "Celebrated with 10k+ employees & their families at Giga Berlin Family Day ",
    "Previously, I had thought it was some pescatarian conspiracy theory, but nope",
    "I was today’s years old when I learned that some people genuinely love cooked salmon",
    "Regenerative braking enables you to bring your Tesla to a complete stop without using the brake pedal, maximizing efficiency & reducing wear & tear\n\nAlso, traction & stability controls are active during regen, giving you more control during deceleration",
    "Deployment of \n@Arabsat\n BADR-8 confirmed"
]