[
    "U.S. and international media: You are invited to \n@NASAKennedy\n to interview subject matter experts and view the \n@NASA_Orion\n spacecraft slated for the next three #Artemis missions.\n \nFor more information, including deadlines and how to apply, click here: http://go.nasa.gov/42Lm58M",
    "\"I try to be visible, to show folks who may still be in the closet that one can live their authentic life and be a part of something so amazing.\" Celebrate #Pride and read the story of Amy Lendian, a systems engineering supervisor at \n@NASAKennedy\n. https://go.nasa.gov/3NfJcCU",
    "Steve Bowen, 10-time spacewalker.  ",
    "@Astro_Kobi\n asked a \n@NASASolarSystem\n scientist some of the biggest questions about the universe.\n\nHere’s 3 cosmic facts you might not know…\n\n“Great Observatories Unique Views of the Milky Way”\nNASA/JPL-Caltech/ESA/CXC/STScI\n2009\n\n@NASA\n\n#UnpackItNASA",
    "Teamwork makes the dream work! Researchers at \n@NASAAmes\n are creating tech to let small satellites work together—without being managed individually by mission controllers. One satellite swarm will fly this summer to test their work in our Starling mission. https://go.nasa.gov/45ZC5qF",
    "We're going on an adventure... High Above Down Under!\n\nJoin us June 27 for \n@NASAGoddard\n's new video series, following two NASA teams as they launch rockets from Australia to help us look for life around distant stars: https://youtu.be/Ji_JOPPjwFY",
    "Check out our Guide to Visiting a Gamma-Ray Burst",
    "It’s giving…life.    #WorldOceansDay",
    "The image from this post is by Lauren Dauphin, who used an image from \n@NOAA\n’s GOES 16 satellite and the National Environmental Satellite, Data, and Information Service (NESDIS).",
    "Join us for a Twitter Space! We’re celebrating 50 years of studying gamma-ray bursts, spurts of bright light coming from some of the largest explosions in the universe. Hear from experts about gamma-ray astronomy & the high-energy events that create them.",
    "LIVE: Get the latest details on the launch of \n@SpaceX\n’s #CRS28 uncrewed cargo resupply mission to the \n@Space_Station\n. Liftoff is currently set for Saturday, June 3, at 12:35pm ET (1635 UTC).",
    "Soon, \n@SpaceX\n’s #CRS28 Dragon cargo spacecraft is set to launch food, supplies, scientific experiments, & tech demos to the \n@Space_Station\n. Learn about the science aboard, including plant & genetic studies and satellite projects: https://go.nasa.gov/43dcbOt",
    "U.S. Poet Laureate Ada Limón’s poem celebrates water—what connects the two ocean worlds \n@EuropaClipper\n travels between. \n\nMake your special connection to Europa & #SendYourName aboard our spacecraft on this 1.8 billion-mile journey to Jupiter’s moon: http://go.nasa.gov/MessageInABottle…",
    "Snacks? Go. Science? Go. Ready to soak up some rays? Go. It's not NASA beach day—we're targeting June 3 to launch the next \n@SpaceX\n cargo mission to the \n@Space_Station\n. It carries new station solar arrays.\n\nHow to watch #CRS28, from pre-launch to liftoff: https://go.nasa.gov/3MGzPMi",
    "A team of astrophysicists and citizen scientists have identified what may be some of the final planets NASA’s retired Kepler observed during its nearly decade-long mission. They were found in the last data obtained as the telescope was running out of fuel. https://go.nasa.gov/3MEFSkw",
    "LIVE: Listen as we discuss the science aboard the next \n@SpaceX\n cargo mission set for Saturday, June 3, sending solar arrays, small satellites, and a plant experiment to the \n@Space_Station\n. Tag questions #AskNASA.",
    "Stay tuned: Our UAP study panelists are taking a brief break. Check the agenda for the upcoming topics and timeline: http://go.nasa.gov/3MFpP5T",
    "NOW: We're holding a public meeting of our independent study team for categorizing and evaluating data of unidentified anomalous phenomena, or UAP. More info on today's meeting: https://go.nasa.gov/3nVqp7g",
    "Welcome back to Earth! It's been an incredible journey for the all-private astronaut crew of #Ax2. They've conducted vital scientific experiments and brought the wonders of space closer to us all. Congratulations to @SpaceX and @Axiom_Space for another successful mission!",
    "Snacks? Go. Science? Go. Ready to soak up some rays? Go. It's not NASA beach day—we're targeting June 3 to launch the next @SpaceX cargo mission to the @Space_Station. It carries new station solar arrays.\n\nHow to watch #CRS28, from pre-launch to liftoff: https://go.nasa.gov/3MGzPMi",
    "LIVE: Listen as we discuss the science aboard the next @SpaceX cargo mission set for Saturday, June 3, sending solar arrays, small satellites, and a plant experiment to the @Space_Station. Tag questions #AskNASA.",
    "\"Congratulations on an outstanding mission.\"\n\nThe crew of the @Space_Station shared their thanks and farewells after Axiom Mission 2 undocked from the orbiting lab at 11:05am ET (1505 UTC). #Ax2 is scheduled to splash down off the coast of Florida tonight: https://go.nasa.gov/3MK1kUW",
    "LIVE: The Axiom Mission 2 crew is heading home in @SpaceX's Dragon Freedom spacecraft after wrapping up the second all-private astronaut mission to the @Space_Station. #Ax2 undocking is scheduled for 11:05am ET (1505 UTC).",
    "LIVE: After more than a week of science, outreach, and on-orbit activities, the all-private astronaut crew of #Ax2 is boarding their @SpaceX Dragon Freedom spacecraft to return to Earth. Hatch closure is scheduled for 9:10am ET (1310 UTC): http://nasa.gov/live",
    "TROPICS like it's hot! We have payload deployment!   \n\nThe science team will now seek confirmation of signal which may take several orbits. For updates on TROPICS tracking, follow @NASAEarth!",
    "Liftoff! Two small satellites are on the way to join two already in orbit for our TROPICS mission. TROPICS will provide near-hourly data that could improve forecasts of tropical cyclones and severe weather.",
    "LIVE: Watch the second pair of shoebox-sized satellites launch to orbit for our storm-tracking TROPICS mission. Liftoff on a @RocketLab Electron rocket is targeted at 11:46pm ET (0346 UTC) at the opening of the launch window.",
    "Outside the U.S.? Select NASA internship opportunities are also available for international students: https://go.nasa.gov/InternationalInterns…",
    "Want to intern with us? Applications are open to enrolled STEM and non-STEM undergrads, graduate students, and recent graduates.\n\nCheck out the opportunities available for our fall 2023 class of @NASAInterns. Apply by Saturday, May 27: https://intern.nasa.gov",
    "Our @NASASTEM educator and classroom resources make it easy to bring space to you, in classrooms or at home schools. Through partnership with the @usedgov, we provide free, high-quality STEM and space science resources for the nation’s educators: https://bit.ly/43647ig"
]