[
    "Incompetence, in the limit, is indistinguishable from sabotage",
    "Transparency builds trust …",
    "Yikes",
    "Sorry this app takes up so much space",
    "End Poem of minecraft is literally the best thing I've ever read?? So worth reading the whole thing: https://en.m.wikisource.org/wiki/End_Poem",
    "Spaces with @RonDeSantis in ~2 hours!",
    "Twitter is the town square of the people",
    "BREAKING: \n@FoxNews\n confirms Florida Governor \n@RonDeSantis\n will announce his 2024 Presidential run tomorrow night, 6pm ET in a Twitter Spaces interview with \n@elonmusk\n.",
    "And works almost everywhere on Earth with global roaming enabled!",
    "Both quality & quantity of high quality posts of all kinds (short text, long essays, pictures, audio & video) have improved dramatically. \n\nThank you for contributing your voice to humanity’s digital public square!",
    "Starlink for RVs can be used anywhere Starlink provides service and is ideal for camping and other activities in rural or remote locations where internet access has been unreliable or completely unavailable → http://starlink.com/rv",
    "fwiw you can post thirst pics on twitter too",
    "All those moments, \nwill be lost in time\nlike tears in rain …",
    "¡Starlink ya está disponible en Panamá!",
    "To heir is human, \nTo procreate divine",
    "Love to see Starlink providing great connectivity to those who had little or nothing before. \n\nAs soon as you can access the Internet, you can learn almost anything, so it’s absolutely essential for education.\n\n\n@khanacademy\n being a great example.",
    "Once you’ve tasted the full phone to car and technological experience of a Tesla you can’t go back to any other cars. There’s nothing like it on the market by a mile.\n\nIt’s all the small things that quickly adds up to make you never want to drive anything else, ever.",
    "It was really unfair to Magneto",
    "I’d like apologize for this post",
    "\"A lot of people still think Teslas are super expensive...but now we're at the point where the starting point of a Tesla is actually below the average selling price of a car in the United States,\" Elon Musk said Tuesday after Tesla's shareholder meeting. http://cnb.cx/42HSsWG",
    "Spaces interview with \n@davidfaber\n starting now",
    "Tesla shareholder meeting underway",
    "As more satellites & ground stations are added, latency & jitter will improve. Goal is <20ms latency.",
    "J. Robert Oppenheimer's grandson: \"We must get over our cognitive and political bias: Nuclear energy is necessary and safe, and not the same as nuclear weapons\"",
    "Verified organization is one of the most important additions to Twitter. \n@elonmusk",
    "Thanks Dave!",
    "With each launch of our first gen \n@Starlink\n satellites, we add over a Tbps of capacity to the constellation; allowing us to continue improving coverage and connecting more people around the world with high-speed internet from space",
    "Super easy to use Starlink out of the box, no professional installer needed!",
    "Starship is the largest, most capable rocket ever developed and will allow us to achieve a shared vision of a future where humanity is out exploring stars → http://youtube.com/spacex",
    "Early version of encrypted direct messages just launched.\n\nTry it, but don’t trust it yet."
]