[
    "Interview with \n@BillMaher",
    "As soon as \n@LindaYacc\n is ready, we will do a Spaces where you can ask us anything",
    "You asked (loudly), we listened.\n\nWe’ve reduced the signup flow for creators from 27 steps to just 4.\n\nIt’s never been easier to earn a living on Twitter. Tap on “Monetization” in settings to apply today.",
    "One-third of humanity remains offline, and many users only have basic connectivity.\n\nThe Ministry of Education in El Salvador—among many others around the world—is installing Starlink in schools to help close the digital divide ",
    "I am excited to welcome Linda Yaccarino as the new CEO of Twitter!\n\n\n@LindaYacc\n will focus primarily on business operations, while I focus on product design & new technology.\n\nLooking forward to working with Linda to transform this platform into X, the everything app.",
    "As seen by an unaffected third party",
    "Remarkable how \n@nytimes\n, \n@latimes\n & \n@washingtonpost\n moved in lockstep, with \n@WSJ\n trailing by ~6 months",
    "Massive public manipulation",
    "WhatsApp cannot be trusted",
    "Vegas Loop is expanding - 65 miles and 69 stations!  Thanks to \n@ClarkCountyNV\n for the great partnership.",
    "The idea that governments around the world have for years been secretly censoring ordinary citizens sounds crazy, but it's true. Worse, they are now on the cusp of imposing what can only be described as a totalitarian system to end freedom of speech as we know it.",
    "May the 4th be with you ",
    "Falcon 9’s first stage has landed on the A Shortfall of Gravitas droneship",
    "Watch Falcon 9 launch 56 Starlink satellites to orbit → http://spacex.com/launches/",
    "Vegas Loop is expanding - 65 miles and 69 stations!  Thanks to @ClarkCountyNV for the great partnership.",
    "Fairing reentry on the ViaSat-3 mission was the hottest and fastest we've ever attempted.  The fairings re-entered the atmosphere greater than 15x the speed of sound, creating a large trail of plasma in its wake",
    "Starship Liftoff",
    "Starship Supersonic",
    "In a short time, \n@NASAWebb\n has revealed new info about the composition & atmospheres of \n@NASAExoplanets\n, while continuing to perfect techniques that we'll need to identify habitable worlds outside our own. Peruse some unexpected findings discovered so far: https://go.nasa.gov/3Ai2cdI",
    "More Community Notes! Today’s new algorithm update boosts the number of Helpful notes by 10%+. It builds on last week’s change that uses confidence scores to identify notes that are broadly found helpful with high precision. https://communitynotes.twitter.com/guide/en/under-the-hood/ranking-notes#modeling-uncertainty…",
    "Great song",
    "Such a great day in so many ways",
    "First fully integrated Starship lifting off for the first time!",
    "Liftoff from Starbase",
    "Congrats \n@SpaceX\n team on an exciting test launch of Starship!\n\nLearned a lot for next test launch in a few months.",
    "Starship's flight test window opens at 7:00 a.m. CT tomorrow; a live webcast will begin ~45 minutes before liftoff → http://spacex.com/launches/mission/?missionId=starship-flight-test…",
    "Launch attempt tomorrow",
    "Teams are completing final checkouts and reviews ahead of Starship’s first flight test attempt; weather is looking pretty good for tomorrow morning but we're keeping an eye on wind shear http://spacex.com/launches/mission/?missionId=starship-flight-test…",
    "Starship fully stacked at Starbase",
    "Yay! Nice work Dragon Team!"
]