[
    "NOW: A \n@NASAAero\n project update on the experimental X-57 all-electric aircraft.",
    "Beethoven wasn’t the only one with dramatic flair 200 years ago—Sagittarius A*, the Milky Way’s supermassive black hole, may have also composed an intense flare as it consumed nearby material.\n\nTune in for #IXPE and \n@ChandraXray\n’s sonification: http://go.nasa.gov/46da7rL",
    ".\n@POTUS\n Biden and Prime Minister \n@narendramodi\n know that discovery deepens diplomacy. \n\nWe look forward to all that we will accomplish here on Earth and in space, including our joint Earth science mission NISAR, and are especially grateful for India’s signing of the Artemis… Show more",
    "On Friday, June 23, \n@NASAAero\n leaders will give an update on the experimental X-57 all-electric aircraft. Tune in at 12pm ET (1600 UTC) for a media teleconference: https://go.nasa.gov/3NJOxE0",
    "The diversity of our NASA team is what brings different perspectives to our missions, and we celebrate and share their stories. To protect our people from personal attacks, we have decided to limit comments on this post.",
    "Forty years ago today, Sally Ride launched into history as the first U.S. woman to go to space. An astronaut, physicist, and educator, she inspired generations of women and girls to pursue careers in science and technology. https://go.nasa.gov/3NzVmHU",
    "Happy Father’s Day, Sun \n\nOur Sun may be old, large, and full of gas, but it also provides our solar system with energy and light, without which life as we know it would not exist. Shout out a father figure who gives you energy:",
    "Every December, the Geminids light up the night sky in one of the biggest meteor showers of the year.\n\nAs our Parker Solar Probe swoops around the Sun—closer than any spacecraft in history—it's helping uncover how these shooting stars came into existence: https://go.nasa.gov/3NfS0se",
    "My first EVA (Extravehicular Activity) was an incredible life experience. The team in mission control \n@NASA_Johnson\n was superb. The 1A power channel is now 10kW more powerful. Looking forward to doing it again this week.",
    "Teamwork makes the dream work! Researchers at \n@NASAAmes\n are creating tech to let small satellites work together—without being managed individually by mission controllers. One satellite swarm will fly this summer to test their work in our Starling mission. https://go.nasa.gov/45ZC5qF",
    "We're going on an adventure... High Above Down Under!\n\nJoin us June 27 for \n@NASAGoddard\n's new video series, following two NASA teams as they launch rockets from Australia to help us look for life around distant stars: https://youtu.be/Ji_JOPPjwFY",
    "The ocean is one of Earth’s largest ecosystems and helps moderate our climate. NASA has an array of missions dedicated to studying this precious part of the planet, with more to come. \n\nDive in: http://go.nasa.gov/43yYj0w ",
    "It’s giving…life.    #WorldOceansDay",
    "The image from this post is by Lauren Dauphin, who used an image from \n@NOAA\n’s GOES 16 satellite and the National Environmental Satellite, Data, and Information Service (NESDIS).",
    "LIVE: We're sending science—and a new set of unrolling solar arrays—to the \n@Space_Station\n!\n\n\n@SpaceX\n's uncrewed #CRS28 mission is scheduled to launch at 11:47am ET (1547 UTC), weather permitting. Watch with us.",
    "Today's #CRS28 cargo launch is being waved off due to high winds in the recovery area. \n\nMonday's launch attempt is scheduled for 11:47am ET (1547 UTC), with NASA TV coverage beginning at 11:15am ET (1515 UTC).",
    "A geyser on Saturn’s moon Enceladus, the #Ax2 all-private astronaut crew depart the \n@Space_Station\n, and an independent panel of experts discusses unidentified anomalous phenomena: all this & more, this week at NASA.\n\nSubscribe for more space in your life: http://nasa.gov/subscribe",
    "We're now targeting Sunday, June 4 for the launch of #CRS28, to allow for improving weather conditions and additional vehicle preparations. NASA TV coverage will begin at 11:45am ET (1545 UTC), with launch targeted for 12:12pm (1612 UTC): https://blogs.nasa.gov/crs-28/2023/06/03/weather-40-favorable-for-spacexs-28th-cargo-resupply-launch/…",
    "LIVE: Get the latest details on the launch of \n@SpaceX\n’s #CRS28 uncrewed cargo resupply mission to the \n@Space_Station\n. Liftoff is currently set for Saturday, June 3, at 12:35pm ET (1635 UTC).",
    "Soon, \n@SpaceX\n’s #CRS28 Dragon cargo spacecraft is set to launch food, supplies, scientific experiments, & tech demos to the \n@Space_Station\n. Learn about the science aboard, including plant & genetic studies and satellite projects: https://go.nasa.gov/43dcbOt",
    "U.S. Poet Laureate Ada Limón’s poem celebrates water—what connects the two ocean worlds \n@EuropaClipper\n travels between. \n\nMake your special connection to Europa & #SendYourName aboard our spacecraft on this 1.8 billion-mile journey to Jupiter’s moon: http://go.nasa.gov/MessageInABottle…",
    "Keep your eyes in the sky throughout June — you may see the Moon, Mars, Venus, Saturn, Jupiter, or even the Stars of the Summer Triangle!\n\nGet the details with our monthly episode of What’s Up: http://go.nasa.gov/37ePy0B",
    "There’s space for everyone this #PrideMonth, and we’re celebrating the LGBTQI+ employees who help us reach for the stars, examine humanity’s place in the universe, and study our home planet: http://go.nasa.gov/3C9ncnU",
    "Live from \n@LibraryCongress\n: U.S. Poet Laureate Ada Limón reveals her Poem for Europa, an original work that will fly aboard the \n@EuropaClipper\n spacecraft to Jupiter's icy moon.",
    "Snacks? Go. Science? Go. Ready to soak up some rays? Go. It's not NASA beach day—we're targeting June 3 to launch the next \n@SpaceX\n cargo mission to the \n@Space_Station\n. It carries new station solar arrays.\n\nHow to watch #CRS28, from pre-launch to liftoff: https://go.nasa.gov/3MGzPMi",
    "A team of astrophysicists and citizen scientists have identified what may be some of the final planets NASA’s retired Kepler observed during its nearly decade-long mission. They were found in the last data obtained as the telescope was running out of fuel. https://go.nasa.gov/3MEFSkw",
    "LIVE: Listen as we discuss the science aboard the next \n@SpaceX\n cargo mission set for Saturday, June 3, sending solar arrays, small satellites, and a plant experiment to the \n@Space_Station\n. Tag questions #AskNASA.",
    "\"Congratulations on an outstanding mission.\"\n\nThe crew of the \n@Space_Station\n shared their thanks and farewells after Axiom Mission 2 undocked from the orbiting lab at 11:05am ET (1505 UTC). #Ax2 is scheduled to splash down off the coast of Florida tonight: https://go.nasa.gov/3MK1kUW",
    "LIVE: The Axiom Mission 2 crew is heading home in \n@SpaceX\n's Dragon Freedom spacecraft after wrapping up the second all-private astronaut mission to the \n@Space_Station\n. #Ax2 undocking is scheduled for 11:05am ET (1505 UTC).",
    "LIVE: After more than a week of science, outreach, and on-orbit activities, the all-private astronaut crew of #Ax2 is boarding their \n@SpaceX\n Dragon Freedom spacecraft to return to Earth. Hatch closure is scheduled for 9:10am ET (1310 UTC): http://nasa.gov/live"
]