[
    "This Saturday, July 1, \n@ESA\n's Euclid spacecraft is scheduled to lift off, shedding light on dark matter and dark energy—two of the biggest modern mysteries about our universe. We'll stream ESA's broadcast live on NASA TV starting at 10:30am ET (1430 UTC): https://go.nasa.gov/3PE1IaY",
    "What would you do if you got a flat tire…on the Moon? In \n@NASASTEM\n's latest Surprisingly STEM episode, engineer Heather Oravec talks about reinventing the wheel—literally—to create tires tough enough to handle long-distance travel over lunar or Martian terrain.",
    "Scientists using \n@NASAWebb\n have detected a crucial carbon compound in space for the first time. Known as methyl cation (pronounced cat-eye-on), it’s thought to aid in building more complex carbon molecules—the foundation for all known life: https://go.nasa.gov/3NpjpIA",
    "Mark your calendars for April 8, 2024: A total solar eclipse will darken the skies of North America as the Moon blocks the light of the Sun for a few minutes.\n\nWe're funding five experiments to study the Sun, Earth, and their interactions: https://go.nasa.gov/42T5U9L",
    "Training begins for the \n@NASAArtemis\n II astronauts!\n\nWhile some of us are enjoying the start of summer vacation, they just began training for their mission to the Moon and back.\n\nHere's the trajectory map they covered in class this week: https://go.nasa.gov/44dztUs",
    "A new way to visualize our changing planet, \n@NASAWebb\n searches for an atmosphere on TRAPPIST-1 c, and a look inside the future home of asteroid samples from OSIRIS-REx.\n\nAll this and more—This Week at NASA. http://nasa.gov/subscribe",
    "An asteroid sample is out for delivery!\n\nThis September, OSIRIS-REx will bring an asteroid sample collected in space back to Earth—a NASA first. Join experts for a teleconference on Monday at 1pm ET (1700 UTC) as they answer questions #ToBennuAndBack: https://go.nasa.gov/3CHeRs5",
    "Welcome to the #Artemis Accords, Ecuador and India. \n\nThis week, the two nations became the 26th and 27th, respectively, to commit to the peaceful and safe exploration of space as we journey to the Moon, Mars, and beyond.\n\n: https://go.nasa.gov/3Jwkwox\n: https://go.nasa.gov/3r16pBl",
    "What's new with the Moon?\n\nOur Daily Moon Guide highlights what you're apt to see with clear skies, along with upcoming lunar events and other fun \n@NASAMoon\n facts. Take a look (up): https://go.nasa.gov/MoonGuide",
    "We’ve taken light data detected by four of our telescopes—\n@ChandraXray\n, \n@NASAWebb\n, \n@NASAHubble\n, and Spitzer Space Telescope—and turned them into sound. Hear what some galaxies and stars sound like: https://go.nasa.gov/3PjoNzt",
    "The Sun emitted a strong solar flare on June 20, 2023, peaking at 1:09 ET. NASA’s Solar Dynamics Observatory captured an image of the event, which was classified as X1.0. https://go.nasa.gov/3qSaNT7",
    "Two Roscosmos cosmonauts will conduct a spacewalk to make upgrades to the \n@Space_Station\n on Thursday, June 22, beginning around 10:20am ET (1420 UTC). NASA TV coverage starts at 9:45am ET (1345 UTC): https://go.nasa.gov/43M2AOM",
    "Today is #Juneteenth, commemorating the day in 1865 when enslaved African Americans in Galveston, Texas were finally able to claim their freedom. In a conversation filmed at \n@SpaceCenterHou\n, \n@AstroVicGlover\n reflects on the holiday and its history.",
    "Forty years ago today, Sally Ride launched into history as the first U.S. woman to go to space. An astronaut, physicist, and educator, she inspired generations of women and girls to pursue careers in science and technology. https://go.nasa.gov/3NzVmHU",
    "Happy Father’s Day, Sun \n\nOur Sun may be old, large, and full of gas, but it also provides our solar system with energy and light, without which life as we know it would not exist. Shout out a father figure who gives you energy:",
    "Every December, the Geminids light up the night sky in one of the biggest meteor showers of the year.\n\nAs our Parker Solar Probe swoops around the Sun—closer than any spacecraft in history—it's helping uncover how these shooting stars came into existence: https://go.nasa.gov/3NfS0se",
    "Another busy week at NASA\n\n\n@NASA_Astronauts\n install solar arrays on the \n@Space_Station\n, a new X-plane is named, and a laser communication system for #Artemis awaits integration.\n\nSubscribe for more space and aeronautics in your life: http://nasa.gov/subscribe",
    "Join us at 7:30am ET (1130 UTC) on June 15 for another spacewalk! \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n will install another roll-out solar array on the \n@Space_Station\n, scheduled to start at 8:55am ET (1255 UTC).",
    "Live Now \n\nJoin us for a \"guided tour\" of our \"Eyes on Asteroids\" real-time visualization app. Learn how to use the tool and explore the 28,000 known asteroids and comets in our cosmic neighborhood.",
    "My first EVA (Extravehicular Activity) was an incredible life experience. The team in mission control \n@NASA_Johnson\n was superb. The 1A power channel is now 10kW more powerful. Looking forward to doing it again this week.",
    "To-do: Become a NASA Intern \n\nToday our #NASAInterns completed their first week at \n@NASA\n. Already these #ArtemisGeneration interns are putting their talent and creativity to work for the betterment of all. \n\nWelcome to the team!",
    ".\n@NASA_Astronauts\n Stephen Bowen and \n@Astro_Woody\n successfully installed and deployed the space station's fifth roll-out solar array during a six-hour and three-minute spacewalk today.",
    "Upgrade in progress: a new solar array unrolls on the \n@Space_Station\n. It will produce more than 20 kilowatts of electricity to augment the station's power supply and support more \n@ISS_Research\n.",
    "Time for work! \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n have switched their suits to battery power and exited the Quest airlock. Now, they’ll install a roll-out solar array on the \n@Space_Station\n.",
    "LIVE: Spacewalk with us. Watch as \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n install a new roll-out solar array on the \n@Space_Station\n, scheduled to start at 9:15am ET.",
    "The ocean is one of Earth’s largest ecosystems and helps moderate our climate. NASA has an array of missions dedicated to studying this precious part of the planet, with more to come. \n\nDive in: http://go.nasa.gov/43yYj0w ",
    "It’s giving…life.    #WorldOceansDay",
    "Large amounts of smoke have been pouring into the eastern U.S. from fires in Quebec. The wildfire smoke is degrading the quality of surface-level air that tens of millions of people breathe.\n\nSeveral NASA satellites are collecting data on the plumes: https://go.nasa.gov/3p1pPFk",
    "The image from this post is by Lauren Dauphin, who used an image from \n@NOAA\n’s GOES 16 satellite and the National Environmental Satellite, Data, and Information Service (NESDIS).",
    "Join us for a Twitter Space! We’re celebrating 50 years of studying gamma-ray bursts, spurts of bright light coming from some of the largest explosions in the universe. Hear from experts about gamma-ray astronomy & the high-energy events that create them."
]