[
    "Sharing another update on the changes we’ve made to our open source repos this week and a preview of what’s next ",
    "Great statement by \n@votetimscott\n!",
    "Ending the digital divide requires making devices more accessible. \n\nStarlink kits are designed to include everything needed to connect. And they travel well too ",
    "Spaces interview with \n@davidfaber\n starting now",
    "Tesla shareholder meeting underway",
    "As more satellites & ground stations are added, latency & jitter will improve. Goal is <20ms latency.",
    "Soros reminds me of Magneto",
    "Tesla Powerwall does the seem for individual homes (if you have the backup switch installed)\nhttp://Tesla.com/Powerwall",
    "We are today sharing an update on our approach in Turkey.\n\nWe were in negotiation with the Turkish Government throughout last week, who made clear to us Twitter was the only social media service not complying in full with existing court orders.\n\nWe received what we believed to be… Show more",
    "Liftoff!",
    "Contributors’ time is valuable, and best spent reviewing high quality notes. Today we’re making the number of notes one can write in 24h proportional to their track record. The more helpful notes you’ve written, the more you can write. If you hit your limit, you’ll see this:",
    "S3XY vehicles  hot engineers \n\nOur field quality engineers head to Dubai at the hottest time of the year for extreme heat & durability testing—temperatures reach over 50°C",
    "Thanks Dave!",
    "Starship is the largest, most capable rocket ever developed and will allow us to achieve a shared vision of a future where humanity is out exploring stars → http://youtube.com/spacex",
    "Early version of encrypted direct messages just launched.\n\nTry it, but don’t trust it yet.",
    "Falcon 9’s first stage has landed on the Of Course I Still Love You droneship",
    "Also, which kind of bat – fruit eating bat or insect eating bat ?",
    "Vote at the 2023 Tesla Shareholder Meeting →",
    "Home",
    "Rolling out next month, this platform will allow media publishers to charge users on a per article basis with one click.\n\nThis enables users who would not sign up for a monthly subscription to pay a higher per article price for when they want to read an occasional article.… Show more",
    "More photos from the first flight test of a fully integrated Starship and Super Heavy rocket",
    "FIRST STARSHIP LAUNCH.\n3 PEOPLE  SHARE THEIR EXPERIENCES.\n\n(April 22, 2023) S. Padre Island, Texas\n\nI wanted to write about my first rocket launch. I realized that to best write for you, I had to talk to other people about their experiences.  I’m sharing with you some of the… Show more",
    "We’re adding more transparency to the enforcement actions we take on Tweets. As a first step, soon you’ll start to see labels on some Tweets identified as potentially violating our rules around Hateful Conduct letting you know that we’ve limited their visibility. … Show more",
    "Learned a lot today, now offloading propellant, retrying in a few days …",
    "A pressurant valve appears to be frozen, so unless it starts operating soon, no launch today",
    "Teams are working towards Thursday, April 20 for the first flight test of a fully integrated Starship and Super Heavy rocket → http://spacex.com/launches/mission/?missionId=starship-flight-test…",
    "We will continue to remove illegal content and suspend bad actors from our platform. We’re committed to increasing transparency around our moderation actions, and we’ll continue to share updates on our progress. You can learn more about our various enforcement actions here:… Show more",
    "We may get it wrong occasionally, so authors will be able to submit feedback on the label if they think we incorrectly limited their content’s visibility. In the future, we plan to allow authors to appeal our decision to limit a Tweet’s visibility.",
    "These actions will be taken at a tweet level only and will not affect a user’s account. Restricting the reach of Tweets helps reduce binary “leave up versus take down” content moderation decisions and supports our freedom of speech vs freedom of reach approach.",
    "Cryogenic propellant load of Starship is underway, liftoff in T minus 1 hour"
]