[
    "We're now targeting Sunday, June 4 for the launch of #CRS28, to allow for improving weather conditions and additional vehicle preparations. NASA TV coverage will begin at 11:45am ET (1545 UTC), with launch targeted for 12:12pm (1612 UTC): https://blogs.nasa.gov/crs-28/2023/06/03/weather-40-favorable-for-spacexs-28th-cargo-resupply-launch/…",
    "LIVE: Get the latest details on the launch of \n@SpaceX\n’s #CRS28 uncrewed cargo resupply mission to the \n@Space_Station\n. Liftoff is currently set for Saturday, June 3, at 12:35pm ET (1635 UTC).",
    "Soon, \n@SpaceX\n’s #CRS28 Dragon cargo spacecraft is set to launch food, supplies, scientific experiments, & tech demos to the \n@Space_Station\n. Learn about the science aboard, including plant & genetic studies and satellite projects: https://go.nasa.gov/43dcbOt",
    "Paula Cain started her career in fashion design—now, she's a thermal blanket technician at \n@NASAGoddard\n, making sure our telescopes and spacecraft can run at a steady temperature.\n\nLearn more about her journey in our latest \n@NASASTEM\n episode of \"Surprisingly STEM!\"",
    "Our \n@NASAEarth\n TROPICS mission is safely in orbit following today's successful launch by \n@RocketLab\n. Two small satellites join a pair already in space, where they'll track the formation and evolution of tropical cyclones, including hurricanes. https://go.nasa.gov/3MVXPwa",
    "TROPICS like it's hot! We have payload deployment!   \n\nThe science team will now seek confirmation of signal which may take several orbits. For updates on TROPICS tracking, follow \n@NASAEarth\n!",
    "Liftoff! Two small satellites are on the way to join two already in orbit for our TROPICS mission. TROPICS will provide near-hourly data that could improve forecasts of tropical cyclones and severe weather.",
    "LIVE: Watch the second pair of shoebox-sized satellites launch to orbit for our storm-tracking TROPICS mission. Liftoff on a \n@RocketLab\n Electron rocket is targeted at 11:46pm ET (0346 UTC) at the opening of the launch window.",
    "Outside the U.S.? Select NASA internship opportunities are also available for international students: https://go.nasa.gov/InternationalInterns…",
    "Want to intern with us? Applications are open to enrolled STEM and non-STEM undergrads, graduate students, and recent graduates.\n\nCheck out the opportunities available for our fall 2023 class of \n@NASAInterns\n. Apply by Saturday, May 27: https://intern.nasa.gov",
    "Our \n@NASASTEM\n educator and classroom resources make it easy to bring space to you, in classrooms or at home schools. Through partnership with the \n@usedgov\n, we provide free, high-quality STEM and space science resources for the nation’s educators: https://bit.ly/43647ig",
    "50 years ago today, Pete Conrad, Joseph Kerwin, and Paul Weitz lifted off from \n@NASAKennedy\n, heading to Skylab: America's first space station.\n\nOur Skylab missions laid the groundwork for \n@NASA_Astronauts\n to live and work in space, from the \n@Space_Station\n to the Moon and beyond.",
    "Almost all known black holes come in two sizes: small and gigantic. Data suggests intermediate-sized ones exist, but they're rare.\n \nAstronomers using \n@NASAHubble\n have found evidence of one in a star cluster about 6,000 light-years away: https://go.nasa.gov/3WBaMys",
    "The launch of two more small satellites for our \n@NASAEarth\n TROPICS mission is targeted for no earlier than Monday, May 22 at 1:30am ET (0530 UTC) on a \n@RocketLab\n rocket. They’ll join a pair in orbit to make observations of cyclones and intense weather. https://go.nasa.gov/3MdEEwb",
    "It’s handy to have one of these. Know why?",
    "Soon, we'll announce the company selected to develop the landing system for the #Artemis V Moon mission, which will take astronauts from lunar orbit to the surface and back. Tune in Friday, May 19 at 10am ET (1400 UTC): https://go.nasa.gov/42T3sk4",
    "LIVE: Leaders from NASA, \n@Axiom_Space\n, and \n@SpaceX\n are sharing updates on #Ax2's upcoming mission to the \n@Space_Station\n following today's flight readiness review. Listen in: https://youtube.com/live/uSdzc5c7xBY…",
    "REPORTERS: The #Artemis II crew is coming to Washington with media availability on May 17-18.\n\nThese four astronauts will fly around the Moon during the 10-day flight test. https://go.nasa.gov/3I8qR9a",
    "A \n@NASAWebb\n finding is making a splash!\n\nWater vapor was confirmed around a comet in the main asteroid belt for the first time, indicating that water from the primordial solar system can be preserved there. Is this a clue to the origin of Earth's water? https://go.nasa.gov/3BvAHhz",
    "Who made you the star you are today? Mention them to give them cosmic #MothersDay flowers.  \n\nThe Rosette Nebula, about 5,000 light-years from Earth, is a region in space where stars are formed. This image by the Spitzer Space Telescope shows the stellar nursery in infrared.",
    "Happy 50th, Skylab!\n\nOur first space station launched into orbit on May 14, 1973. Skylab hosted three crews of \n@NASA_Astronauts\n, proving that humans could live and work in space for extended periods of time. Learn more with \n@NASA_History\n: https://go.nasa.gov/3nVqFmz",
    "The launch of two more small satellites for our @NASAEarth TROPICS mission is targeted for no earlier than Monday, May 22 at 1:30am ET (0530 UTC) on a @RocketLab rocket. They’ll join a pair in orbit to make observations of cyclones and intense weather. https://go.nasa.gov/3MdEEwb",
    "LIVE: Leaders from NASA, @Axiom_Space, and @SpaceX are sharing updates on #Ax2's upcoming mission to the @Space_Station following today's flight readiness review. Listen in: https://youtube.com/live/uSdzc5c7xBY…",
    "A @NASAWebb finding is making a splash!\n\nWater vapor was confirmed around a comet in the main asteroid belt for the first time, indicating that water from the primordial solar system can be preserved there. Is this a clue to the origin of Earth's water? https://go.nasa.gov/3BvAHhz",
    "Happy 50th, Skylab!\n\nOur first space station launched into orbit on May 14, 1973. Skylab hosted three crews of @NASA_Astronauts, proving that humans could live and work in space for extended periods of time. Learn more with @NASA_History: https://go.nasa.gov/3nVqFmz",
    "\"I've seen just one spark of curiosity create a great burning love and fire for learning.\" #AANHPIHeritageMonth \n\nKatherine Brown helps inspire the next generation as a public affairs officer for \n@NASASTEM\n: http://go.nasa.gov/3nm6fTI",
    "Interacting galaxies, known as AM 1214-255, shine bright in this new view from Hubble!\n\nBoth galaxies contain active galactic nuclei, which are luminous central regions that host a black hole. Learn more for #BlackHoleWeek: https://go.nasa.gov/3VoUSa9",
    "LIVE: Two cosmonauts are about to start a spacewalk to help install an experiment airlock on the \n@Space_Station\n's Nauka science module. Tune in for NASA TV coverage at http://nasa.gov/live.",
    "Our #BlackHoleWeek event is on the horizon.  \n\nJoin our May 5 \n@TwitterSpaces\n to learn from experts as they talk about black holes, including the one at the center of our galaxy. #AskNASA your questions and they might be answered live.",
    "LIVE NOW: The Czech Republic is signing the #Artemis Accords, joining more than 20 nations from all over the world committed to the peaceful and safe exploration of space: http://nasa.gov/live"
]