[
    "An example of great interaction between brands  \n@McDonalds\n \n@AXE",
    "I still hear tons of friends just coming on Twitter for information. You should consider sharing your voice and contributing more to this epic platform.",
    "Dragon separation confirmed; autonomous docking with the \n@space_station\n on Tuesday, June 6 at ~5:50 a.m. ET",
    "Liftoff!",
    "Watch Falcon 9 launch Dragon to the \n@space_station\n → http://spacex.com/launches/mission/?missionId=crs-28…",
    "Starlink satellites are equipped with optical space lasers (pew pew), which allow us to provide truly global coverage and serve customers in the most remote locations on Earth http://starlink.com/technology",
    "Also, you can now change video playback speed",
    "→ → ",
    "Scrolling through tweets while watching mini video (pic in pic) is great",
    " For those who died for freedom ",
    "Dragon and the Ax-2 astronauts are set to depart the \n@space_station\n tomorrow at 11:05 a.m. ET → http://spacex.com/launches/mission/?missionId=ax-2…",
    "A escala em que a Starlink está conectando aqueles que antes não estavam conectados ou tinham acesso não confiável à Internet continua a crescer a cada dia\n\nDe escolas em áreas remotas a comunidades em toda a Amazônia, a Starlink está conectando mais de 50 mil clientes no Brasil!… Show more",
    "What will AI be like in 2040?",
    "Incompetence, in the limit, is indistinguishable from sabotage",
    "Transparency builds trust …",
    "Yikes",
    "Twitter is the town square of the people",
    "BREAKING: \n@FoxNews\n confirms Florida Governor \n@RonDeSantis\n will announce his 2024 Presidential run tomorrow night, 6pm ET in a Twitter Spaces interview with \n@elonmusk\n.",
    "And works almost everywhere on Earth with global roaming enabled!",
    "Both quality & quantity of high quality posts of all kinds (short text, long essays, pictures, audio & video) have improved dramatically. \n\nThank you for contributing your voice to humanity’s digital public square!",
    "Starlink for RVs can be used anywhere Starlink provides service and is ideal for camping and other activities in rural or remote locations where internet access has been unreliable or completely unavailable → http://starlink.com/rv",
    "fwiw you can post thirst pics on twitter too",
    "All those moments, \nwill be lost in time\nlike tears in rain …",
    "Welcome aboard the station #Ax2! The four \n@Axiom_Space\n private astronauts entered the orbital outpost after opening the \n@SpaceX\n Dragon crew ship hatch at 11am ET today.",
    "Dragon performed a series of burns on its way to the \n@space_station",
    "Let's go!",
    "¡Starlink ya está disponible en Panamá!",
    "To heir is human, \nTo procreate divine",
    "Love to see Starlink providing great connectivity to those who had little or nothing before. \n\nAs soon as you can access the Internet, you can learn almost anything, so it’s absolutely essential for education.\n\n\n@khanacademy\n being a great example.",
    "Once you’ve tasted the full phone to car and technological experience of a Tesla you can’t go back to any other cars. There’s nothing like it on the market by a mile.\n\nIt’s all the small things that quickly adds up to make you never want to drive anything else, ever."
]