[
    "Live from \n@LibraryCongress\n: U.S. Poet Laureate Ada Limón reveals her Poem for Europa, an original work that will fly aboard the \n@EuropaClipper\n spacecraft to Jupiter's icy moon.",
    "LIVE: Join NASA and \n@BoeingSpace\n officials as we share an update on the first #Starliner Crew Flight Test. Tune in.",
    " \n@NASA\n and \n@BoeingSpace\n will host a media teleconference at 5pm ET today for an update on Boeing's first crewed flight on the CST-100 Starliner to the \n@Space_Station\n.\n\nListen in: http://nasa.gov/live",
    "Due to strong upper-level winds, launch of two small satellites for our cyclone-tracking TROPICS mission on a \n@RocketLab\n Electron rocket is now targeted for no earlier than Thurs., May 25 at 11:30pm ET (0330 UTC). https://go.nasa.gov/3MUXZ6Y",
    "We and \n@RocketLab\n are targeting 12am ET Thursday, May 25 (0400 UTC), for the second launch of our cyclone-studying TROPICS mission.\n\nTune in here and at https://go.nasa.gov/424tYpt at 11:40pm ET (0340 May 25 UTC) for live launch coverage from New Zealand: https://go.nasa.gov/42071E4",
    "Simply the best. Music legend Tina Turner sparkled across the stage and into millions of hearts as the Queen of Rock 'n' Roll. Her legacy will forever live among the stars.",
    "Happy 50th, Skylab!\n\nOur first space station launched into orbit on May 14, 1973. Skylab hosted three crews of \n@NASA_Astronauts\n, proving that humans could live and work in space for extended periods of time. Learn more with \n@NASA_History\n: https://go.nasa.gov/3nVqFmz",
    "This week was busy.\n\n\n@Space_Station\n crew members relocated their \n@SpaceX\n Dragon to a new docking port, \n@NASAWebb\n imaged a nearby star, and \n@RocketLab\n launched two small satellites to study hurricanes.\n\nSubscribe to our newsletter and get the full scoop: http://nasa.gov/subscribe",
    "For the first time, two \n@NASA\n super pressure balloons are in flight at the same time!\n\nThe two balloons launched from New Zealand with a primary goal of testing & qualifying the super pressure balloon tech for flight, while also flying science missions. https://go.nasa.gov/3pzfNvk",
    "We're holding a public meeting of our independent study team on unidentified anomalous phenomena (UAP) on Wednesday, May 31, at 10:30am ET (1430 UTC), with a media teleconference to follow. \n\nHow to watch: https://go.nasa.gov/42tSGAX\n\nSubmit your questions: https://go.nasa.gov/42uzK4J",
    "Over their eight days on the \n@Space_Station\n, the private astronauts of \n@Axiom_Space\n's Axiom Mission 2 will run activities from student outreach to scientific experiments.\n\n#Ax2 is set to lift off from \n@NASAKennedy\n on Sunday, May 21—here's how to watch: https://go.nasa.gov/41yAdlp",
    "14 years ago, \n@Astro_Mike\n wrote the first tweet from space. Since then, we’ve been sharing snippets of our life in orbit—and what it’s like to gaze upon our home planet.\n\nFollow along: http://nasa.gov/astronauts/biographies/active…",
    "LIVE: Cosmonauts are about to embark on a spacewalk to deploy and activate a radiator that will help cool the \n@Space_Station\n’s Nauka science module: http://nasa.gov/live",
    "New images from \n@NASAPersevere\n may show evidence of what was once a wild and deep river on Mars. The observations are leading scientists to rethink how ancient water once flowed on the Red Planet. https://go.nasa.gov/41tYxEP",
    "This \n@NASAWebb\n image of the Pillars of Creation helps astronomers determine how stars form. Plus, it makes pretty sweet digital wallpaper.\n\nDownload high-resolution images from https://webbtelescope.org.",
    "Looking for the latest news from low Earth orbit?\n\nFollow \n@NASASpaceOps\n for mission leadership updates as we live and work beyond our home planet.",
    "Throughout May, we’ll celebrate #AANHPIHeritageMonth by honoring some of the brilliant people who shape NASA and inspire generations: https://go.nasa.gov/3aVaglx",
    "Tale as old as time. \n\nUnusual asteroid Phaethon behaves like a comet. It brightens and forms a tail as it nears the Sun and is the source of a meteor shower, something usually led by comets. But this asteroid's tail tells a different story:\nhttps://go.nasa.gov/3LHmtQs",
    "Is your type tall (maybe even \"supermassive\"), dark, and mysterious? Celebrate #BlackHoleWeek with us! \n\nLearn about these cosmic objects, share science updates, visualizations, and sonifications. Follow \n@NASAUniverse\n and get pulled in: https://go.nasa.gov/3ncukw9",
    "This week at NASA, astronauts prepped the \n@Space_Station\n for more solar arrays, \n@NASAHubble\n celebrated its 33rd anniversary with a new image of a dark nebula, and \n@VP\n and \n@President_KR\n visited \n@NASAGoddard\n.",
    "TROPICS Launch Update! ",
    "Astronauts Steve Bowen and \n@Astro_Alneyadi\n concluded today’s seven-hour spacewalk at 4:12 p.m. ET (20:12 UTC). It was the eighth for Bowen and the first for any UAE astronaut: https://go.nasa.gov/3ADIeuf",
    " Live: TROPICS experts discuss the mission, which aims to improve understanding of tropical cyclones through regular measurements of precipitation, temperature & humidity.\n \nUse #AskNASA and your questions may get answered on air.",
    "Two cosmonauts are about to venture outside the \n@Space_Station\n for a six-and-a-half-hour spacewalk. Live coverage begins at 9pm ET (0100 UTC April 19) on https://go.nasa.gov/3Lc1mFI.",
    "To help defend Earth from potentially hazardous asteroids and comets, we developed the #PlanetaryDefense Strategy & Action Plan. We’re eager to work with \n@WHOSTP\n in implementing it. https://go.nasa.gov/3mI3MlZ\n\nNote: There are no known asteroid impact threats for 100+ years.",
    "NASA astronaut Steve Bowen and UAE astronaut \n@Astro_Alneyadi\n will step outside the \n@Space_Station\n on Friday, April 28, to prepare for new solar arrays that will boost the station's power capacity.\n\nTune in Monday, April 24, for a live spacewalk preview: https://go.nasa.gov/3KJ8isB",
    " Launch alert: A new space-based instrument will monitor air quality across North America, providing hourly measurements to improve forecasts & inform policymakers.\n\n#TEMPO is set to lift off no earlier than 12:30am ET (0430 UTC), Friday, April 7. Watch: https://go.nasa.gov/3Gsbt6v",
    "Uranus. (Go ahead, get it out of your system. We tried.)⁣\n\nOnly Voyager 2 in the 1980s & Keck (with adaptive optics) have imaged the planet's rings before, and they've never been this clear. \n@NASAWebb\n highlights atmospheric features & 11 of its 13 rings: https://go.nasa.gov/414SqXV",
    "LIVE: NASA and \n@Axiom_Space\n leaders are providing the latest updates on #Ax2, scheduled to send an international crew of private astronauts to the \n@Space_Station\n in early May. Listen in:",
    "The Soyuz MS-23 crew ship with three Exp 69 crewmates aboard docked to the Prichal docking module at 5:22am ET today completing a 37-minute relocation maneuver. More... https://go.nasa.gov/3nPnhcF"
]