[
    "Interview with \n@BillMaher",
    "Explaining Constitutional Amendments",
    "If AGI is almost here, why doesn’t autocorrekt work!?",
    "Raptor V3 just achieved 350 bar chamber pressure (269 tons of thrust). Congrats to \n@SpaceX\n propulsion team!\n\nStarship Super Heavy Booster has 33 Raptors, so total thrust of 8877 tons or 19.5 million pounds.",
    "When you have Starlink on your ship, not only can you stay connected while on the vast majority of the Earth’s oceans and seas, but apparently it’s also easier to find sunken treasure → http://yachtworld.com/research/yacht-wifi-revolutionizes-sunken-treasure-discovery/…",
    "As soon as \n@LindaYacc\n is ready, we will do a Spaces where you can ask us anything",
    "With latest version of app, you can DM reply to any message in the thread (not just most recent) and use any emoji reaction. \n\nRelease of encrypted DMs V1.0 should happen tomorrow. This will grow in sophistication rapidly. The acid test is that I could not see your DMs even if… Show more",
    "On this platform, unlike the one-way street of broadcast, people are able to interact, critique and refute whatever is said. \n\nAnd, of course, anything misleading will get \n@CommunityNotes\n. \n\nI also want to be clear that we have not signed a deal of any kind whatsoever. Tucker is… Show more",
    "Yup",
    "First passenger rail service in the world to adopt Starlink! ",
    "Trust nothing, not even nothing",
    "[correction: \n@wsj\n trailed by several years]",
    "Remarkable how \n@nytimes\n, \n@latimes\n & \n@washingtonpost\n moved in lockstep, with \n@WSJ\n trailing by ~6 months",
    "Massive public manipulation",
    "WhatsApp cannot be trusted",
    "NASA Spaces about space!",
    "Model S Plaid track pack coming soon",
    "Falcon Heavy long exposure looks like 3 laser beams from space",
    "¡Notas de la Comunidad sigue creciendo! Bienvenidos a los contribuyentes de Argentina, Chile, Colombia, Ecuador, Guatemala, Perú y Venezuela\n\n",
    "May the 4th be with you ",
    "Falcon 9’s first stage has landed on the A Shortfall of Gravitas droneship",
    "Watch Falcon 9 launch 56 Starlink satellites to orbit → http://spacex.com/launches/",
    "Vegas Loop is expanding - 65 miles and 69 stations!  Thanks to \n@ClarkCountyNV\n for the great partnership.",
    "Falcon Heavy is green for launch",
    "About to do Falcon Heavy risk review. I love that rocket, but it’s scary. So many state changes post liftoff.",
    "On \n@billmaher\n show tonight",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "Every vehicle we sell, battery we install & solar panel we add moves the needle in the direction of a sustainable future.\n\nThank you to the Tesla team, customers & supporters for bringing us closer to our goal!\n\nHappy Earth Day ",
    "Starship liftoff in slow motion",
    "Creators can now sign up and earn a living directly on Twitter in the EU, UK, and EEA.\n\nTap on “Monetization” in settings to apply today.\n\nFor a full list of available countries see our Help Center:"
]