[
    "Peer pressure.\n\n\n@NASAHubble\n spots a galaxy about 50 million light-years away that holds some surprises: Two nearby galaxies are influencing it and it may or may not have a supermassive black hole at its center. http://go.nasa.gov/45It84O",
    "Over 7,000 pounds of new experiments, new solar arrays, and other cargo has arrived at the station after the \n@SpaceX\n Dragon cargo craft docked to the Harmony module at 5:54am ET today.",
    "#MissionToPsyche is on track for launch in October 2023!\n\nAn independent review board found JPL’s response to address factors contributing to the mission’s 2022 launch delay has been \"world class.\"",
    "After just over a week in space, \n@Axiom_Space\n's #Ax2 astronauts are set to return to Earth on Tuesday, May 30. Here’s how to watch live coverage, from closing of the hatches to splashdown: https://go.nasa.gov/43vWzp6",
    "Two \n@NASA_Astronauts\n will do a pair of spacewalks on June 9 and June 15 to install new solar arrays on the \n@Space_Station\n. We’ll stream them live.\n \nJoin us for a preview on June 1: https://go.nasa.gov/3MGCCFj",
    "We completed a joint checkpoint review with \n@BoeingSpace\n ahead of the first #Starliner flight to carry astronauts, set for no earlier than July 21. Teams will provide updates leading up to the inaugural Crew Flight Test to and from the \n@Space_Station\n: https://go.nasa.gov/3MZR1xG",
    "LIVE: We're announcing the Phase 2 winners for our \n@NASAPrize\n Deep Space Food Challenge, a global competition to develop sustainable ways of producing healthy food for long-term missions to the Moon, Mars, and beyond.\n\nWatch with us at #NYCxDESIGN:",
    "We selected \n@BlueOrigin\n to develop the human landing system for the #Artemis V mission. This component for deep space transportation will help us in our goal of sending astronauts to the surface of the Moon and returning them home safely: https://go.nasa.gov/3Mn3QQU",
    "LIVE NOW: We are announcing which company will develop the human landing system for the #Artemis V mission to the Moon. This system will help us establish recurring, long-term access to the lunar surface: http://nasa.gov/live",
    "Insights on InSight: Chat LIVE with experts from the mission that detected more than 1,000 marsquakes.",
    "Are you there, Moon? It’s me, #CAPSTONE \n\nOur microwave-oven sized #CubeSat has taken its first images! And tested a new navigation tech with our Lunar Reconnaissance Orbiter. Learn how it lays the groundwork for future peer-to-peer navigation at the Moon: https://go.nasa.gov/3o8O4Bk",
    "Ever feel like you're being pulled in different directions and you might erupt?\n\nAn Earth-size exoplanet, spotted by NASA's orbiting telescopes, is at the center of a cosmic tug-of-war in its star system—which may stud its surface with fiery volcanoes: https://go.nasa.gov/3MzUxhS",
    "We can’t imagine a more beautiful thing than May’s full moon – the Corn Moon. \n\nSet to peak on May 5 at 1:34pm ET (1634 UTC ), this full moon, also known as the Flower Moon, will appear full till Sunday. Discover how it got its names: http://go.nasa.gov/3piIAUs",
    "Four of Uranus’ largest moons—Ariel, Umbriel, Titania, and Oberon—may have oceans beneath their icy crusts, according to a re-analysis of Voyager 2 data. https://go.nasa.gov/3VQtF0l",
    "It’s a TRAP(PIST)-1! \n\nAbout 40 light-years away lies a planetary system with the most Earth-sized exoplanets found in a star's habitable zone. Learn more about the TRAPPIST-1 system that was recently studied by \n@NASAWebb\n: http://go.nasa.gov/415DmsC\n\n#MayTheFourth",
    "@WomenNASA\n Liz Landau, host and science communicator\n\n\n@ChandraXray\n Daryl Haggard, astrophysicist\n\n\n@NASAJPL\n Michele Vallisneri, theoretical physicist\n\n\n@NASAUniverse\n Regina Caputo, astrophysicist",
    "When we say “supermassive black holes,” just how do they measure up? \n\nUsing their shadows for size, we’ve rounded up 10 black holes and compared them to objects in our solar system. Don’t worry – these black holes are many light-years away: https://go.nasa.gov/3HIcDeW #BlackHoleWeek",
    "The eta Aquariid meteor shower is expected to reach its peak tonight (May 4-5)—and even with the full Moon, it could still be a great night for skywatching!\n\nHere's how, where and when to track the eta Aquariids: https://go.nasa.gov/42iqGQk",
    "Bring balance to the force, not leave it in darkness.\n\nHappy #StarWarsDay. And #MayThe4thBeWithYou.",
    "Reflecting on the past two years, I am humbled by the dedication of the \n@NASA\n team and their commitment to advancing science and exploration. We have so much to look forward to. Together, we will continue to push the limits of exploration and achieve the impossible.",
    "Share if you love Earth.  #EarthDay",
    "Happy #EarthDay \n\nFrom the tallest peaks to ocean depths, from arid deserts to lush forests, we observe our home from a unique perspective. Learn about the activities all around NASA, and about the picture that kicked off this celebration of our planet: https://go.nasa.gov/41yzVvI",
    "Happy Earth Day from me and our good friends over at NASA.\n \nFor our children and grandchildren, we must stand united in our effort to save our only home.",
    "This week at NASA, we marked the Ingenuity #MarsHelicopter's 50th flight on the Red Planet, the planet-hunting satellite TESS entered its fifth year, and we celebrated our favorite planet—Earth!\n\nCelebrate #EarthDay with us: https://go.nasa.gov/40AeM2G",
    "What was it like when Apollo 8 astronaut Bill Anders saw Earth rise over the Moon’s horizon in 1968?\n\nHe reflects with Dr. Kate Calvin, NASA senior climate advisor and chief scientist, on taking the famous photo helped humanity \"discover\" Earth. https://go.nasa.gov/43QKQCr\n\n#EarthDay",
    "Watch as \n@NorthropGrumman\n’s S.S. Sally Ride undocks from the \n@Space_Station\n 250 miles over the Mediterranean.",
    "Live Now: Watch as the uncrewed \n@NorthropGrumman\n S.S. Sally Ride Cygnus cargo spacecraft departs from the \n@Space_Station\n.\n\nThe spacecraft delivered snacks, science, and supplies to the orbiting laboratory in November 2022:\nhttp://go.nasa.gov/3MWtqhI",
    "HOP IN SPACEFOLKS! \n\nWe're blasting off together on a new mission—\n@TheWebbyAwards\n. Together we've: launched #Artemis I, watched DART smash into an asteroid, and explored with \n@NASAWebb\n. Now we're hoping to land #Webbys. You in? Vote by the end of today: https://bit.ly/3zHiqgs",
    "Tail installed \n\nSoon, \n@NASAAero\n’s X-59 will take to the skies to demonstrate a new quiet form of supersonic flight. This technology could bring a return to supersonic flight over land—cutting flight times in half. More on the Quesst mission: https://nasa.gov/specials/Quesst/…",
    "What's new on the Web(b)?\n\nWe always have the latest hi-res images from \n@NASAWebb\n available to view (and download) at http://webbtelescope.org. Stop by and make sure you haven't missed any!"
]