[
    "Hold on to your horse as the carousel of destiny spins ever faster",
    "Bruh do you even AI",
    "Is this true, \n@Target\n?",
    "Ending the digital divide requires making devices more accessible. \n\nStarlink kits are designed to include everything needed to connect. And they travel well too ",
    "One hell of a plasma beam!",
    "Second-gen satellites represent a step forward in Starlink capability with key technologies to provide ~4x more capacity per satellite than earlier iterations.\n\nThis means Starlink can provide more bandwidth with increased reliability and connect millions of more people around… Show more",
    "Watch Falcon 9 launch the Iridium OneWeb mission to orbit → http://spacex.com/launches",
    "Watch Falcon 9 launch 22 \n@Starlink\n satellites to orbit → http://spacex.com/launches",
    "Liftoff!",
    "I have spaceships",
    "AI ",
    "Watch Falcon 9 launch 22 @Starlink satellites to orbit → http://spacex.com/launches",
    "With latest version of app, you can DM reply to any message in the thread (not just most recent) and use any emoji reaction. \n\nRelease of encrypted DMs V1.0 should happen tomorrow. This will grow in sophistication rapidly. The acid test is that I could not see your DMs even if… Show more",
    "On this platform, unlike the one-way street of broadcast, people are able to interact, critique and refute whatever is said. \n\nAnd, of course, anything misleading will get \n@CommunityNotes\n. \n\nI also want to be clear that we have not signed a deal of any kind whatsoever. Tucker is… Show more",
    "Starlink is self-orienting and connects in minutes as long as it has a clear view of the sky. Open the Starlink App to check for any obstructions ",
    "When you walk on to a plane with Starlink, the internet just works – it's that simple",
    "NASA Spaces about space!",
    "Model S Plaid track pack coming soon",
    "Falcon Heavy long exposure looks like 3 laser beams from space",
    "¡Notas de la Comunidad sigue creciendo! Bienvenidos a los contribuyentes de Argentina, Chile, Colombia, Ecuador, Guatemala, Perú y Venezuela\n\n",
    "May the 4th be with you ",
    "Falcon 9’s first stage has landed on the A Shortfall of Gravitas droneship",
    "Watch Falcon 9 launch 56 Starlink satellites to orbit → http://spacex.com/launches/",
    "Imagine the countless lives we could save if more people drove Teslas. With safety as a top priority, Tesla is leading the charge towards a safer future on our roads.",
    "Not all active safety systems are created equal. Even within the 5-star category, there can be considerable differences in the effectiveness of assistance systems like AEB.",
    "All proceeds go to content creators, we keep nothing",
    "Major software upgrades underway across the board. \n\nEncrypted DMs & other DM upgrades rolling out this week.",
    "Support content creators around the world in near & far away places!\n\nFor many this represents a vital source of income & enables them to put more time into creating great content for you.",
    "I propose the lmfao test for AI",
    "Falcon Heavy is green for launch"
]