[
    "Interview with \n@BillMaher",
    "150+ cruise ships and counting around the world are set to use Starlink, helping to make their passengers travel experience even more enjoyable ",
    "With Starlink, users can engage in online gaming which historically wasn’t possible with satellite internet. \n\nBack in December, the Starlink team supported the \n@FortniteGame\n Chapter 4 release with \n@FindYourBattle\n—enabling ~100 hours of gameplay and ~50 hours of streaming for… Show more",
    "¡Starlink ya está disponible en Panamá!",
    "Wow",
    "The most entertaining outcome is the most likely",
    "economic enema en route",
    "Tesla Lithium Groundbreaking Ceremony",
    "Livestream starting soon",
    "Assume you’re always being manipulated",
    "Sunset in space",
    "They are the same picture",
    "Cult / Culture",
    "[right wing meme]",
    "@ylecun",
    "Liftoff!",
    "Anyone making materially false statements on this platform will get Community Noted, including you, me, Tucker, advertisers, head of state, etc. No exceptions. \n\nConvince the people and let the chips fall where they may. \n\n\n@CommunityNotes",
    "The data with which the Federal Reserve is making decisions has too much latency",
    "Met with \n@SenSchumer\n and many members of Congress about artificial intelligence regulation today.\n\nThat which affects safety of the public has, over time, become regulated to ensure that companies do not cut corners. \n\nAI has great power to do good and evil. Better the former.",
    "Transparency is fundamental to everything we do at Twitter. As we review our approach to transparency reporting for the future, today we’re publishing our 21st report, with data on our policy enforcement for the first half of 2022. Read more here:",
    "Verified accounts are now prioritized",
    "Sometimes, when you learn about something, you think you have it",
    "The collective mind that is this platform needs more signal & less noise",
    "Congrats \n@SpaceX\n team on an exciting test launch of Starship!\n\nLearned a lot for next test launch in a few months.",
    "Liftoff of Starship!",
    "T-0 in 4 mins",
    "10 minutes to launch",
    "Starship on track to launch in ~37 mins",
    "The Starship team is go for prop load; team is keeping an eye on the weather → http://spacex.com/launches",
    "Starship at sunset"
]