[
    ".",
    "On now",
    "An example of great interaction between brands  \n@McDonalds\n \n@AXE",
    "I still hear tons of friends just coming on Twitter for information. You should consider sharing your voice and contributing more to this epic platform.",
    "Dragon separation confirmed; autonomous docking with the \n@space_station\n on Tuesday, June 6 at ~5:50 a.m. ET",
    "→ → ",
    "Scrolling through tweets while watching mini video (pic in pic) is great",
    " For those who died for freedom ",
    "Spaces with \n@RonDeSantis\n in ~2 hours!",
    "Twitter is the town square of the people",
    "BREAKING: \n@FoxNews\n confirms Florida Governor \n@RonDeSantis\n will announce his 2024 Presidential run tomorrow night, 6pm ET in a Twitter Spaces interview with \n@elonmusk\n.",
    "And works almost everywhere on Earth with global roaming enabled!",
    "Twitter Blue Verified subscribers can now upload 2 hour videos (8GB)!",
    "Ship 25 moved to a suborbital pad at Starbase for an upcoming static fire of its six Raptor engines",
    "Why is sleep so hard!? Perhaps we will never know.",
    "150+ cruise ships and counting around the world are set to use Starlink, helping to make their passengers travel experience even more enjoyable ",
    "With Starlink, users can engage in online gaming which historically wasn’t possible with satellite internet. \n\nBack in December, the Starlink team supported the \n@FortniteGame\n Chapter 4 release with \n@FindYourBattle\n—enabling ~100 hours of gameplay and ~50 hours of streaming for… Show more",
    "¡Starlink ya está disponible en Panamá!",
    "To heir is human, \nTo procreate divine",
    "Love to see Starlink providing great connectivity to those who had little or nothing before. \n\nAs soon as you can access the Internet, you can learn almost anything, so it’s absolutely essential for education.\n\n\n@khanacademy\n being a great example.",
    "Once you’ve tasted the full phone to car and technological experience of a Tesla you can’t go back to any other cars. There’s nothing like it on the market by a mile.\n\nIt’s all the small things that quickly adds up to make you never want to drive anything else, ever.",
    "I am excited to welcome Linda Yaccarino as the new CEO of Twitter!\n\n\n@LindaYacc\n will focus primarily on business operations, while I focus on product design & new technology.\n\nLooking forward to working with Linda to transform this platform into X, the everything app.",
    "As seen by an unaffected third party",
    "Wow",
    "The most entertaining outcome is the most likely",
    "economic enema en route",
    "Powerwall now available in Spain →",
    "Say goodbye to prying eyes and hello to secure conversations. We're giving early access to Encrypted Direct Messages v1 to our verified users.\n\nWe're excited to get feedback, improve the experience, and roll it out to even more users. Learn more:",
    "Excited to announce that I’ve hired a new CEO for X/Twitter. She will be starting in ~6 weeks!\n\nMy role will transition to being exec chair & CTO, overseeing product, software & sysops.",
    "With each launch of our first gen \n@Starlink\n satellites, we add over a Tbps of capacity to the constellation; allowing us to continue improving coverage and connecting more people around the world with high-speed internet from space"
]