[
    "Interview with \n@BillMaher",
    "Explaining Constitutional Amendments",
    "If AGI is almost here, why doesn’t autocorrekt work!?",
    "Raptor V3 just achieved 350 bar chamber pressure (269 tons of thrust). Congrats to \n@SpaceX\n propulsion team!\n\nStarship Super Heavy Booster has 33 Raptors, so total thrust of 8877 tons or 19.5 million pounds.",
    "When you have Starlink on your ship, not only can you stay connected while on the vast majority of the Earth’s oceans and seas, but apparently it’s also easier to find sunken treasure → http://yachtworld.com/research/yacht-wifi-revolutionizes-sunken-treasure-discovery/…",
    "As soon as \n@LindaYacc\n is ready, we will do a Spaces where you can ask us anything",
    "Yup",
    "First passenger rail service in the world to adopt Starlink! ",
    "Trust nothing, not even nothing",
    "¡Notas de la Comunidad sigue creciendo! Bienvenidos a los contribuyentes de Argentina, Chile, Colombia, Ecuador, Guatemala, Perú y Venezuela\n\n",
    "May the 4th be with you ",
    "Falcon 9’s first stage has landed on the A Shortfall of Gravitas droneship",
    "Falcon Heavy is green for launch",
    "About to do Falcon Heavy risk review. I love that rocket, but it’s scary. So many state changes post liftoff.",
    "On \n@billmaher\n show tonight",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "More Community Notes! Today’s new algorithm update boosts the number of Helpful notes by 10%+. It builds on last week’s change that uses confidence scores to identify notes that are broadly found helpful with high precision. https://communitynotes.twitter.com/guide/en/under-the-hood/ranking-notes#modeling-uncertainty…",
    "Great song",
    "Such a great day in so many ways",
    "Every vehicle we sell, battery we install & solar panel we add moves the needle in the direction of a sustainable future.\n\nThank you to the Tesla team, customers & supporters for bringing us closer to our goal!\n\nHappy Earth Day ",
    "Starship liftoff in slow motion",
    "Creators can now sign up and earn a living directly on Twitter in the EU, UK, and EEA.\n\nTap on “Monetization” in settings to apply today.\n\nFor a full list of available countries see our Help Center:",
    "Starship Liftoff",
    "Starship Supersonic",
    "In a short time, \n@NASAWebb\n has revealed new info about the composition & atmospheres of \n@NASAExoplanets\n, while continuing to perfect techniques that we'll need to identify habitable worlds outside our own. Peruse some unexpected findings discovered so far: https://go.nasa.gov/3Ai2cdI",
    "First fully integrated Starship lifting off for the first time!",
    "Liftoff from Starbase",
    "T-12 hours until the first flight test of a fully integrated Starship and Super Heavy rocket; targeting ~8:00 a.m. CT for liftoff → http://spacex.com/launches",
    "Starship's flight test window opens at 7:00 a.m. CT tomorrow; a live webcast will begin ~45 minutes before liftoff → http://spacex.com/launches/mission/?missionId=starship-flight-test…",
    "Launch attempt tomorrow"
]