[
    "2,000 sites now live in North America, delivering up to 500 million miles per month ",
    "Congrats Tesla Plaid racing team!",
    "Sorry this app takes up so much space",
    "End Poem of minecraft is literally the best thing I've ever read?? So worth reading the whole thing: https://en.m.wikisource.org/wiki/End_Poem",
    "AI Fashion Show in Azkaban\nDate & Details to Follow",
    "Office Space is an awesome movie",
    "Celebrated with 10k+ employees & their families at Giga Berlin Family Day ",
    "Previously, I had thought it was some pescatarian conspiracy theory, but nope",
    "I was today’s years old when I learned that some people genuinely love cooked salmon",
    "Regenerative braking enables you to bring your Tesla to a complete stop without using the brake pedal, maximizing efficiency & reducing wear & tear\n\nAlso, traction & stability controls are active during regen, giving you more control during deceleration",
    "Deployment of \n@Arabsat\n BADR-8 confirmed",
    "Falcon 9’s first stage has landed the Just Read the Instructions droneship",
    "Falcon 9’s first stage booster has landed on Landing Zone 1, a first for a human spaceflight mission",
    "Watch Falcon 9 launch Dragon and Ax-2 to the \n@space_station\n → http://spacex.com/launches/mission/?missionId=ax-2…",
    "Sharing another update on the changes we’ve made to our open source repos this week and a preview of what’s next ",
    "Great statement by \n@votetimscott\n!",
    "Ending the digital divide requires making devices more accessible. \n\nStarlink kits are designed to include everything needed to connect. And they travel well too ",
    "One hell of a plasma beam!",
    "Second-gen satellites represent a step forward in Starlink capability with key technologies to provide ~4x more capacity per satellite than earlier iterations.\n\nThis means Starlink can provide more bandwidth with increased reliability and connect millions of more people around… Show more",
    "Watch Falcon 9 launch the Iridium OneWeb mission to orbit → http://spacex.com/launches",
    "Watch Falcon 9 launch Dragon and Ax-2 to the @space_station → http://spacex.com/launches/mission/?missionId=ax-2…",
    "Great statement by @votetimscott!",
    "Contributors’ time is valuable, and best spent reviewing high quality notes. Today we’re making the number of notes one can write in 24h proportional to their track record. The more helpful notes you’ve written, the more you can write. If you hit your limit, you’ll see this:",
    "S3XY vehicles  hot engineers \n\nOur field quality engineers head to Dubai at the hottest time of the year for extreme heat & durability testing—temperatures reach over 50°C",
    "Also, which kind of bat – fruit eating bat or insect eating bat ?",
    "Vote at the 2023 Tesla Shareholder Meeting →",
    "The spice must flow",
    "\"Twitter has proven itself to be among the best, if not the best, platform for return on ad spend and conversion campaigns right now.\" - \n@SeanEcom\n CEO, The Ridge Wallet \n\nStand out in a crowded DTC market ",
    "Congratulations Tesla Texas Team!!",
    "Starlink is self-orienting and connects in minutes as long as it has a clear view of the sky. Open the Starlink App to check for any obstructions "
]