[
    "Ad astra per aspera \n\nJoin us this #MemorialDay in remembering and honoring all those who made the ultimate sacrifice in service to our country.",
    "After just over a week in space, \n@Axiom_Space\n's #Ax2 astronauts are set to return to Earth on Tuesday, May 30. Here’s how to watch live coverage, from closing of the hatches to splashdown: https://go.nasa.gov/43vWzp6",
    "NOW: Get the latest status update on the all-private #Ax2 mission, set to lift off on Sunday, May 21 at 5:37pm ET (2137 UTC) from \n@NASAKennedy\n. https://youtube.com/watch?v=63TWnnZhePo…",
    "LAUNCH UPDATE \nDue to weather, \n@RocketLab\n and \n@NASA\n are now targeting 1 am EDT Tues, 23 May (5 pm NZST) for the final TROPICS launch. Two #CubeSats are set to join a constellation to improve forecasting of typhoons and hurricanes. For updates https://blogs.nasa.gov/smallsatellites/…",
    "The \n@NASAArtemis\n II astronauts visit Washington, \n@BlueOrigin\n is selected to develop the landing system that will take astronauts to and from the surface of the Moon on #Artemis V, and \n@NASARoman\n takes shape.\n\nSubscribe for all this and more: http://nasa.gov/subscribe",
    "LIVE: We're announcing the Phase 2 winners for our \n@NASAPrize\n Deep Space Food Challenge, a global competition to develop sustainable ways of producing healthy food for long-term missions to the Moon, Mars, and beyond.\n\nWatch with us at #NYCxDESIGN:",
    "We selected \n@BlueOrigin\n to develop the human landing system for the #Artemis V mission. This component for deep space transportation will help us in our goal of sending astronauts to the surface of the Moon and returning them home safely: https://go.nasa.gov/3Mn3QQU",
    "LIVE NOW: We are announcing which company will develop the human landing system for the #Artemis V mission to the Moon. This system will help us establish recurring, long-term access to the lunar surface: http://nasa.gov/live",
    "Insights on InSight: Chat LIVE with experts from the mission that detected more than 1,000 marsquakes.",
    "Are you there, Moon? It’s me, #CAPSTONE \n\nOur microwave-oven sized #CubeSat has taken its first images! And tested a new navigation tech with our Lunar Reconnaissance Orbiter. Learn how it lays the groundwork for future peer-to-peer navigation at the Moon: https://go.nasa.gov/3o8O4Bk",
    "NOW: Get the latest status update on the all-private #Ax2 mission, set to lift off on Sunday, May 21 at 5:37pm ET (2137 UTC) from @NASAKennedy. https://youtube.com/watch?v=63TWnnZhePo…",
    "LAUNCH UPDATE \nDue to weather, @RocketLab and @NASA are now targeting 1 am EDT Tues, 23 May (5 pm NZST) for the final TROPICS launch. Two #CubeSats are set to join a constellation to improve forecasting of typhoons and hurricanes. For updates https://blogs.nasa.gov/smallsatellites/…",
    "The @NASAArtemis II astronauts visit Washington, @BlueOrigin is selected to develop the landing system that will take astronauts to and from the surface of the Moon on #Artemis V, and @NASARoman takes shape.\n\nSubscribe for all this and more: http://nasa.gov/subscribe",
    "LIVE: We're announcing the Phase 2 winners for our @NASAPrize Deep Space Food Challenge, a global competition to develop sustainable ways of producing healthy food for long-term missions to the Moon, Mars, and beyond.\n\nWatch with us at #NYCxDESIGN:",
    "We selected @BlueOrigin to develop the human landing system for the #Artemis V mission. This component for deep space transportation will help us in our goal of sending astronauts to the surface of the Moon and returning them home safely: https://go.nasa.gov/3Mn3QQU",
    "What's your favorite \n@NASAHubble\n image? http://bit.ly/3NauIG3\n\nLaunched 33 years ago today, the orbiting telescope captured this image of a nebula where stars are born -- 960 light-years away. http://go.nasa.gov/3VizSlr",
    "On April 25, \n@VP\n Kamala Harris & \n@President_KR\n Yoon Suk Yeol will tour \n@NASAGoddard\n and meet with scientists to see firsthand climate change research underway. They will also take an early look at \n@NASARoman\n, our next space telescope. https://go.nasa.gov/3Nbslmm",
    "LIVE: Preview the next spacewalk set for Friday, April 28. Veteran astronaut Steve Bowen and first-time spacewalker \n@Astro_Alneyadi\n will prepare the \n@Space_Station\n for solar power upgrades.",
    "NOW: \n@NASAEarth\n and \n@CenterForAstro\n scientists are answering questions on Reddit about TEMPO, a new space-based instrument that will revolutionize our understanding of air quality.\n \nWant to learn more? Ask your own Qs on our AMA.",
    "Earth is our home. \n\nOn #EarthDay and every day, we’re learning more about our world and how it’s changing – giving us a deeper appreciation for the planet we call home.\n\nCelebrate with us: https://go.nasa.gov/3mZmeXx",
    "Wow! Look at all this love for Earth!  While you’re here, check out how we study Earth every day at \n@nasa\n.",
    "This week at NASA, we marked the Ingenuity #MarsHelicopter's 50th flight on the Red Planet, the planet-hunting satellite TESS entered its fifth year, and we celebrated our favorite planet—Earth!\n\nCelebrate #EarthDay with us: https://go.nasa.gov/40AeM2G",
    "Share if you love Earth.  #EarthDay",
    "Happy #EarthDay \n\nFrom the tallest peaks to ocean depths, from arid deserts to lush forests, we observe our home from a unique perspective. Learn about the activities all around NASA, and about the picture that kicked off this celebration of our planet: https://go.nasa.gov/41yzVvI",
    "What's your favorite @NASAHubble image? http://bit.ly/3NauIG3\n\nLaunched 33 years ago today, the orbiting telescope captured this image of a nebula where stars are born -- 960 light-years away. http://go.nasa.gov/3VizSlr",
    "On April 25, @VP Kamala Harris & @President_KR Yoon Suk Yeol will tour @NASAGoddard and meet with scientists to see firsthand climate change research underway. They will also take an early look at @NASARoman, our next space telescope. https://go.nasa.gov/3Nbslmm",
    "LIVE: Preview the next spacewalk set for Friday, April 28. Veteran astronaut Steve Bowen and first-time spacewalker @Astro_Alneyadi will prepare the @Space_Station for solar power upgrades.",
    "NOW: @NASAEarth and @CenterForAstro scientists are answering questions on Reddit about TEMPO, a new space-based instrument that will revolutionize our understanding of air quality.\n \nWant to learn more? Ask your own Qs on our AMA.",
    "Wow! Look at all this love for Earth!  While you’re here, check out how we study Earth every day at @nasa.",
    "Meet the first member of our #Artemis II Moon crew: mission specialist \n@Astro_Christina\n! \n\nChristina Koch visited the \n@Space_Station\n in 2019, where she took part in the first all-woman spacewalk. She began her career as an electrical engineer at \n@NASAGoddard\n."
]