[
    "Wow, Uranus is showing off more these days.\n \n\n@NASASolarSystem\n researchers found a polar cyclone on the gas giant for the first time. Microwave observations and the planet's particular orbit gave scientists a better view: https://go.nasa.gov/427AvQi",
    "A Progress cargo ship carrying food, fuel, and supplies for the \n@Space_Station\n is scheduled to lift off and dock on Wednesday, May 24. NASA TV coverage begins at 8:30am ET (1230 UTC): https://go.nasa.gov/3IBjfvZ",
    "Wow, Uranus is showing off more these days.\n \n@NASASolarSystem researchers found a polar cyclone on the gas giant for the first time. Microwave observations and the planet's particular orbit gave scientists a better view: https://go.nasa.gov/427AvQi",
    "A Progress cargo ship carrying food, fuel, and supplies for the @Space_Station is scheduled to lift off and dock on Wednesday, May 24. NASA TV coverage begins at 8:30am ET (1230 UTC): https://go.nasa.gov/3IBjfvZ",
    "Looking for the latest news from low Earth orbit?\n\nFollow \n@NASASpaceOps\n for mission leadership updates as we live and work beyond our home planet.",
    "Throughout May, we’ll celebrate #AANHPIHeritageMonth by honoring some of the brilliant people who shape NASA and inspire generations: https://go.nasa.gov/3aVaglx",
    "Tale as old as time. \n\nUnusual asteroid Phaethon behaves like a comet. It brightens and forms a tail as it nears the Sun and is the source of a meteor shower, something usually led by comets. But this asteroid's tail tells a different story:\nhttps://go.nasa.gov/3LHmtQs",
    "This week at NASA, astronauts prepped the \n@Space_Station\n for more solar arrays, \n@NASAHubble\n celebrated its 33rd anniversary with a new image of a dark nebula, and \n@VP\n and \n@President_KR\n visited \n@NASAGoddard\n.",
    "TROPICS Launch Update! ",
    "Astronauts Steve Bowen and \n@Astro_Alneyadi\n concluded today’s seven-hour spacewalk at 4:12 p.m. ET (20:12 UTC). It was the eighth for Bowen and the first for any UAE astronaut: https://go.nasa.gov/3ADIeuf",
    " Live: TROPICS experts discuss the mission, which aims to improve understanding of tropical cyclones through regular measurements of precipitation, temperature & humidity.\n \nUse #AskNASA and your questions may get answered on air.",
    "Today's spacewalk is officially underway! The two astronauts have switched their spacesuits to battery power. Steve Bowen of \n@NASA_Astronauts\n and \n@Astro_Alneyadi\n will route power cables to prepare for future power system upgrades outside the \n@Space_Station\n.",
    "LIVE: It's spacewalk time. Watch with us as Steve Bowen of \n@NASA_Astronauts\n and \n@Astro_Alneyadi\n work on upgrades to the \n@Space_Station\n's power system.",
    " LIVE: Deputy Administrator \n@Astro_Pam\n delivers a plenary address at #38Space discussing progress towards a blueprint for sustained human exploration of the Moon and beyond with \n@NASAArtemis\n. https://bit.ly/3GQNi1S",
    "Whistles. Crunches. Whooshes.\n\nThese are a few of the space sounds heard in a new citizen science project called HARP.\nBy participating, you can investigate cosmic vibrations recorded by NASA spacecraft that help sing the song of the Sun and Earth.\n\nMore: http://go.nasa.gov/3mDXm7o",
    "Shine bright like a ULIRG \n\nWith the light of a trillion suns, an ultra-luminous infrared galaxy (ULIRG) shines in the latest \n@NASAWebb\n image. Located 250 million light-years away, this target is actually the result of two colliding spiral galaxies: https://go.nasa.gov/3L7dojN",
    "Astronauts need spacesuits for different occasions: life and work inside a spacecraft, spacewalks, and one day, planetary walks. In this episode of the Curious Universe podcast, we explore spacesuit design and creation, from fittings to new features: https://go.nasa.gov/3zxE6LK",
    "LIVE: An update on the science of #TEMPO, a space-based instrument that will revolutionize the way scientists observe air quality.",
    "Together, we've explored Earth, flight, and space. From the #Artemis I launch to the Moon to the DART asteroid impact to \n@NASAWebb\n’s first cosmic images. You're part of it all, including nine nominations for the #Webbys!\n\nVoting is open through April 20: https://go.nasa.gov/3KBXNZl",
    "If you’ve been tuning in, you know landing on Mars is half of the battle–returning the first astronauts home from the Red Planet is the other half.\nListen in as four experts discuss in this week's episode of “Houston, We have a Podcast”: https://go.nasa.gov/42FdMN9",
    "Want to help keep Earth safe from near-Earth asteroids? Join the International Astronomical Search Collaboration and help us find more of these remnants left over from the early formation of our solar system. \n@DoNASAScience\n at: https://science.nasa.gov/citizenscience?field_division_tid=81…",
    "Asteroid 2023 DZ2 will pass Earth more than 100,000 miles (161,000 km) away–about half the distance to the Moon–making its close approach at 3:51 p.m. EDT (12:51 p.m. PDT). Check out \n@NASA_Eyes\n on Asteroids at",
    "Newly-discovered asteroid 2023 DZ2 will sail safely past Earth today. Asteroids pass our planet safely all the time, but a close approach by one of this size (140–310 ft, or 43–95 m) happens only about once per decade. (There is no known threat for at least the next 100 years.)",
    "The #Artemis II rocket comes together, space explorers are honored, and we reveal a map of water near the Moon’s South Pole—all this week at NASA.\n\nFollow \n@NASAArtemis\n for updates on upcoming Moon missions.",
    "\"We choose to return to the Moon together…children who watch that flight are going to learn the names of those new pioneers. They'll be the ones who carry us into the future we hope to build.\"\n\n—\n@POTUS\n on the NASA-\n@CSA_ASC\n crewed #Artemis II Moon mission: https://youtube.com/live/4E2G75r0ekI?si=EnSIkaIECMiOmarE&t=5619…",
    "Through the lens of NASA photographer Aubrey Gemignani, we witness the people and hear the stories behind awe-inspiring missions to space. As a co-founder of \"Faces of NASA,\" we turn the camera on her and share her story: https://go.nasa.gov/42CIoPj",
    "First light data from the NASA-\n@CNES\n SWOT mission reveals that it provides 10 times the resolution of ocean measurements than data gathered by seven other satellites combined. These measurements will help us better study Earth’s surface water. https://go.nasa.gov/3z5hIJj",
    "Join us March 24 at 1pm ET to chat with \n@JHUAPL\n's Zibi Turtle about Saturn’s mammoth moon Titan and the #Dragonfly mission that will study the prebiotic chemistry occurring on its surface. Use #AskAstrobio for questions! \n\nSet a reminder to join  https://youtube.com/live/v-hS1koBJns?feature=share…",
    "LIVE: The \n@ISS_Research\n we're sending to space on tonight's #CRS27 launch could lead to healthier hearts and cleaner spacecraft—and that's just for starters.\n\nTune in now to our CRS-27 science telecon to learn more and share your Qs with #AskNASA:",
    "How about a big slice of pi(e)?\n\nWhether your favorite is apple, blueberry, or irrational, celebrate #PiDay with us! Check out some of the ways we use this mathematical constant to explore the universe: https://go.nasa.gov/2IKTXMB\n\nTell us how you're celebrating!"
]