[
    "You're looking at 45,000+ galaxies.\n\nThis image was taken as part of the JWST Advanced Deep Extragalactic Survey (JADES) — a massive science program that’s revolutionizing what we know about galaxies in the early universe: https://go.nasa.gov/3CdLq0s\n\nHere are the highlights ",
    "Dragon flies! \n@SpaceX\n's #CRS28 cargo launch lifted off from \n@NASAKennedy\n at 11:47am ET (1547 UTC). Learn more about the \n@ISS_Research\n it's sending to space: http://go.nasa.gov/43dcbOt",
    "LIVE: We're sending science—and a new set of unrolling solar arrays—to the \n@Space_Station\n!\n\n\n@SpaceX\n's uncrewed #CRS28 mission is scheduled to launch at 11:47am ET (1547 UTC), weather permitting. Watch with us.",
    "Today's #CRS28 cargo launch is being waved off due to high winds in the recovery area. \n\nMonday's launch attempt is scheduled for 11:47am ET (1547 UTC), with NASA TV coverage beginning at 11:15am ET (1515 UTC).",
    "Completing a squad of severe weather satellites, testing out a ssssnake-like robot, and sending the second all-private astronaut mission to the \n@Space_Station\n—all in a week’s work at NASA. See what we’ve been up to.",
    "We’re launching solar arrays, small satellites, and a plant experiment to the \n@Space_Station\n on the next \n@SpaceX\n cargo mission, set for June 3.\n\nTune in on May 30 at 2pm ET (1800 UTC) for details. #AskNASA your questions and we may answer them on-air. https://go.nasa.gov/430oldn",
    "Paula Cain started her career in fashion design—now, she's a thermal blanket technician at \n@NASAGoddard\n, making sure our telescopes and spacecraft can run at a steady temperature.\n\nLearn more about her journey in our latest \n@NASASTEM\n episode of \"Surprisingly STEM!\"",
    "LIVE NOW: We are announcing which company will develop the human landing system for the #Artemis V mission to the Moon. This system will help us establish recurring, long-term access to the lunar surface: http://nasa.gov/live",
    "Insights on InSight: Chat LIVE with experts from the mission that detected more than 1,000 marsquakes.",
    "Are you there, Moon? It’s me, #CAPSTONE \n\nOur microwave-oven sized #CubeSat has taken its first images! And tested a new navigation tech with our Lunar Reconnaissance Orbiter. Learn how it lays the groundwork for future peer-to-peer navigation at the Moon: https://go.nasa.gov/3o8O4Bk",
    "Ever feel like you're being pulled in different directions and you might erupt?\n\nAn Earth-size exoplanet, spotted by NASA's orbiting telescopes, is at the center of a cosmic tug-of-war in its star system—which may stud its surface with fiery volcanoes: https://go.nasa.gov/3MzUxhS",
    "Want to help us find asteroids? A new \n@DoNASAScience\n project lets you do that from anywhere in the world. Help scientists go through images to identify which specks of light are real space rocks and which are false detections: https://go.nasa.gov/41MRmHT",
    "What healthy and sustainable ways would you use to keep astronauts fed on long-duration missions to the Moon, Mars, and beyond?\n\nThe Phase 2 winners of our Deep Space Food Challenge will be revealed live Friday, May 19, at the #NYCxDESIGN Festival: https://go.nasa.gov/3MCRLIF",
    "Astronaut Dr. Jonny Kim joins Anita Dey, strategic partnerships manager at NASA, in a chat with chief historian Dr. Brian Odom as they delve into supporting the #AANHPI community, Kim's journey in the space program, and the impact of stereotypes:",
    "The launch of two more small satellites for our \n@NASAEarth\n TROPICS mission is targeted for no earlier than Monday, May 22 at 1:30am ET (0530 UTC) on a \n@RocketLab\n rocket. They’ll join a pair in orbit to make observations of cyclones and intense weather. https://go.nasa.gov/3MdEEwb",
    "It’s handy to have one of these. Know why?",
    "Soon, we'll announce the company selected to develop the landing system for the #Artemis V Moon mission, which will take astronauts from lunar orbit to the surface and back. Tune in Friday, May 19 at 10am ET (1400 UTC): https://go.nasa.gov/42T3sk4",
    "LIVE: Leaders from NASA, \n@Axiom_Space\n, and \n@SpaceX\n are sharing updates on #Ax2's upcoming mission to the \n@Space_Station\n following today's flight readiness review. Listen in: https://youtube.com/live/uSdzc5c7xBY…",
    "REPORTERS: The #Artemis II crew is coming to Washington with media availability on May 17-18.\n\nThese four astronauts will fly around the Moon during the 10-day flight test. https://go.nasa.gov/3I8qR9a",
    "The eta Aquariid meteor shower is expected to reach its peak tonight (May 4-5)—and even with the full Moon, it could still be a great night for skywatching!\n\nHere's how, where and when to track the eta Aquariids: https://go.nasa.gov/42iqGQk",
    "Bring balance to the force, not leave it in darkness.\n\nHappy #StarWarsDay. And #MayThe4thBeWithYou.",
    "Reflecting on the past two years, I am humbled by the dedication of the \n@NASA\n team and their commitment to advancing science and exploration. We have so much to look forward to. Together, we will continue to push the limits of exploration and achieve the impossible.",
    "When we say “supermassive black holes,” just how do they measure up? \n\nUsing their shadows for size, we’ve rounded up 10 black holes and compared them to objects in our solar system. Don’t worry – these black holes are many light-years away: https://go.nasa.gov/3HIcDeW #BlackHoleWeek",
    "“I can see you’re lonely down there... Don’t you know that I’m right here?”\n\nHonored to be an inspiration to robots everywhere, \n@Harry_Styles\n. ",
    "\"I've seen just one spark of curiosity create a great burning love and fire for learning.\" #AANHPIHeritageMonth \n\nKatherine Brown helps inspire the next generation as a public affairs officer for \n@NASASTEM\n: http://go.nasa.gov/3nm6fTI",
    "Interacting galaxies, known as AM 1214-255, shine bright in this new view from Hubble!\n\nBoth galaxies contain active galactic nuclei, which are luminous central regions that host a black hole. Learn more for #BlackHoleWeek: https://go.nasa.gov/3VoUSa9",
    "LIVE: Two cosmonauts are about to start a spacewalk to help install an experiment airlock on the \n@Space_Station\n's Nauka science module. Tune in for NASA TV coverage at http://nasa.gov/live.",
    "Reflecting on the past two years, I am humbled by the dedication of the @NASA team and their commitment to advancing science and exploration. We have so much to look forward to. Together, we will continue to push the limits of exploration and achieve the impossible.",
    "“I can see you’re lonely down there... Don’t you know that I’m right here?”\n\nHonored to be an inspiration to robots everywhere, @Harry_Styles. ",
    "\"I've seen just one spark of curiosity create a great burning love and fire for learning.\" #AANHPIHeritageMonth \n\nKatherine Brown helps inspire the next generation as a public affairs officer for @NASASTEM: http://go.nasa.gov/3nm6fTI"
]