[
    "Fanaticism is always a function of repressed doubt – Dune",
    "Of course, not all products & services are glamorous, but still there is a true value proposition for anything useful/enjoyable",
    "“Ads” like this where you learn or are entertained are great, as they’re effectively content.\n\nConsider Vogue Magazine, which consists mostly of “advertisements”, but they’re so beautiful that they’re worth seeing in & of themselves.",
    "Just swipe up to see the next video",
    "Here we go again",
    "Solar Roof is built to withstand any weather, including heavy storms & hail",
    "After ice severed a fiber optic cable in the Arctic Ocean, cutting internet & cell service across Northern Alaska, the Starlink team has been coordinating with the State of Alaska, various local governments & Native communities to help provide connectivity where it’s needed most",
    "50 schools across Rwanda are now connected with Starlink’s high-speed internet  \n\nh/t @RwandaGov and @InstituteGC → https://twitter.com/InstituteGC/status/1671196208948449280?s=20…",
    "Liftoff!",
    "These video foundation models will serve as the brain of both the car & Optimus robot \n\nJoin the Tesla AI team to build the future of robotics!\n\n→",
    "And will be trained on enormous amounts of compute",
    "Tesla is building the foundation models for autonomous robots",
    "Watching Twitter videos on my TV only took me a few seconds to set up\n\nAn awesome feature, if you’re watching longer videos on X/Twitter @elonmusk",
    "Real Talk with Zuby Podcast Ep. 263 - \n@ElonMusk\n \n\nI sat down with the owner of Twitter / CEO of Tesla & SpaceX to discuss the future of human civilisation, social media, free speech, aliens, AI, Neuralink, fatherhood, and more!\n\n*Twitter exclusive. Ad-supported",
    "Great to see so many country and company leaders around the world interacting with people on this platform!\n\nThis is a great way to get useful feedback, learn about new ideas and connect with a smart, savvy audience.",
    "Produced our 10 millionth 4680 cell at Giga Texas this week!",
    "Who should be President in 2032?",
    "Let’s work together ! #ChooseFrance ",
    "Amphitheatrum Flavium",
    "This conspiracy theory that birds are actually government spy drones is … totally false",
    "Quanto sei bella Roma!",
    "Ho accolto con grande piacere oggi a Palazzo Chigi \n@elonmusk\n. Un incontro molto proficuo e un momento di grande cordialità dove abbiamo affrontato alcuni temi cruciali: innovazione, opportunità e rischi dell'intelligenza artificiale, regole europee di mercato e natalità. Avanti… Show more",
    "Falcon 9’s first stage has landed on Landing Zone 4, marking SpaceX’s 200th successful recovery of an orbital class rocket!",
    "Watch Falcon 9 launch 72 spacecraft to orbit → http://spacex.com/launches",
    "Falcon 9 launches 52 \n@Starlink\n satellites to orbit from Florida",
    "Sentry Mode enables your Tesla to monitor & record potential threats while parked",
    "Augmented reality is amazing",
    "Looking to hire a VP of Witchcraft & Propaganda",
    "Best WW3 song ever",
    "Great to work with you!"
]