[
    "Interview with \n@BillMaher",
    "\"A lot of people still think Teslas are super expensive...but now we're at the point where the starting point of a Tesla is actually below the average selling price of a car in the United States,\" Elon Musk said Tuesday after Tesla's shareholder meeting. http://cnb.cx/42HSsWG",
    "Spaces interview with \n@davidfaber\n starting now",
    "Tesla shareholder meeting underway",
    "As more satellites & ground stations are added, latency & jitter will improve. Goal is <20ms latency.",
    "Interview with @BillMaher",
    "Spaces interview with @davidfaber starting now",
    "With each launch of our first gen \n@Starlink\n satellites, we add over a Tbps of capacity to the constellation; allowing us to continue improving coverage and connecting more people around the world with high-speed internet from space",
    "Super easy to use Starlink out of the box, no professional installer needed!",
    "J. Robert Oppenheimer's grandson: \"We must get over our cognitive and political bias: Nuclear energy is necessary and safe, and not the same as nuclear weapons\"",
    "Verified organization is one of the most important additions to Twitter. \n@elonmusk",
    "Thanks Dave!",
    "Starship is the largest, most capable rocket ever developed and will allow us to achieve a shared vision of a future where humanity is out exploring stars → http://youtube.com/spacex",
    "Early version of encrypted direct messages just launched.\n\nTry it, but don’t trust it yet.",
    "Falcon 9’s first stage has landed on the Of Course I Still Love You droneship",
    "Liftoff!",
    "Contributors’ time is valuable, and best spent reviewing high quality notes. Today we’re making the number of notes one can write in 24h proportional to their track record. The more helpful notes you’ve written, the more you can write. If you hit your limit, you’ll see this:",
    "Yesterday in the pit",
    "I read \n@paulg\n’s  “How to Make Wealth” in Hackers & Painters when I was in my mid twenties. It’s one of those pieces that blew my mind because it made me realize that I’d been wrong about something my whole life. The key section for me was the “Pie Fallacy”:",
    "Automatically QTs \n@CommunityNotes\n that have been rated Helpful by contributors. To appear here, notes must have kept their status of Helpful for 24hr, and have a high helpfulness score (0.45+ intercept score). How do notes become Helpful?",
    "What should do more of or less of or aren’t including at all?",
    "We’re trying hard to make your feed as compelling as possible (maximize unregretted user minutes). \n\nHow is it now vs 6 months ago?",
    "“A new philosophy of the future is needed. I believe it should be curiosity about the Universe – expand humanity to become a multiplanet, then interstellar, species to see what’s out there.” \n@elonmusk",
    "",
    "I read @paulg’s  “How to Make Wealth” in Hackers & Painters when I was in my mid twenties. It’s one of those pieces that blew my mind because it made me realize that I’d been wrong about something my whole life. The key section for me was the “Pie Fallacy”:",
    "Automatically QTs @CommunityNotes that have been rated Helpful by contributors. To appear here, notes must have kept their status of Helpful for 24hr, and have a high helpfulness score (0.45+ intercept score). How do notes become Helpful?",
    "“A new philosophy of the future is needed. I believe it should be curiosity about the Universe – expand humanity to become a multiplanet, then interstellar, species to see what’s out there.” @elonmusk",
    "Falcon Heavy",
    "Watch Falcon Heavy launch \n@ViasatInc\n’s ViaSat-3 Americas mission to orbit → http://spacex.com/launches",
    "T-1 hour until Falcon Heavy's launch of \n@ViasatInc\n’s ViaSat-3 Americas mission; weather is 95% favorable for liftoff at 8:26 p.m. ET → http://spacex.com/launches/mission/?missionId=ViaSat-3-Americas…"
]