[
    "Incompetence, in the limit, is indistinguishable from sabotage",
    "Transparency builds trust …",
    "Yikes",
    "Sorry this app takes up so much space",
    "End Poem of minecraft is literally the best thing I've ever read?? So worth reading the whole thing: https://en.m.wikisource.org/wiki/End_Poem",
    "Love to see Starlink providing great connectivity to those who had little or nothing before. \n\nAs soon as you can access the Internet, you can learn almost anything, so it’s absolutely essential for education.\n\n\n@khanacademy\n being a great example.",
    "Once you’ve tasted the full phone to car and technological experience of a Tesla you can’t go back to any other cars. There’s nothing like it on the market by a mile.\n\nIt’s all the small things that quickly adds up to make you never want to drive anything else, ever.",
    "It was really unfair to Magneto",
    "¡Starlink ya está disponible en Panamá!",
    "To heir is human, \nTo procreate divine",
    "Love to see Starlink providing great connectivity to those who had little or nothing before. \n\nAs soon as you can access the Internet, you can learn almost anything, so it’s absolutely essential for education.\n\n@khanacademy being a great example.",
    "I’d like apologize for this post",
    "\"A lot of people still think Teslas are super expensive...but now we're at the point where the starting point of a Tesla is actually below the average selling price of a car in the United States,\" Elon Musk said Tuesday after Tesla's shareholder meeting. http://cnb.cx/42HSsWG",
    "Spaces interview with @davidfaber starting now",
    "Tesla shareholder meeting underway",
    "As more satellites & ground stations are added, latency & jitter will improve. Goal is <20ms latency.",
    "I read \n@paulg\n’s  “How to Make Wealth” in Hackers & Painters when I was in my mid twenties. It’s one of those pieces that blew my mind because it made me realize that I’d been wrong about something my whole life. The key section for me was the “Pie Fallacy”:",
    "Automatically QTs \n@CommunityNotes\n that have been rated Helpful by contributors. To appear here, notes must have kept their status of Helpful for 24hr, and have a high helpfulness score (0.45+ intercept score). How do notes become Helpful?",
    "“A new philosophy of the future is needed. I believe it should be curiosity about the Universe – expand humanity to become a multiplanet, then interstellar, species to see what’s out there.” \n@elonmusk",
    "We’re trying hard to make your feed as compelling as possible (maximize unregretted user minutes). \n\nHow is it now vs 6 months ago?",
    "Yesterday in the pit",
    "",
    "Feeling nostalgic",
    "T-1 hour until Falcon Heavy's launch of \n@ViasatInc\n’s ViaSat-3 Americas mission; weather is 95% favorable for liftoff at 8:26 p.m. ET → http://spacex.com/launches/mission/?missionId=ViaSat-3-Americas…",
    "Model Y AWD is the most efficient electric SUV ever built",
    "Interview with \n@BillMaher",
    "Watch Falcon Heavy launch \n@ViasatInc\n’s ViaSat-3 Americas mission to orbit → http://spacex.com/launches",
    "Your Tesla can automatically navigate to destinations based on your calendar",
    "All systems and weather are looking good for tonight's Falcon Heavy launch of \n@ViasatInc\n's ViaSat-3 Americas mission → http://spacex.com/launches/mission/?missionId=ViaSat-3-Americas…",
    "Or maybe just X"
]