[
    "Interview with \n@BillMaher",
    "I hope this platform increasingly brings you joy & elucidation",
    "Falcon 9 and Dragon vertical at 39A; targeting Sunday, May 21 at 5:37 p.m. ET for launch of Ax-2 → http://spacex.com/launches/mission/?missionId=ax-2…",
    "Over one-third of secondary schools and two-thirds of primary schools around the world are not connected to the internet.\n\nOn the isolated island of Pangan-an in the Philippines, Starlink was set up to support 700+ elementary and high school students → http://sunstar.com.ph/article/1961567/cebu/local-news/satellite-connects-isolated-cebu-island-to-the-internet…… Show more",
    "Walter is incredibly thorough in his research. Highly recommend his other books!",
    "Happens a lot",
    "Explaining Constitutional Amendments",
    "If AGI is almost here, why doesn’t autocorrekt work!?",
    "Raptor V3 just achieved 350 bar chamber pressure (269 tons of thrust). Congrats to \n@SpaceX\n propulsion team!\n\nStarship Super Heavy Booster has 33 Raptors, so total thrust of 8877 tons or 19.5 million pounds.",
    "[correction: \n@wsj\n trailed by several years]",
    "Remarkable how \n@nytimes\n, \n@latimes\n & \n@washingtonpost\n moved in lockstep, with \n@WSJ\n trailing by ~6 months",
    "Massive public manipulation",
    "Yup",
    "First passenger rail service in the world to adopt Starlink! ",
    "Trust nothing, not even nothing",
    "WhatsApp cannot be trusted",
    "Governments worldwide claim that \"hate incidents\" are rising, but they're not. Tolerance of racial, sexual, and religious minorities has never been higher. Elites are manufacturing a fake \"hate\" crisis as a pretext for mass spying, blacklists, and censorship.",
    "Interesting article. Perhaps \n@CommunityNotes\n can add further context & corrections.",
    "¡Notas de la Comunidad sigue creciendo! Bienvenidos a los contribuyentes de Argentina, Chile, Colombia, Ecuador, Guatemala, Perú y Venezuela\n\n",
    "May the 4th be with you ",
    "Falcon 9’s first stage has landed on the A Shortfall of Gravitas droneship",
    "Watch Falcon 9 launch 56 Starlink satellites to orbit → http://spacex.com/launches/",
    "Vegas Loop is expanding - 65 miles and 69 stations!  Thanks to \n@ClarkCountyNV\n for the great partnership.",
    "Vegas Loop is expanding - 65 miles and 69 stations!  Thanks to @ClarkCountyNV for the great partnership.",
    "The idea that governments around the world have for years been secretly censoring ordinary citizens sounds crazy, but it's true. Worse, they are now on the cusp of imposing what can only be described as a totalitarian system to end freedom of speech as we know it.",
    "Such a great day in so many ways",
    "Starship Liftoff",
    "Starship Supersonic",
    "Starship launch attempt in ~7 hours",
    "T-12 hours until the first flight test of a fully integrated Starship and Super Heavy rocket; targeting ~8:00 a.m. CT for liftoff → http://spacex.com/launches"
]