[
    "Training begins for the \n@NASAArtemis\n II astronauts!\n\nWhile some of us are enjoying the start of summer vacation, they just began training for their mission to the Moon and back.\n\nHere's the trajectory map they covered in class this week: https://go.nasa.gov/44dztUs",
    "A new way to visualize our changing planet, \n@NASAWebb\n searches for an atmosphere on TRAPPIST-1 c, and a look inside the future home of asteroid samples from OSIRIS-REx.\n\nAll this and more—This Week at NASA. http://nasa.gov/subscribe",
    "You know about earthquakes, but what about moonquakes and marsquakes? We asked a NASA scientist about what otherworldly quakes can tell us: https://go.nasa.gov/3N68hP1",
    "Oh, those summer nights! It's the #SummerSolstice, the longest day in the Northern Hemisphere—and the shortest in the Southern Hemisphere where winter starts.\n\nGlance up tonight for a planetary cameo, with Mars and Venus just beside the Moon: https://go.nasa.gov/3CDqMaj",
    "We created the Earth Information Center with founding partners across the federal government, including the \n@EPA\n, \n@FEMA\n, \n@NOAA\n, \n@USAID\n, \n@USDA\n, and \n@USGS\n.\n \nTogether, we're delivering satellite data directly to people, whether they live on farms or in cities.… Show more",
    "LIVE: Watch the ribbon-cutting for our new Earth Information Center at NASA Headquarters in Washington. The new tool will provide data to the public and decision makers to help adapt and respond to our changing planet: https://go.nasa.gov/eic",
    "We’ve taken light data detected by four of our telescopes—\n@ChandraXray\n, \n@NASAWebb\n, \n@NASAHubble\n, and Spitzer Space Telescope—and turned them into sound. Hear what some galaxies and stars sound like: https://go.nasa.gov/3PjoNzt",
    "The Sun emitted a strong solar flare on June 20, 2023, peaking at 1:09 ET. NASA’s Solar Dynamics Observatory captured an image of the event, which was classified as X1.0. https://go.nasa.gov/3qSaNT7",
    "Two Roscosmos cosmonauts will conduct a spacewalk to make upgrades to the \n@Space_Station\n on Thursday, June 22, beginning around 10:20am ET (1420 UTC). NASA TV coverage starts at 9:45am ET (1345 UTC): https://go.nasa.gov/43M2AOM",
    "Today is #Juneteenth, commemorating the day in 1865 when enslaved African Americans in Galveston, Texas were finally able to claim their freedom. In a conversation filmed at \n@SpaceCenterHou\n, \n@AstroVicGlover\n reflects on the holiday and its history.",
    "LIVE: Steve Bowen and \n@Astro_Woody\n are installing a new roll-out solar array outside the \n@Space_Station\n.\n\nToday's spacewalk is scheduled to start around 8:55am ET (1255 UTC) and run for six hours.",
    "In collaboration with \n@GoogleArts\n, \n@NASAGoddard\n scientist Dr. Heather Graham sits down with \n@Astro_Kobi\n to discuss how we find answers to the age-old question: Is there life beyond Earth?",
    "Why is Venus so hot?\n\nThe planet’s thick CO2-filled atmosphere is great at trapping heat. This creates a runaway greenhouse effect that makes Venus roughly 700°F (389°C) hotter than it would be otherwise. \n@NASAJPL\n's Dr. Amy Hofmann gives us the details: https://go.nasa.gov/42FxR4v",
    "To-do: Become a NASA Intern \n\nToday our #NASAInterns completed their first week at \n@NASA\n. Already these #ArtemisGeneration interns are putting their talent and creativity to work for the betterment of all. \n\nWelcome to the team!",
    ".\n@NASA_Astronauts\n Stephen Bowen and \n@Astro_Woody\n successfully installed and deployed the space station's fifth roll-out solar array during a six-hour and three-minute spacewalk today.",
    "Upgrade in progress: a new solar array unrolls on the \n@Space_Station\n. It will produce more than 20 kilowatts of electricity to augment the station's power supply and support more \n@ISS_Research\n.",
    "\"'NASA for all.' That's something that I think is really important because we are the universe, right? We are made of star stuff.\"\n\nCelebrate #Pride and learn how Rebecca Sirmons helps tell the story of the universe as NASA TV's executive producer: http://go.nasa.gov/3IVxzj7",
    "Peer pressure.\n\n\n@NASAHubble\n spots a galaxy about 50 million light-years away that holds some surprises: Two nearby galaxies are influencing it and it may or may not have a supermassive black hole at its center. http://go.nasa.gov/45It84O",
    "Over 7,000 pounds of new experiments, new solar arrays, and other cargo has arrived at the station after the \n@SpaceX\n Dragon cargo craft docked to the Harmony module at 5:54am ET today.",
    "#MissionToPsyche is on track for launch in October 2023!\n\nAn independent review board found JPL’s response to address factors contributing to the mission’s 2022 launch delay has been \"world class.\"",
    "LIVE: Tune in as we review next steps for the Psyche mission, set to launch no earlier than Oct. 2023. The spacecraft will study a metal-rich asteroid of the same name that may be the partial core of a building block of rocky planets in our solar system.",
    "You're looking at 45,000+ galaxies.\n\nThis image was taken as part of the JWST Advanced Deep Extragalactic Survey (JADES) — a massive science program that’s revolutionizing what we know about galaxies in the early universe: https://go.nasa.gov/3CdLq0s\n\nHere are the highlights ",
    "Dragon flies! \n@SpaceX\n's #CRS28 cargo launch lifted off from \n@NASAKennedy\n at 11:47am ET (1547 UTC). Learn more about the \n@ISS_Research\n it's sending to space: http://go.nasa.gov/43dcbOt",
    "LIVE: We're sending science—and a new set of unrolling solar arrays—to the \n@Space_Station\n!\n\n\n@SpaceX\n's uncrewed #CRS28 mission is scheduled to launch at 11:47am ET (1547 UTC), weather permitting. Watch with us.",
    "Today's #CRS28 cargo launch is being waved off due to high winds in the recovery area. \n\nMonday's launch attempt is scheduled for 11:47am ET (1547 UTC), with NASA TV coverage beginning at 11:15am ET (1515 UTC).",
    "A geyser on Saturn’s moon Enceladus, the #Ax2 all-private astronaut crew depart the \n@Space_Station\n, and an independent panel of experts discusses unidentified anomalous phenomena: all this & more, this week at NASA.\n\nSubscribe for more space in your life: http://nasa.gov/subscribe",
    "We're now targeting Sunday, June 4 for the launch of #CRS28, to allow for improving weather conditions and additional vehicle preparations. NASA TV coverage will begin at 11:45am ET (1545 UTC), with launch targeted for 12:12pm (1612 UTC): https://blogs.nasa.gov/crs-28/2023/06/03/weather-40-favorable-for-spacexs-28th-cargo-resupply-launch/…",
    "LIVE: Get the latest details on the launch of \n@SpaceX\n’s #CRS28 uncrewed cargo resupply mission to the \n@Space_Station\n. Liftoff is currently set for Saturday, June 3, at 12:35pm ET (1635 UTC).",
    "Soon, \n@SpaceX\n’s #CRS28 Dragon cargo spacecraft is set to launch food, supplies, scientific experiments, & tech demos to the \n@Space_Station\n. Learn about the science aboard, including plant & genetic studies and satellite projects: https://go.nasa.gov/43dcbOt",
    "This month and every month, we recognize the achievements and contributions of our Asian American, Native Hawaiian, and Pacific Islander workforce.\n\nCheck out the gallery and celebrate #AANHPIHeritageMonth with us: https://go.nasa.gov/3MHtxf9"
]