[
    "What does it take to get ready for a spacewalk?\n\nHere's a behind-the-scenes look with \n@Astro_Woody\n, who will make his first trip outside the \n@Space_Station\n on Friday, June 9:",
    "\"'NASA for all.' That's something that I think is really important because we are the universe, right? We are made of star stuff.\"\n\nCelebrate #Pride and learn how Rebecca Sirmons helps tell the story of the universe as NASA TV's executive producer: http://go.nasa.gov/3IVxzj7",
    "Peer pressure.\n\n\n@NASAHubble\n spots a galaxy about 50 million light-years away that holds some surprises: Two nearby galaxies are influencing it and it may or may not have a supermassive black hole at its center. http://go.nasa.gov/45It84O",
    "LIVE: Listen as we discuss the science aboard the next \n@SpaceX\n cargo mission set for Saturday, June 3, sending solar arrays, small satellites, and a plant experiment to the \n@Space_Station\n. Tag questions #AskNASA.",
    "\"Congratulations on an outstanding mission.\"\n\nThe crew of the \n@Space_Station\n shared their thanks and farewells after Axiom Mission 2 undocked from the orbiting lab at 11:05am ET (1505 UTC). #Ax2 is scheduled to splash down off the coast of Florida tonight: https://go.nasa.gov/3MK1kUW",
    "LIVE: The Axiom Mission 2 crew is heading home in \n@SpaceX\n's Dragon Freedom spacecraft after wrapping up the second all-private astronaut mission to the \n@Space_Station\n. #Ax2 undocking is scheduled for 11:05am ET (1505 UTC).",
    "LIVE: After more than a week of science, outreach, and on-orbit activities, the all-private astronaut crew of #Ax2 is boarding their \n@SpaceX\n Dragon Freedom spacecraft to return to Earth. Hatch closure is scheduled for 9:10am ET (1310 UTC): http://nasa.gov/live",
    "Ad astra per aspera \n\nJoin us this #MemorialDay in remembering and honoring all those who made the ultimate sacrifice in service to our country.",
    "After just over a week in space, \n@Axiom_Space\n's #Ax2 astronauts are set to return to Earth on Tuesday, May 30. Here’s how to watch live coverage, from closing of the hatches to splashdown: https://go.nasa.gov/43vWzp6",
    "Two \n@NASA_Astronauts\n will do a pair of spacewalks on June 9 and June 15 to install new solar arrays on the \n@Space_Station\n. We’ll stream them live.\n \nJoin us for a preview on June 1: https://go.nasa.gov/3MGCCFj",
    "We completed a joint checkpoint review with \n@BoeingSpace\n ahead of the first #Starliner flight to carry astronauts, set for no earlier than July 21. Teams will provide updates leading up to the inaugural Crew Flight Test to and from the \n@Space_Station\n: https://go.nasa.gov/3MZR1xG",
    "Hot new bombshells enter the villa.\n\nOtherwise invisible to the unaided eye, infrared data from \n@NASAWebb\n and x-ray data from \n@ChandraXray\n make details in these proper fit cosmic wonders available by mapping the data to colors that humans can perceive:\nhttps://go.nasa.gov/43wTsx9",
    "LAUNCH UPDATE \nDue to weather, \n@RocketLab\n and \n@NASA\n are now targeting 1 am EDT Tues, 23 May (5 pm NZST) for the final TROPICS launch. Two #CubeSats are set to join a constellation to improve forecasting of typhoons and hurricanes. For updates https://blogs.nasa.gov/smallsatellites/…",
    "The \n@NASAArtemis\n II astronauts visit Washington, \n@BlueOrigin\n is selected to develop the landing system that will take astronauts to and from the surface of the Moon on #Artemis V, and \n@NASARoman\n takes shape.\n\nSubscribe for all this and more: http://nasa.gov/subscribe",
    "LIVE: We're announcing the Phase 2 winners for our \n@NASAPrize\n Deep Space Food Challenge, a global competition to develop sustainable ways of producing healthy food for long-term missions to the Moon, Mars, and beyond.\n\nWatch with us at #NYCxDESIGN:",
    "We selected \n@BlueOrigin\n to develop the human landing system for the #Artemis V mission. This component for deep space transportation will help us in our goal of sending astronauts to the surface of the Moon and returning them home safely: https://go.nasa.gov/3Mn3QQU",
    "LIVE NOW: We are announcing which company will develop the human landing system for the #Artemis V mission to the Moon. This system will help us establish recurring, long-term access to the lunar surface: http://nasa.gov/live",
    "Insights on InSight: Chat LIVE with experts from the mission that detected more than 1,000 marsquakes.",
    "Are you there, Moon? It’s me, #CAPSTONE \n\nOur microwave-oven sized #CubeSat has taken its first images! And tested a new navigation tech with our Lunar Reconnaissance Orbiter. Learn how it lays the groundwork for future peer-to-peer navigation at the Moon: https://go.nasa.gov/3o8O4Bk",
    "Ever feel like you're being pulled in different directions and you might erupt?\n\nAn Earth-size exoplanet, spotted by NASA's orbiting telescopes, is at the center of a cosmic tug-of-war in its star system—which may stud its surface with fiery volcanoes: https://go.nasa.gov/3MzUxhS",
    "Want to help us find asteroids? A new \n@DoNASAScience\n project lets you do that from anywhere in the world. Help scientists go through images to identify which specks of light are real space rocks and which are false detections: https://go.nasa.gov/41MRmHT",
    "@WomenNASA\n Liz Landau, host and science communicator\n\n\n@ChandraXray\n Daryl Haggard, astrophysicist\n\n\n@NASAJPL\n Michele Vallisneri, theoretical physicist\n\n\n@NASAUniverse\n Regina Caputo, astrophysicist",
    "We can’t imagine a more beautiful thing than May’s full moon – the Corn Moon. \n\nSet to peak on May 5 at 1:34pm ET (1634 UTC ), this full moon, also known as the Flower Moon, will appear full till Sunday. Discover how it got its names: http://go.nasa.gov/3piIAUs",
    "Today we mourn the passing of Samuel Durrance, an astronomer who flew aboard two \n@NASA\n Space Shuttle missions as a payload specialist and operated a collection of four telescopes as part of the Astro-1 and Astro-2 Spacelabs. Godspeed, Samuel.",
    "Join us tomorrow from the \n@Space_Station\n!\n\nWith #Crew6 aboard, \n@SpaceX\n's Dragon Endeavour spacecraft is undocking and moving to a new port to make room for an upcoming cargo launch. Watch here and at http://nasa.gov/live starting at 7am ET (1100 UTC) on Saturday, May 6.",
    "Four of Uranus’ largest moons—Ariel, Umbriel, Titania, and Oberon—may have oceans beneath their icy crusts, according to a re-analysis of Voyager 2 data. https://go.nasa.gov/3VQtF0l",
    "It’s a TRAP(PIST)-1! \n\nAbout 40 light-years away lies a planetary system with the most Earth-sized exoplanets found in a star's habitable zone. Learn more about the TRAPPIST-1 system that was recently studied by \n@NASAWebb\n: http://go.nasa.gov/415DmsC\n\n#MayTheFourth",
    "When we say “supermassive black holes,” just how do they measure up? \n\nUsing their shadows for size, we’ve rounded up 10 black holes and compared them to objects in our solar system. Don’t worry – these black holes are many light-years away: https://go.nasa.gov/3HIcDeW #BlackHoleWeek",
    "The eta Aquariid meteor shower is expected to reach its peak tonight (May 4-5)—and even with the full Moon, it could still be a great night for skywatching!\n\nHere's how, where and when to track the eta Aquariids: https://go.nasa.gov/42iqGQk",
    "LIVE: Preview the next spacewalk set for Friday, April 28. Veteran astronaut Steve Bowen and first-time spacewalker \n@Astro_Alneyadi\n will prepare the \n@Space_Station\n for solar power upgrades."
]