[
    "Smoke from wildfires in Quebec moved across eastern portions of Canada and the U.S. this week. This \n@NASAEarth\n computer model used satellite, aircraft, and ground-based data to track the black carbon particles (soot) and hazardous air. https://go.nasa.gov/3J4yaiu",
    "To-do: Become a NASA Intern \n\nToday our #NASAInterns completed their first week at \n@NASA\n. Already these #ArtemisGeneration interns are putting their talent and creativity to work for the betterment of all. \n\nWelcome to the team!",
    "Hurricane season in the Atlantic begins today. Our unique perspective from space allows us to study storms and their evolution, providing data to support forecasting and disaster responses: https://go.nasa.gov/3fYNZYE",
    "Join us and \n@LibraryCongress\n as U.S. Poet Laureate Ada Limón reveals her poem for the \n@EuropaClipper\n mission. The poem will be engraved on the spacecraft, and travel 1.8 billion miles (2.89 billion kilometers) to an icy moon of Jupiter. \n\nTune in: https://bit.ly/42eJZJO",
    "I just reached a milestone only surpassed by Opportunity: 30 km on Mars   \n\nI've explored so much in my 10-plus-year trek through Gale Crater, but there are many more rocks to sample and analyze! Retrace my tracks with this interactive map: http://go.nasa.gov/3EtmSCi",
    "A Progress cargo ship carrying food, fuel, and supplies for the \n@Space_Station\n is scheduled to lift off and dock on Wednesday, May 24. NASA TV coverage begins at 8:30am ET (1230 UTC): https://go.nasa.gov/3IBjfvZ",
    "Recent studies from \n@NASAAmes\n shed new light on Saturn’s rings, pointing to evidence that the rings—comprised of almost entirely pure ice—are a relatively new addition to the gas giant and may only last a few 100 million years more. http://go.nasa.gov/3ooyku0",
    "Welcome aboard the station #Ax2! The four \n@Axiom_Space\n private astronauts entered the orbital outpost after opening the \n@SpaceX\n Dragon crew ship hatch at 11am ET today.",
    "Hey, you: Get a load of this cloud! High-altitude ice clouds (like this one) can help regulate Earth's temperature by reflecting energy from the Sun.\n\nA new \n@NASAEarth\n mission called PoISIR aims to study them in greater detail to improve climate forecasts. https://go.nasa.gov/3IAfgjj",
    "Wow, Uranus is showing off more these days.\n \n\n@NASASolarSystem\n researchers found a polar cyclone on the gas giant for the first time. Microwave observations and the planet's particular orbit gave scientists a better view: https://go.nasa.gov/427AvQi",
    "#Ax2 has arrived! The \n@SpaceX\n Dragon crew ship with four private astronauts from \n@Axiom_Space\n docked to the station at 9:12am ET today. They will enter the orbital outpost soon live on \n@NASA\n TV.",
    "NOW: Watch the \n@Axiom_Space\n #Ax2 astronauts arrive at the \n@Space_Station\n. The \n@SpaceX\n Dragon is set to dock at around 9:16am ET (1316 UTC).",
    "LIVE: Mission experts recap the launch of #Ax2, \n@Axiom_Space\n's second all-private mission to the \n@Space_Station\n.",
    "#Ax2's \n@SpaceX\n Dragon Freedom spacecraft has separated from its rocket—the Axiom Mission 2 crew is now on course for the \n@Space_Station\n.\n\nTune in for docking coverage (here and on NASA TV) starting at 7:30am ET (1130 UTC) on Monday, May 22.",
    "This \n@NASAWebb\n image of the Pillars of Creation helps astronomers determine how stars form. Plus, it makes pretty sweet digital wallpaper.\n\nDownload high-resolution images from https://webbtelescope.org.",
    "When the Relativity Space Terran 1 rocket lit up the night sky as it launched this past March, it became the first 3D-printed rocket test of its kind. Learn about GRCop—an innovative, high strength material at the center of this breakthrough: https://go.nasa.gov/44igKrA",
    "Solid answers, good job everybody. And as for us? We love exploring, but there's no place like home.",
    "Astronaut Kjell Lindgren has been a crewmember on the \n@Space_Station\n for two long-duration stays. His work during those expeditions helps keep crew safe and healthy and directly contributes to our goal of going to Mars. #AANHPIHeritageMonth https://go.nasa.gov/42DHp0r",
    "What’s your favorite planet?",
    "Our next \n@SpaceX\n cargo launch, carrying supplies and a new set of unrolling solar panels to the \n@Space_Station\n, is now scheduled to lift off from \n@NASAKennedy\n on Saturday, June 3. Media accreditation is open: https://go.nasa.gov/3M5UuKB",
    "Happy #TeacherAppreciationWeek! Our thanks go out to the teachers and educators who work tirelessly to elevate the next generation of explorers.\n\nJoin us this week for live webinars and ready-to-use resources from \n@NASASTEM\n and \n@DoNASAScience\n: https://go.nasa.gov/3NOWmZu",
    "Two storm-observing TROPICS small satellites lifted off on a \n@RocketLab\n Electron rocket, with two more to follow this month. This marks the first completed launch for a \n@NASA_LSP\n contract designed to increase access to space for science and tech missions. https://go.nasa.gov/44QozFo",
    "This @NASAWebb image of the Pillars of Creation helps astronomers determine how stars form. Plus, it makes pretty sweet digital wallpaper.\n\nDownload high-resolution images from https://webbtelescope.org.",
    "Astronaut Kjell Lindgren has been a crewmember on the @Space_Station for two long-duration stays. His work during those expeditions helps keep crew safe and healthy and directly contributes to our goal of going to Mars. #AANHPIHeritageMonth https://go.nasa.gov/42DHp0r",
    "Our next @SpaceX cargo launch, carrying supplies and a new set of unrolling solar panels to the @Space_Station, is now scheduled to lift off from @NASAKennedy on Saturday, June 3. Media accreditation is open: https://go.nasa.gov/3M5UuKB",
    "Happy #TeacherAppreciationWeek! Our thanks go out to the teachers and educators who work tirelessly to elevate the next generation of explorers.\n\nJoin us this week for live webinars and ready-to-use resources from @NASASTEM and @DoNASAScience: https://go.nasa.gov/3NOWmZu",
    "Two storm-observing TROPICS small satellites lifted off on a @RocketLab Electron rocket, with two more to follow this month. This marks the first completed launch for a @NASA_LSP contract designed to increase access to space for science and tech missions. https://go.nasa.gov/44QozFo",
    "Shine bright like a ULIRG \n\nWith the light of a trillion suns, an ultra-luminous infrared galaxy (ULIRG) shines in the latest \n@NASAWebb\n image. Located 250 million light-years away, this target is actually the result of two colliding spiral galaxies: https://go.nasa.gov/3L7dojN",
    "We’re broadcasting live from #38Space Symposium this week!\n\nApril 18, 11:15am ET (1515 UTC) \n@Astro_Pam\n on \"Our Next Steps to the Moon and Beyond\"\n\nApril 19, 4pm ET (2000 UTC) NASA leaders discuss \"Moon to Mars\" strategy\n\nInfo on NASA at #SpaceSymposium: https://go.nasa.gov/3o8i6ob",
    "Having trouble sleeping? Try some of these seven techniques our astronauts use to get better sleep in space!\n \nThese methods help \n@NASA_Astronauts\n sleep well through the disruptions of their natural sleep cycle — and they may help you too: https://go.nasa.gov/3MNWYhA"
]