[
    "Training begins for the \n@NASAArtemis\n II astronauts!\n\nWhile some of us are enjoying the start of summer vacation, they just began training for their mission to the Moon and back.\n\nHere's the trajectory map they covered in class this week: https://go.nasa.gov/44dztUs",
    "A new way to visualize our changing planet, \n@NASAWebb\n searches for an atmosphere on TRAPPIST-1 c, and a look inside the future home of asteroid samples from OSIRIS-REx.\n\nAll this and more—This Week at NASA. http://nasa.gov/subscribe",
    "You know about earthquakes, but what about moonquakes and marsquakes? We asked a NASA scientist about what otherworldly quakes can tell us: https://go.nasa.gov/3N68hP1",
    "Oh, those summer nights! It's the #SummerSolstice, the longest day in the Northern Hemisphere—and the shortest in the Southern Hemisphere where winter starts.\n\nGlance up tonight for a planetary cameo, with Mars and Venus just beside the Moon: https://go.nasa.gov/3CDqMaj",
    "We created the Earth Information Center with founding partners across the federal government, including the \n@EPA\n, \n@FEMA\n, \n@NOAA\n, \n@USAID\n, \n@USDA\n, and \n@USGS\n.\n \nTogether, we're delivering satellite data directly to people, whether they live on farms or in cities.… Show more",
    "LIVE: Watch the ribbon-cutting for our new Earth Information Center at NASA Headquarters in Washington. The new tool will provide data to the public and decision makers to help adapt and respond to our changing planet: https://go.nasa.gov/eic",
    "We’ve taken light data detected by four of our telescopes—\n@ChandraXray\n, \n@NASAWebb\n, \n@NASAHubble\n, and Spitzer Space Telescope—and turned them into sound. Hear what some galaxies and stars sound like: https://go.nasa.gov/3PjoNzt",
    "The Sun emitted a strong solar flare on June 20, 2023, peaking at 1:09 ET. NASA’s Solar Dynamics Observatory captured an image of the event, which was classified as X1.0. https://go.nasa.gov/3qSaNT7",
    "Two Roscosmos cosmonauts will conduct a spacewalk to make upgrades to the \n@Space_Station\n on Thursday, June 22, beginning around 10:20am ET (1420 UTC). NASA TV coverage starts at 9:45am ET (1345 UTC): https://go.nasa.gov/43M2AOM",
    "Today is #Juneteenth, commemorating the day in 1865 when enslaved African Americans in Galveston, Texas were finally able to claim their freedom. In a conversation filmed at \n@SpaceCenterHou\n, \n@AstroVicGlover\n reflects on the holiday and its history.",
    "We created the Earth Information Center with founding partners across the federal government, including the @EPA, @FEMA, @NOAA, @USAID, @USDA, and @USGS.\n \nTogether, we're delivering satellite data directly to people, whether they live on farms or in cities.… Show more",
    "We’ve taken light data detected by four of our telescopes—@ChandraXray, @NASAWebb, @NASAHubble, and Spitzer Space Telescope—and turned them into sound. Hear what some galaxies and stars sound like: https://go.nasa.gov/3PjoNzt",
    "Two Roscosmos cosmonauts will conduct a spacewalk to make upgrades to the @Space_Station on Thursday, June 22, beginning around 10:20am ET (1420 UTC). NASA TV coverage starts at 9:45am ET (1345 UTC): https://go.nasa.gov/43M2AOM",
    "Today is #Juneteenth, commemorating the day in 1865 when enslaved African Americans in Galveston, Texas were finally able to claim their freedom. In a conversation filmed at @SpaceCenterHou, @AstroVicGlover reflects on the holiday and its history.",
    "To-do: Become a NASA Intern \n\nToday our #NASAInterns completed their first week at \n@NASA\n. Already these #ArtemisGeneration interns are putting their talent and creativity to work for the betterment of all. \n\nWelcome to the team!",
    ".\n@NASA_Astronauts\n Stephen Bowen and \n@Astro_Woody\n successfully installed and deployed the space station's fifth roll-out solar array during a six-hour and three-minute spacewalk today.",
    "Upgrade in progress: a new solar array unrolls on the \n@Space_Station\n. It will produce more than 20 kilowatts of electricity to augment the station's power supply and support more \n@ISS_Research\n.",
    "You're looking at 45,000+ galaxies.\n\nThis image was taken as part of the JWST Advanced Deep Extragalactic Survey (JADES) — a massive science program that’s revolutionizing what we know about galaxies in the early universe: https://go.nasa.gov/3CdLq0s\n\nHere are the highlights ",
    "Dragon flies! \n@SpaceX\n's #CRS28 cargo launch lifted off from \n@NASAKennedy\n at 11:47am ET (1547 UTC). Learn more about the \n@ISS_Research\n it's sending to space: http://go.nasa.gov/43dcbOt",
    "LIVE: We're sending science—and a new set of unrolling solar arrays—to the \n@Space_Station\n!\n\n\n@SpaceX\n's uncrewed #CRS28 mission is scheduled to launch at 11:47am ET (1547 UTC), weather permitting. Watch with us.",
    "This month and every month, we recognize the achievements and contributions of our Asian American, Native Hawaiian, and Pacific Islander workforce.\n\nCheck out the gallery and celebrate #AANHPIHeritageMonth with us: https://go.nasa.gov/3MHtxf9",
    "NOW: An audio-only media briefing following today's public discussion on unidentified anomalous phenomena, or UAPs.",
    "Stay tuned: Our UAP study panelists are taking a brief break. Check the agenda for the upcoming topics and timeline: http://go.nasa.gov/3MFpP5T",
    "Join us and \n@LibraryCongress\n as U.S. Poet Laureate Ada Limón reveals her poem for the \n@EuropaClipper\n mission. The poem will be engraved on the spacecraft, and travel 1.8 billion miles (2.89 billion kilometers) to an icy moon of Jupiter. \n\nTune in: https://bit.ly/42eJZJO",
    "I just reached a milestone only surpassed by Opportunity: 30 km on Mars   \n\nI've explored so much in my 10-plus-year trek through Gale Crater, but there are many more rocks to sample and analyze! Retrace my tracks with this interactive map: http://go.nasa.gov/3EtmSCi",
    "The diversity of our NASA team is what brings different perspectives to our missions, and we celebrate and share their stories. To protect our people from personal attacks, we have decided to limit comments on this post.",
    "NOW: We're holding a public meeting of our independent study team for categorizing and evaluating data of unidentified anomalous phenomena, or UAP. More info on today's meeting: https://go.nasa.gov/3nVqp7g",
    "Welcome back to Earth! It's been an incredible journey for the all-private astronaut crew of #Ax2. They've conducted vital scientific experiments and brought the wonders of space closer to us all. Congratulations to \n@SpaceX\n and \n@Axiom_Space\n for another successful mission!",
    "Snacks? Go. Science? Go. Ready to soak up some rays? Go. It's not NASA beach day—we're targeting June 3 to launch the next \n@SpaceX\n cargo mission to the \n@Space_Station\n. It carries new station solar arrays.\n\nHow to watch #CRS28, from pre-launch to liftoff: https://go.nasa.gov/3MGzPMi",
    "A team of astrophysicists and citizen scientists have identified what may be some of the final planets NASA’s retired Kepler observed during its nearly decade-long mission. They were found in the last data obtained as the telescope was running out of fuel. https://go.nasa.gov/3MEFSkw"
]