[
    "NOW: Get the latest status update on the all-private #Ax2 mission, set to lift off on Sunday, May 21 at 5:37pm ET (2137 UTC) from \n@NASAKennedy\n. https://youtube.com/watch?v=63TWnnZhePo…",
    "LAUNCH UPDATE \nDue to weather, \n@RocketLab\n and \n@NASA\n are now targeting 1 am EDT Tues, 23 May (5 pm NZST) for the final TROPICS launch. Two #CubeSats are set to join a constellation to improve forecasting of typhoons and hurricanes. For updates https://blogs.nasa.gov/smallsatellites/…",
    "The \n@NASAArtemis\n II astronauts visit Washington, \n@BlueOrigin\n is selected to develop the landing system that will take astronauts to and from the surface of the Moon on #Artemis V, and \n@NASARoman\n takes shape.\n\nSubscribe for all this and more: http://nasa.gov/subscribe",
    "LIVE: We're announcing the Phase 2 winners for our \n@NASAPrize\n Deep Space Food Challenge, a global competition to develop sustainable ways of producing healthy food for long-term missions to the Moon, Mars, and beyond.\n\nWatch with us at #NYCxDESIGN:",
    "Two storm-observing TROPICS small satellites lifted off on a \n@RocketLab\n Electron rocket, with two more to follow this month. This marks the first completed launch for a \n@NASA_LSP\n contract designed to increase access to space for science and tech missions. https://go.nasa.gov/44QozFo",
    "Two TROPICS CubeSats successfully deployed from a \n@RocketLab\n Electron rocket after launch. Signal acquisition from the pair of \n@NASAEarth\n small satellites may take some time to establish, which is not unexpected.\n\nWe'll provide confirmation when signal is acquired:… Show more",
    "We have final engine cutoff of \n@RocketLab\n's Curie engine on #RocketLikeAHurricane carrying two TROPICS CubeSats.  \n\nExpected Payload Deployment!   \n\nIt will take several orbits to confirm signal. Follow along for more mission updates! http://blogs.nasa.gov/smallsatellites/…",
    "Liftoff! Two TROPICS shoebox-sized satellites are on their way to join the fleet of \n@NASAEarth\n missions studying our home planet. Together, TROPICS will have the potential to gather near-hourly data on the formation and development of tropical cyclones.",
    "LIVE: Watch two small satellites for our storm tracking TROPICS mission launch to orbit. Liftoff on a \n@RocketLab\n Electron rocket is targeted at 9pm ET (0100 UTC May 8), with a two-hour window.",
    "NASA and \n@RocketLab\n are targeting 9pm ET Sunday, May 7 (0100 May 8 UTC), for the first launch of our cyclone-studying TROPICS CubeSats.\n\nTune in here and at http://nasa.gov/live at 8:40pm ET (0040 May 8 UTC) for live launch coverage from New Zealand: https://go.nasa.gov/42xYE3n",
    "A new habitat is prepped for volunteers to test living in Mars-like conditions for a year, \n@NASAWebb\n detects signs of water vapor on a distant planet, and we celebrate #BlackHoleWeek—that’s what’s up This Week at NASA. \n\nWrap up the celebration with us: https://go.nasa.gov/44B3u1j",
    "Live Now: The #Crew6 astronauts are relocating their \n@SpaceX\n Dragon spacecraft to a new docking port on the \n@Space_Station\n ahead of a cargo resupply mission. Undocking is scheduled for 7:10am ET (1110 UTC), with redocking targeted for 7:53am (1153 UTC).",
    "Today we mourn the passing of Samuel Durrance, an astronomer who flew aboard two \n@NASA\n Space Shuttle missions as a payload specialist and operated a collection of four telescopes as part of the Astro-1 and Astro-2 Spacelabs. Godspeed, Samuel.",
    "Two storm-observing TROPICS small satellites lifted off on a @RocketLab Electron rocket, with two more to follow this month. This marks the first completed launch for a @NASA_LSP contract designed to increase access to space for science and tech missions. https://go.nasa.gov/44QozFo",
    "Two TROPICS CubeSats successfully deployed from a @RocketLab Electron rocket after launch. Signal acquisition from the pair of @NASAEarth small satellites may take some time to establish, which is not unexpected.\n\nWe'll provide confirmation when signal is acquired:… Show more",
    "We have final engine cutoff of @RocketLab's Curie engine on #RocketLikeAHurricane carrying two TROPICS CubeSats.  \n\nExpected Payload Deployment!   \n\nIt will take several orbits to confirm signal. Follow along for more mission updates! http://blogs.nasa.gov/smallsatellites/…",
    "Liftoff! Two TROPICS shoebox-sized satellites are on their way to join the fleet of @NASAEarth missions studying our home planet. Together, TROPICS will have the potential to gather near-hourly data on the formation and development of tropical cyclones.",
    "LIVE: Watch two small satellites for our storm tracking TROPICS mission launch to orbit. Liftoff on a @RocketLab Electron rocket is targeted at 9pm ET (0100 UTC May 8), with a two-hour window.",
    "NASA and @RocketLab are targeting 9pm ET Sunday, May 7 (0100 May 8 UTC), for the first launch of our cyclone-studying TROPICS CubeSats.\n\nTune in here and at http://nasa.gov/live at 8:40pm ET (0040 May 8 UTC) for live launch coverage from New Zealand: https://go.nasa.gov/42xYE3n",
    "A new habitat is prepped for volunteers to test living in Mars-like conditions for a year, @NASAWebb detects signs of water vapor on a distant planet, and we celebrate #BlackHoleWeek—that’s what’s up This Week at NASA. \n\nWrap up the celebration with us: https://go.nasa.gov/44B3u1j",
    "Live Now: The #Crew6 astronauts are relocating their @SpaceX Dragon spacecraft to a new docking port on the @Space_Station ahead of a cargo resupply mission. Undocking is scheduled for 7:10am ET (1110 UTC), with redocking targeted for 7:53am (1153 UTC).",
    "Today we mourn the passing of Samuel Durrance, an astronomer who flew aboard two @NASA Space Shuttle missions as a payload specialist and operated a collection of four telescopes as part of the Astro-1 and Astro-2 Spacelabs. Godspeed, Samuel.",
    "Today, \n@VP\n and \n@President_KR\n toured \n@NASAGoddard\n for a close-up look at how we study our changing planet—and got a glimpse of \n@NASARoman\n, our next space telescope, as it's being built: https://go.nasa.gov/3mXIRf3",
    "Not too hot, not too cold.\n\nNo, not April 25. It's what \n@NASAExoplanets\n scientists call the habitable zone of a star—the range where liquid water could exist on a planet's surface: https://go.nasa.gov/41FqY3w",
    " LIVE: \n@VP\n Kamala Harris & \n@President_KR\n Yoon Suk Yeol deliver remarks during their tour of \n@NASAGoddard\n to see our climate change research.",
    "People travel to national parks every year to be surrounded by the beauty of nature. #NationalParkWeek\n\nNational parks seen from space are just as beautiful. Maybe more? \n\nYou be the judge. https://go.nasa.gov/4449VtO",
    "What's your favorite \n@NASAHubble\n image? http://bit.ly/3NauIG3\n\nLaunched 33 years ago today, the orbiting telescope captured this image of a nebula where stars are born -- 960 light-years away. http://go.nasa.gov/3VizSlr",
    "On April 25, \n@VP\n Kamala Harris & \n@President_KR\n Yoon Suk Yeol will tour \n@NASAGoddard\n and meet with scientists to see firsthand climate change research underway. They will also take an early look at \n@NASARoman\n, our next space telescope. https://go.nasa.gov/3Nbslmm",
    "LIVE: Preview the next spacewalk set for Friday, April 28. Veteran astronaut Steve Bowen and first-time spacewalker \n@Astro_Alneyadi\n will prepare the \n@Space_Station\n for solar power upgrades.",
    "NOW: \n@NASAEarth\n and \n@CenterForAstro\n scientists are answering questions on Reddit about TEMPO, a new space-based instrument that will revolutionize our understanding of air quality.\n \nWant to learn more? Ask your own Qs on our AMA."
]