[
    "AKA, don’t pull out. \n@elonmusk",
    " Untamed Free Speech FTW ",
    "@GovRonDeSantis\n announced he’s running for president on Twitter. This was by far the biggest room ever held on social media. Twitter performed great after some initial scaling challenges. Thanks Twitter Team for adapting so quickly to make history!",
    "All Presidential candidates are most welcome on this platform",
    "Spaces with \n@RonDeSantis\n in ~2 hours!",
    "Twitter is the town square of the people",
    "BREAKING: \n@FoxNews\n confirms Florida Governor \n@RonDeSantis\n will announce his 2024 Presidential run tomorrow night, 6pm ET in a Twitter Spaces interview with \n@elonmusk\n.",
    "I recommend subscribing to \n@shellenberger",
    "Starlink on Siargao Island in the Philippines  \n\n: \n@buddhasiargao",
    "",
    "I hope this platform increasingly brings you joy & elucidation",
    "Falcon 9 and Dragon vertical at 39A; targeting Sunday, May 21 at 5:37 p.m. ET for launch of Ax-2 → http://spacex.com/launches/mission/?missionId=ax-2…",
    "Over one-third of secondary schools and two-thirds of primary schools around the world are not connected to the internet.\n\nOn the isolated island of Pangan-an in the Philippines, Starlink was set up to support 700+ elementary and high school students → http://sunstar.com.ph/article/1961567/cebu/local-news/satellite-connects-isolated-cebu-island-to-the-internet…… Show more",
    "Walter is incredibly thorough in his research. Highly recommend his other books!",
    "Happens a lot",
    "Was the Internet Archive manipulated for nepotistic reasons?",
    "You asked (loudly), we listened.\n\nWe’ve reduced the signup flow for creators from 27 steps to just 4.\n\nIt’s never been easier to earn a living on Twitter. Tap on “Monetization” in settings to apply today.",
    "One-third of humanity remains offline, and many users only have basic connectivity.\n\nThe Ministry of Education in El Salvador—among many others around the world—is installing Starlink in schools to help close the digital divide ",
    "I am excited to welcome Linda Yaccarino as the new CEO of Twitter!\n\n\n@LindaYacc\n will focus primarily on business operations, while I focus on product design & new technology.\n\nLooking forward to working with Linda to transform this platform into X, the everything app.",
    "Governments worldwide claim that \"hate incidents\" are rising, but they're not. Tolerance of racial, sexual, and religious minorities has never been higher. Elites are manufacturing a fake \"hate\" crisis as a pretext for mass spying, blacklists, and censorship.",
    "Interesting article. Perhaps \n@CommunityNotes\n can add further context & corrections.",
    "For my part, I just want to support content creators, whether or not they provide extra content when you subscribe",
    "Your support of content creators on this platform is very much appreciated.\n\nWe keep none of the subscription revenue for the first 12 months & only 10% thereafter.",
    "Increasing lithium refining capacity is critical to a sustainable energy economy—today, we're breaking ground on our in-house lithium refinery outside of Corpus Christi, TX. \n\nThis facility will also prioritize the elimination of a challenging refinery byproduct (sodium sulfate).… Show more",
    "Tesla Lithium Groundbreaking Ceremony",
    "Livestream starting soon",
    "Assume you’re always being manipulated",
    "In the time it takes you to read this tweet, the expansion of the universe will carry this gorgeous spiral galaxy, called NGC 3147, another 31,000 miles away from us. That’s about four Earth diameters. #MondayMotivation",
    "Fairing reentry on the ViaSat-3 mission was the hottest and fastest we've ever attempted.  The fairings re-entered the atmosphere greater than 15x the speed of sound, creating a large trail of plasma in its wake",
    "Sorry our video upload is so bad! We’re working on major improvements. \n\nI recommend 480p for video longer than 10 mins, as that resolution is fine for phone/laptop users."
]