[
    "\"Congratulations on an outstanding mission.\"\n\nThe crew of the \n@Space_Station\n shared their thanks and farewells after Axiom Mission 2 undocked from the orbiting lab at 11:05am ET (1505 UTC). #Ax2 is scheduled to splash down off the coast of Florida tonight: https://go.nasa.gov/3MK1kUW",
    "LIVE: The Axiom Mission 2 crew is heading home in \n@SpaceX\n's Dragon Freedom spacecraft after wrapping up the second all-private astronaut mission to the \n@Space_Station\n. #Ax2 undocking is scheduled for 11:05am ET (1505 UTC).",
    "LIVE: After more than a week of science, outreach, and on-orbit activities, the all-private astronaut crew of #Ax2 is boarding their \n@SpaceX\n Dragon Freedom spacecraft to return to Earth. Hatch closure is scheduled for 9:10am ET (1310 UTC): http://nasa.gov/live",
    "Ad astra per aspera \n\nJoin us this #MemorialDay in remembering and honoring all those who made the ultimate sacrifice in service to our country.",
    "\"Congratulations on an outstanding mission.\"\n\nThe crew of the @Space_Station shared their thanks and farewells after Axiom Mission 2 undocked from the orbiting lab at 11:05am ET (1505 UTC). #Ax2 is scheduled to splash down off the coast of Florida tonight: https://go.nasa.gov/3MK1kUW",
    "LIVE: The Axiom Mission 2 crew is heading home in @SpaceX's Dragon Freedom spacecraft after wrapping up the second all-private astronaut mission to the @Space_Station. #Ax2 undocking is scheduled for 11:05am ET (1505 UTC).",
    "LIVE: After more than a week of science, outreach, and on-orbit activities, the all-private astronaut crew of #Ax2 is boarding their @SpaceX Dragon Freedom spacecraft to return to Earth. Hatch closure is scheduled for 9:10am ET (1310 UTC): http://nasa.gov/live",
    "NASA and \n@RocketLab\n are targeting 9pm ET Sunday, May 7 (0100 May 8 UTC), for the first launch of our cyclone-studying TROPICS CubeSats.\n\nTune in here and at http://nasa.gov/live at 8:40pm ET (0040 May 8 UTC) for live launch coverage from New Zealand: https://go.nasa.gov/42xYE3n",
    "A new habitat is prepped for volunteers to test living in Mars-like conditions for a year, \n@NASAWebb\n detects signs of water vapor on a distant planet, and we celebrate #BlackHoleWeek—that’s what’s up This Week at NASA. \n\nWrap up the celebration with us: https://go.nasa.gov/44B3u1j",
    "Live Now: The #Crew6 astronauts are relocating their \n@SpaceX\n Dragon spacecraft to a new docking port on the \n@Space_Station\n ahead of a cargo resupply mission. Undocking is scheduled for 7:10am ET (1110 UTC), with redocking targeted for 7:53am (1153 UTC).",
    "We have final engine cutoff of @RocketLab's Curie engine on #RocketLikeAHurricane carrying two TROPICS CubeSats.  \n\nExpected Payload Deployment!   \n\nIt will take several orbits to confirm signal. Follow along for more mission updates! http://blogs.nasa.gov/smallsatellites/…",
    "Liftoff! Two TROPICS shoebox-sized satellites are on their way to join the fleet of @NASAEarth missions studying our home planet. Together, TROPICS will have the potential to gather near-hourly data on the formation and development of tropical cyclones.",
    "LIVE: Watch two small satellites for our storm tracking TROPICS mission launch to orbit. Liftoff on a @RocketLab Electron rocket is targeted at 9pm ET (0100 UTC May 8), with a two-hour window.",
    "NASA and @RocketLab are targeting 9pm ET Sunday, May 7 (0100 May 8 UTC), for the first launch of our cyclone-studying TROPICS CubeSats.\n\nTune in here and at http://nasa.gov/live at 8:40pm ET (0040 May 8 UTC) for live launch coverage from New Zealand: https://go.nasa.gov/42xYE3n",
    "A new habitat is prepped for volunteers to test living in Mars-like conditions for a year, @NASAWebb detects signs of water vapor on a distant planet, and we celebrate #BlackHoleWeek—that’s what’s up This Week at NASA. \n\nWrap up the celebration with us: https://go.nasa.gov/44B3u1j",
    "Live Now: The #Crew6 astronauts are relocating their @SpaceX Dragon spacecraft to a new docking port on the @Space_Station ahead of a cargo resupply mission. Undocking is scheduled for 7:10am ET (1110 UTC), with redocking targeted for 7:53am (1153 UTC).",
    "Today we mourn the passing of Samuel Durrance, an astronomer who flew aboard two @NASA Space Shuttle missions as a payload specialist and operated a collection of four telescopes as part of the Astro-1 and Astro-2 Spacelabs. Godspeed, Samuel.",
    "Join us tomorrow from the @Space_Station!\n\nWith #Crew6 aboard, @SpaceX's Dragon Endeavour spacecraft is undocking and moving to a new port to make room for an upcoming cargo launch. Watch here and at http://nasa.gov/live starting at 7am ET (1100 UTC) on Saturday, May 6.",
    "@WomenNASA Liz Landau, host and science communicator\n\n@ChandraXray Daryl Haggard, astrophysicist\n\n@NASAJPL Michele Vallisneri, theoretical physicist\n\n@NASAUniverse Regina Caputo, astrophysicist",
    "People travel to national parks every year to be surrounded by the beauty of nature. #NationalParkWeek\n\nNational parks seen from space are just as beautiful. Maybe more? \n\nYou be the judge. https://go.nasa.gov/4449VtO",
    "What's your favorite \n@NASAHubble\n image? http://bit.ly/3NauIG3\n\nLaunched 33 years ago today, the orbiting telescope captured this image of a nebula where stars are born -- 960 light-years away. http://go.nasa.gov/3VizSlr",
    "On April 25, \n@VP\n Kamala Harris & \n@President_KR\n Yoon Suk Yeol will tour \n@NASAGoddard\n and meet with scientists to see firsthand climate change research underway. They will also take an early look at \n@NASARoman\n, our next space telescope. https://go.nasa.gov/3Nbslmm",
    "LIVE: Preview the next spacewalk set for Friday, April 28. Veteran astronaut Steve Bowen and first-time spacewalker \n@Astro_Alneyadi\n will prepare the \n@Space_Station\n for solar power upgrades.",
    "NOW: \n@NASAEarth\n and \n@CenterForAstro\n scientists are answering questions on Reddit about TEMPO, a new space-based instrument that will revolutionize our understanding of air quality.\n \nWant to learn more? Ask your own Qs on our AMA.",
    "Earth is our home. \n\nOn #EarthDay and every day, we’re learning more about our world and how it’s changing – giving us a deeper appreciation for the planet we call home.\n\nCelebrate with us: https://go.nasa.gov/3mZmeXx",
    "Wow! Look at all this love for Earth!  While you’re here, check out how we study Earth every day at \n@nasa\n.",
    "This week at NASA, we marked the Ingenuity #MarsHelicopter's 50th flight on the Red Planet, the planet-hunting satellite TESS entered its fifth year, and we celebrated our favorite planet—Earth!\n\nCelebrate #EarthDay with us: https://go.nasa.gov/40AeM2G",
    "What's your favorite @NASAHubble image? http://bit.ly/3NauIG3\n\nLaunched 33 years ago today, the orbiting telescope captured this image of a nebula where stars are born -- 960 light-years away. http://go.nasa.gov/3VizSlr",
    "On April 25, @VP Kamala Harris & @President_KR Yoon Suk Yeol will tour @NASAGoddard and meet with scientists to see firsthand climate change research underway. They will also take an early look at @NASARoman, our next space telescope. https://go.nasa.gov/3Nbslmm",
    "LIVE: Preview the next spacewalk set for Friday, April 28. Veteran astronaut Steve Bowen and first-time spacewalker @Astro_Alneyadi will prepare the @Space_Station for solar power upgrades."
]