[
    "I think we win this one. Happy #NationalSelfieDay ",
    "We've reaffirmed our shared commitment with the \n@USDA\n to benefit people everywhere. Our continued collaboration aims to address climate challenges and bolster plant-based research on the \n@Space_Station\n that could help improve food security on Earth. https://go.nasa.gov/3qXbYAN",
    "U.S. and international media: You are invited to \n@NASAKennedy\n to interview subject matter experts and view the \n@NASA_Orion\n spacecraft slated for the next three #Artemis missions.\n \nFor more information, including deadlines and how to apply, click here: http://go.nasa.gov/42Lm58M",
    "\"I try to be visible, to show folks who may still be in the closet that one can live their authentic life and be a part of something so amazing.\" Celebrate #Pride and read the story of Amy Lendian, a systems engineering supervisor at \n@NASAKennedy\n. https://go.nasa.gov/3NfJcCU",
    "Steve Bowen, 10-time spacewalker.  ",
    "@Astro_Kobi\n asked a \n@NASASolarSystem\n scientist some of the biggest questions about the universe.\n\nHere’s 3 cosmic facts you might not know…\n\n“Great Observatories Unique Views of the Milky Way”\nNASA/JPL-Caltech/ESA/CXC/STScI\n2009\n\n@NASA\n\n#UnpackItNASA",
    "Enceladus, Saturn's icy moon, is known for its geysers that erupt with water from a subsurface ocean. \n\nScientists have just detected phosphorus—an uncommon element that's a key building block for life—in the plumes that these geysers spray: https://go.nasa.gov/43FVtY1",
    "Another spacewalk in the books! \n\nToday’s spacewalk concluded at 2:17pm ET (1817 UTC) and lasted 5 hours and 35 minutes. Steve Bowen and \n@Astro_Woody\n installed a new roll-out solar array and completed numerous additional tasks outside the \n@Space_Station\n.",
    "Watch the \n@Space_Station\n's new roll-out solar array begin to unfurl in a process that takes about 12 minutes to complete. This is the helmet camera view from astronaut Steve Bowen:",
    "Spacewalkers Steve Bowen and \n@Astro_Woody\n have successfully installed the roll-out solar array and released hinge bolts. The duo will move on to work-ahead tasks as they wait for the next eclipse to unfold the solar array. Watch live... http://nasa.gov/live",
    "Astronauts-eye view \n\nTake a look through the helmet cams of \n@Astro_Woody\n and Steve Bowen as they prepare to install a roll-out solar array during today's spacewalk.",
    "JUST ANNOUNCED @ #AIAAaviation: We've got an X designation for the Sustainable Flight Demonstrator!\n\nIntroducing, X-66A \n\nThe new X-plane seeks to inform a potential new gen of more sustainable single-aisle aircraft-the workhorse of passenger airlines. https://nasa.gov/press-release/next-generation-experimental-aircraft-becomes-nasa-s-newest-x-plane/…",
    "How do places on Mars get their name? \n\nMore than 2,000 locations on the Red Planet have official names, recognizing places on Earth, explorers, and even cartoon characters. Learn what inspires names for Martian hills, craters, and rocks: https://go.nasa.gov/3CmCYMm",
    "Later this month, we're opening the Earth Information Center—a hybrid exhibit that offers an interactive look at our changing planet.\n\nMedia are invited to a ribbon-cutting ceremony on Wednesday, June 21, at NASA Headquarters in Washington: https://go.nasa.gov/43STHT7",
    "Congrats to \n@SpaceX\n on the impressive milestones in spaceflight! \n\nThe space shuttle was a workhorse for \n@NASA\n helping build \n@Space_Station\n, & now crew and cargo Dragons are helping support long-duration missions aboard humanity’s home in space. NASA’s investment in commercial… Show more",
    "How do we know what Earth's climate was like long ago? If you look closely, there are clues just about everywhere across our globe. Some are easy to see and others are more subtle. \n@NASAClimate\n scientist Dr. Gavin Schmidt explains.\n\nWant even more?: http://go.nasa.gov/3NihKpm",
    "What does it take to get ready for a spacewalk?\n\nHere's a behind-the-scenes look with \n@Astro_Woody\n, who will make his first trip outside the \n@Space_Station\n on Friday, June 9:",
    "Large amounts of smoke have been pouring into the eastern U.S. from fires in Quebec. The wildfire smoke is degrading the quality of surface-level air that tens of millions of people breathe.\n\nSeveral NASA satellites are collecting data on the plumes: https://go.nasa.gov/3p1pPFk",
    "Our Artifacts program is open! Eligible institutions can apply to receive historic NASA artifacts to use in STEM education. Create an account and search for items including shuttle tiles, science instruments and spacecraft models like this @NASA_SLS model: https://go.nasa.gov/3MXGvpc",
    "Congrats to @SpaceX on the impressive milestones in spaceflight! \n\nThe space shuttle was a workhorse for @NASA helping build @Space_Station, & now crew and cargo Dragons are helping support long-duration missions aboard humanity’s home in space. NASA’s investment in commercial… Show more",
    "How do we know what Earth's climate was like long ago? If you look closely, there are clues just about everywhere across our globe. Some are easy to see and others are more subtle. @NASAClimate scientist Dr. Gavin Schmidt explains.\n\nWant even more?: http://go.nasa.gov/3NihKpm",
    "What does it take to get ready for a spacewalk?\n\nHere's a behind-the-scenes look with @Astro_Woody, who will make his first trip outside the @Space_Station on Friday, June 9:",
    "\"'NASA for all.' That's something that I think is really important because we are the universe, right? We are made of star stuff.\"\n\nCelebrate #Pride and learn how Rebecca Sirmons helps tell the story of the universe as NASA TV's executive producer: http://go.nasa.gov/3IVxzj7",
    "Peer pressure.\n\n@NASAHubble spots a galaxy about 50 million light-years away that holds some surprises: Two nearby galaxies are influencing it and it may or may not have a supermassive black hole at its center. http://go.nasa.gov/45It84O",
    "Ad astra per aspera \n\nJoin us this #MemorialDay in remembering and honoring all those who made the ultimate sacrifice in service to our country.",
    "After just over a week in space, \n@Axiom_Space\n's #Ax2 astronauts are set to return to Earth on Tuesday, May 30. Here’s how to watch live coverage, from closing of the hatches to splashdown: https://go.nasa.gov/43vWzp6",
    "Two \n@NASA_Astronauts\n will do a pair of spacewalks on June 9 and June 15 to install new solar arrays on the \n@Space_Station\n. We’ll stream them live.\n \nJoin us for a preview on June 1: https://go.nasa.gov/3MGCCFj",
    "LIVE: After more than a week of science, outreach, and on-orbit activities, the all-private astronaut crew of #Ax2 is boarding their \n@SpaceX\n Dragon Freedom spacecraft to return to Earth. Hatch closure is scheduled for 9:10am ET (1310 UTC): http://nasa.gov/live",
    "We completed a joint checkpoint review with \n@BoeingSpace\n ahead of the first #Starliner flight to carry astronauts, set for no earlier than July 21. Teams will provide updates leading up to the inaugural Crew Flight Test to and from the \n@Space_Station\n: https://go.nasa.gov/3MZR1xG",
    "Hot new bombshells enter the villa.\n\nOtherwise invisible to the unaided eye, infrared data from \n@NASAWebb\n and x-ray data from \n@ChandraXray\n make details in these proper fit cosmic wonders available by mapping the data to colors that humans can perceive:\nhttps://go.nasa.gov/43wTsx9"
]