[
    "Interview with \n@BillMaher",
    "Extremely destructive if accurate",
    "Explaining Constitutional Amendments",
    "If AGI is almost here, why doesn’t autocorrekt work!?",
    "Raptor V3 just achieved 350 bar chamber pressure (269 tons of thrust). Congrats to \n@SpaceX\n propulsion team!\n\nStarship Super Heavy Booster has 33 Raptors, so total thrust of 8877 tons or 19.5 million pounds.",
    "Interview with @BillMaher",
    "Raptor V3 just achieved 350 bar chamber pressure (269 tons of thrust). Congrats to @SpaceX propulsion team!\n\nStarship Super Heavy Booster has 33 Raptors, so total thrust of 8877 tons or 19.5 million pounds.",
    "Falcon Heavy long exposure looks like 3 laser beams from space",
    "¡Notas de la Comunidad sigue creciendo! Bienvenidos a los contribuyentes de Argentina, Chile, Colombia, Ecuador, Guatemala, Perú y Venezuela\n\n",
    "May the 4th be with you ",
    "When you walk on to a plane with Starlink, the internet just works – it's that simple",
    "NASA Spaces about space!",
    "Model S Plaid track pack coming soon",
    "Falcon 9’s first stage has landed on the A Shortfall of Gravitas droneship",
    "Watch Falcon 9 launch 56 Starlink satellites to orbit → http://spacex.com/launches/",
    "Major software upgrades underway across the board. \n\nEncrypted DMs & other DM upgrades rolling out this week.",
    "Support content creators around the world in near & far away places!\n\nFor many this represents a vital source of income & enables them to put more time into creating great content for you.",
    "I propose the lmfao test for AI",
    "Falcon Heavy is green for launch",
    "About to do Falcon Heavy risk review. I love that rocket, but it’s scary. So many state changes post liftoff.",
    "On \n@billmaher\n show tonight",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "Liftoff!",
    "Two Falcons on two SpaceX pads in Florida. If the weather cooperates, launch windows open 2+ hours apart for these two missions → http://spacex.com/launches",
    "Note, it takes a few days longer for subscriptions to go active on iPhone vs web, as all subscriptions currently have to be approved by Apple",
    "check mate",
    "Every vehicle we sell, battery we install & solar panel we add moves the needle in the direction of a sustainable future.\n\nThank you to the Tesla team, customers & supporters for bringing us closer to our goal!\n\nHappy Earth Day ",
    "Starship liftoff in slow motion",
    "Creators can now sign up and earn a living directly on Twitter in the EU, UK, and EEA.\n\nTap on “Monetization” in settings to apply today.\n\nFor a full list of available countries see our Help Center:",
    "More Community Notes! Today’s new algorithm update boosts the number of Helpful notes by 10%+. It builds on last week’s change that uses confidence scores to identify notes that are broadly found helpful with high precision. https://communitynotes.twitter.com/guide/en/under-the-hood/ranking-notes#modeling-uncertainty…"
]