[
    "After just over a week in space, \n@Axiom_Space\n's #Ax2 astronauts are set to return to Earth on Tuesday, May 30. Here’s how to watch live coverage, from closing of the hatches to splashdown: https://go.nasa.gov/43vWzp6",
    "Two \n@NASA_Astronauts\n will do a pair of spacewalks on June 9 and June 15 to install new solar arrays on the \n@Space_Station\n. We’ll stream them live.\n \nJoin us for a preview on June 1: https://go.nasa.gov/3MGCCFj",
    "After just over a week in space, @Axiom_Space's #Ax2 astronauts are set to return to Earth on Tuesday, May 30. Here’s how to watch live coverage, from closing of the hatches to splashdown: https://go.nasa.gov/43vWzp6",
    "Two @NASA_Astronauts will do a pair of spacewalks on June 9 and June 15 to install new solar arrays on the @Space_Station. We’ll stream them live.\n \nJoin us for a preview on June 1: https://go.nasa.gov/3MGCCFj",
    "We completed a joint checkpoint review with @BoeingSpace ahead of the first #Starliner flight to carry astronauts, set for no earlier than July 21. Teams will provide updates leading up to the inaugural Crew Flight Test to and from the @Space_Station: https://go.nasa.gov/3MZR1xG",
    "Hot new bombshells enter the villa.\n\nOtherwise invisible to the unaided eye, infrared data from @NASAWebb and x-ray data from @ChandraXray make details in these proper fit cosmic wonders available by mapping the data to colors that humans can perceive:\nhttps://go.nasa.gov/43wTsx9",
    "Join us tomorrow from the \n@Space_Station\n!\n\nWith #Crew6 aboard, \n@SpaceX\n's Dragon Endeavour spacecraft is undocking and moving to a new port to make room for an upcoming cargo launch. Watch here and at http://nasa.gov/live starting at 7am ET (1100 UTC) on Saturday, May 6.",
    "@WomenNASA\n Liz Landau, host and science communicator\n\n\n@ChandraXray\n Daryl Haggard, astrophysicist\n\n\n@NASAJPL\n Michele Vallisneri, theoretical physicist\n\n\n@NASAUniverse\n Regina Caputo, astrophysicist",
    "Live Now: The #Crew6 astronauts are relocating their \n@SpaceX\n Dragon spacecraft to a new docking port on the \n@Space_Station\n ahead of a cargo resupply mission. Undocking is scheduled for 7:10am ET (1110 UTC), with redocking targeted for 7:53am (1153 UTC).",
    "Today we mourn the passing of Samuel Durrance, an astronomer who flew aboard two \n@NASA\n Space Shuttle missions as a payload specialist and operated a collection of four telescopes as part of the Astro-1 and Astro-2 Spacelabs. Godspeed, Samuel.",
    "We can’t imagine a more beautiful thing than May’s full moon – the Corn Moon. \n\nSet to peak on May 5 at 1:34pm ET (1634 UTC ), this full moon, also known as the Flower Moon, will appear full till Sunday. Discover how it got its names: http://go.nasa.gov/3piIAUs",
    "Four of Uranus’ largest moons—Ariel, Umbriel, Titania, and Oberon—may have oceans beneath their icy crusts, according to a re-analysis of Voyager 2 data. https://go.nasa.gov/3VQtF0l",
    "It’s a TRAP(PIST)-1! \n\nAbout 40 light-years away lies a planetary system with the most Earth-sized exoplanets found in a star's habitable zone. Learn more about the TRAPPIST-1 system that was recently studied by \n@NASAWebb\n: http://go.nasa.gov/415DmsC\n\n#MayTheFourth",
    "When we say “supermassive black holes,” just how do they measure up? \n\nUsing their shadows for size, we’ve rounded up 10 black holes and compared them to objects in our solar system. Don’t worry – these black holes are many light-years away: https://go.nasa.gov/3HIcDeW #BlackHoleWeek",
    "Earth is our home. \n\nOn #EarthDay and every day, we’re learning more about our world and how it’s changing – giving us a deeper appreciation for the planet we call home.\n\nCelebrate with us: https://go.nasa.gov/3mZmeXx",
    "Wow! Look at all this love for Earth!  While you’re here, check out how we study Earth every day at \n@nasa\n.",
    "This week at NASA, we marked the Ingenuity #MarsHelicopter's 50th flight on the Red Planet, the planet-hunting satellite TESS entered its fifth year, and we celebrated our favorite planet—Earth!\n\nCelebrate #EarthDay with us: https://go.nasa.gov/40AeM2G",
    "LIVE: Preview the next spacewalk set for Friday, April 28. Veteran astronaut Steve Bowen and first-time spacewalker \n@Astro_Alneyadi\n will prepare the \n@Space_Station\n for solar power upgrades.",
    "NOW: \n@NASAEarth\n and \n@CenterForAstro\n scientists are answering questions on Reddit about TEMPO, a new space-based instrument that will revolutionize our understanding of air quality.\n \nWant to learn more? Ask your own Qs on our AMA.",
    "Share if you love Earth.  #EarthDay",
    "Happy #EarthDay \n\nFrom the tallest peaks to ocean depths, from arid deserts to lush forests, we observe our home from a unique perspective. Learn about the activities all around NASA, and about the picture that kicked off this celebration of our planet: https://go.nasa.gov/41yzVvI",
    "Happy Earth Day from me and our good friends over at NASA.\n \nFor our children and grandchildren, we must stand united in our effort to save our only home.",
    "LIVE: Preview the next spacewalk set for Friday, April 28. Veteran astronaut Steve Bowen and first-time spacewalker @Astro_Alneyadi will prepare the @Space_Station for solar power upgrades.",
    "NOW: @NASAEarth and @CenterForAstro scientists are answering questions on Reddit about TEMPO, a new space-based instrument that will revolutionize our understanding of air quality.\n \nWant to learn more? Ask your own Qs on our AMA.",
    "Wow! Look at all this love for Earth!  While you’re here, check out how we study Earth every day at @nasa.",
    "One mission. Four astronauts. So many ways to watch the #Artemis II astronaut announcement.     The thread below tells you all the places you can find this historic event. We make history on Monday, April 3, starting at 11am ET (1500 UTC).",
    " Need more space in your inbox? Subscribe to our weekly newsletter for the latest stories from across the universe.\n\nSign up: http://nasa.gov/subscribe\n\n¡También en español! http://nasa.gov/suscribete",
    "A new \n@NASAEarth\n & \n@CenterForAstro\n mission preparing for launch will be the first to take hourly observations of air quality in North America. Data from #TEMPO will improve forecasts & reveal disparities in pollution exposure within cities and communities. https://go.nasa.gov/3K3Zhd4",
    "If you’re on \n@Facebook\n, you can hit “going” for our watch event to get notifications and updates: https://fb.me/e/2BZNQrYBt",
    "You can learn which astronauts will fly around the Moon while you chat on \n@Twitch\n:"
]