[
    "Interview with \n@BillMaher",
    "\"A lot of people still think Teslas are super expensive...but now we're at the point where the starting point of a Tesla is actually below the average selling price of a car in the United States,\" Elon Musk said Tuesday after Tesla's shareholder meeting. http://cnb.cx/42HSsWG",
    "Spaces interview with \n@davidfaber\n starting now",
    "Tesla shareholder meeting underway",
    "As more satellites & ground stations are added, latency & jitter will improve. Goal is <20ms latency.",
    "J. Robert Oppenheimer's grandson: \"We must get over our cognitive and political bias: Nuclear energy is necessary and safe, and not the same as nuclear weapons\"",
    "Verified organization is one of the most important additions to Twitter. \n@elonmusk",
    "Thanks Dave!",
    "With each launch of our first gen \n@Starlink\n satellites, we add over a Tbps of capacity to the constellation; allowing us to continue improving coverage and connecting more people around the world with high-speed internet from space",
    "Super easy to use Starlink out of the box, no professional installer needed!",
    "Starship is the largest, most capable rocket ever developed and will allow us to achieve a shared vision of a future where humanity is out exploring stars → http://youtube.com/spacex",
    "Early version of encrypted direct messages just launched.\n\nTry it, but don’t trust it yet.",
    "Falcon 9’s first stage has landed on the Of Course I Still Love You droneship",
    "Liftoff!",
    "Contributors’ time is valuable, and best spent reviewing high quality notes. Today we’re making the number of notes one can write in 24h proportional to their track record. The more helpful notes you’ve written, the more you can write. If you hit your limit, you’ll see this:",
    "With each launch of our first gen @Starlink satellites, we add over a Tbps of capacity to the constellation; allowing us to continue improving coverage and connecting more people around the world with high-speed internet from space",
    "Verified organization is one of the most important additions to Twitter. @elonmusk",
    "How it started:                                              How it's going:",
    "Even benign dependency on AI/Automation is dangerous to civilization if taken so far that we eventually forget how the machines work",
    "Worth reading The Machine Stops by EM Forster if you haven’t already\nhttps://cs.ucdavis.edu/~koehl/Teaching/ECS188/PDF_files/Machine_stops.pdf…",
    "Falcon Heavy",
    "Watch Falcon Heavy launch \n@ViasatInc\n’s ViaSat-3 Americas mission to orbit → http://spacex.com/launches",
    "T-1 hour until Falcon Heavy's launch of \n@ViasatInc\n’s ViaSat-3 Americas mission; weather is 95% favorable for liftoff at 8:26 p.m. ET → http://spacex.com/launches/mission/?missionId=ViaSat-3-Americas…",
    "Model Y AWD is the most efficient electric SUV ever built",
    "Your Tesla can automatically navigate to destinations based on your calendar",
    "Watch Falcon Heavy launch @ViasatInc’s ViaSat-3 Americas mission to orbit → http://spacex.com/launches",
    "T-1 hour until Falcon Heavy's launch of @ViasatInc’s ViaSat-3 Americas mission; weather is 95% favorable for liftoff at 8:26 p.m. ET → http://spacex.com/launches/mission/?missionId=ViaSat-3-Americas…",
    "Met with \n@SenSchumer\n and many members of Congress about artificial intelligence regulation today.\n\nThat which affects safety of the public has, over time, become regulated to ensure that companies do not cut corners. \n\nAI has great power to do good and evil. Better the former.",
    "Transparency is fundamental to everything we do at Twitter. As we review our approach to transparency reporting for the future, today we’re publishing our 21st report, with data on our policy enforcement for the first half of 2022. Read more here:",
    "Verified accounts are now prioritized"
]