[
    "Falcon 9’s first stage booster has landed on Landing Zone 1, a first for a human spaceflight mission",
    "Watch Falcon 9 launch Dragon and Ax-2 to the \n@space_station\n → http://spacex.com/launches/mission/?missionId=ax-2…",
    "Sharing another update on the changes we’ve made to our open source repos this week and a preview of what’s next ",
    "\"A lot of people still think Teslas are super expensive...but now we're at the point where the starting point of a Tesla is actually below the average selling price of a car in the United States,\" Elon Musk said Tuesday after Tesla's shareholder meeting. http://cnb.cx/42HSsWG",
    "Verified organization is one of the most important additions to Twitter. \n@elonmusk",
    "Thanks Dave!",
    "Starship is the largest, most capable rocket ever developed and will allow us to achieve a shared vision of a future where humanity is out exploring stars → http://youtube.com/spacex",
    "Early version of encrypted direct messages just launched.\n\nTry it, but don’t trust it yet.",
    "Falcon 9’s first stage has landed on the Of Course I Still Love You droneship",
    "Liftoff!",
    "Contributors’ time is valuable, and best spent reviewing high quality notes. Today we’re making the number of notes one can write in 24h proportional to their track record. The more helpful notes you’ve written, the more you can write. If you hit your limit, you’ll see this:",
    "S3XY vehicles  hot engineers \n\nOur field quality engineers head to Dubai at the hottest time of the year for extreme heat & durability testing—temperatures reach over 50°C",
    "Also, which kind of bat – fruit eating bat or insect eating bat ?",
    "“A new philosophy of the future is needed. I believe it should be curiosity about the Universe – expand humanity to become a multiplanet, then interstellar, species to see what’s out there.” \n@elonmusk",
    "",
    "Feeling nostalgic",
    "Dragon is go for docking",
    "Thank you to our 1.5M+ customers around the world! ",
    "Highly recommend that organizations sign up and validate their affiliates to prevent impersonation",
    "All systems and weather are looking good for tonight's Falcon Heavy launch of \n@ViasatInc\n's ViaSat-3 Americas mission → http://spacex.com/launches/mission/?missionId=ViaSat-3-Americas…",
    "Home",
    "Your Tesla can automatically navigate to destinations based on your calendar",
    "Rolling out next month, this platform will allow media publishers to charge users on a per article basis with one click.\n\nThis enables users who would not sign up for a monthly subscription to pay a higher per article price for when they want to read an occasional article.… Show more",
    "While other car manufacturers struggle with updates, Tesla continuously improves its fleet and features. With its latest update, AEB now works in reverse and up to 124 mph (200 km/h).",
    "Imagine the countless lives we could save if more people drove Teslas. With safety as a top priority, Tesla is leading the charge towards a safer future on our roads.",
    "Not all active safety systems are created equal. Even within the 5-star category, there can be considerable differences in the effectiveness of assistance systems like AEB.",
    "All proceeds go to content creators, we keep nothing",
    "Major software upgrades underway across the board. \n\nEncrypted DMs & other DM upgrades rolling out this week.",
    "Content creators may wish to enable subscriptions on this platform. \n\nJust tap on Monetization in settings.",
    "We live in the most interesting of times"
]