[
    "LIVE: Join NASA and \n@BoeingSpace\n officials as we share an update on the first #Starliner Crew Flight Test. Tune in.",
    " \n@NASA\n and \n@BoeingSpace\n will host a media teleconference at 5pm ET today for an update on Boeing's first crewed flight on the CST-100 Starliner to the \n@Space_Station\n.\n\nListen in: http://nasa.gov/live",
    "LIVE: Experts at \n@NASA_Johnson\n are discussing our upcoming spacewalks, scheduled for June 9 and June 15, to set up new solar arrays outside the \n@Space_Station\n.\n\nWe're taking questions from media and the public—share your spacewalk Qs with #AskNASA.",
    "Hurricane season in the Atlantic begins today. Our unique perspective from space allows us to study storms and their evolution, providing data to support forecasting and disaster responses: https://go.nasa.gov/3fYNZYE",
    "Join us and \n@LibraryCongress\n as U.S. Poet Laureate Ada Limón reveals her poem for the \n@EuropaClipper\n mission. The poem will be engraved on the spacecraft, and travel 1.8 billion miles (2.89 billion kilometers) to an icy moon of Jupiter. \n\nTune in: https://bit.ly/42eJZJO",
    "LIVE: Join NASA and @BoeingSpace officials as we share an update on the first #Starliner Crew Flight Test. Tune in.",
    " @NASA and @BoeingSpace will host a media teleconference at 5pm ET today for an update on Boeing's first crewed flight on the CST-100 Starliner to the @Space_Station.\n\nListen in: http://nasa.gov/live",
    "LIVE: Experts at @NASA_Johnson are discussing our upcoming spacewalks, scheduled for June 9 and June 15, to set up new solar arrays outside the @Space_Station.\n\nWe're taking questions from media and the public—share your spacewalk Qs with #AskNASA.",
    "Join us and @LibraryCongress as U.S. Poet Laureate Ada Limón reveals her poem for the @EuropaClipper mission. The poem will be engraved on the spacecraft, and travel 1.8 billion miles (2.89 billion kilometers) to an icy moon of Jupiter. \n\nTune in: https://bit.ly/42eJZJO",
    "This week was busy.\n\n\n@Space_Station\n crew members relocated their \n@SpaceX\n Dragon to a new docking port, \n@NASAWebb\n imaged a nearby star, and \n@RocketLab\n launched two small satellites to study hurricanes.\n\nSubscribe to our newsletter and get the full scoop: http://nasa.gov/subscribe",
    "For the first time, two \n@NASA\n super pressure balloons are in flight at the same time!\n\nThe two balloons launched from New Zealand with a primary goal of testing & qualifying the super pressure balloon tech for flight, while also flying science missions. https://go.nasa.gov/3pzfNvk",
    "We're holding a public meeting of our independent study team on unidentified anomalous phenomena (UAP) on Wednesday, May 31, at 10:30am ET (1430 UTC), with a media teleconference to follow. \n\nHow to watch: https://go.nasa.gov/42tSGAX\n\nSubmit your questions: https://go.nasa.gov/42uzK4J",
    "Over their eight days on the \n@Space_Station\n, the private astronauts of \n@Axiom_Space\n's Axiom Mission 2 will run activities from student outreach to scientific experiments.\n\n#Ax2 is set to lift off from \n@NASAKennedy\n on Sunday, May 21—here's how to watch: https://go.nasa.gov/41yAdlp",
    "14 years ago, \n@Astro_Mike\n wrote the first tweet from space. Since then, we’ve been sharing snippets of our life in orbit—and what it’s like to gaze upon our home planet.\n\nFollow along: http://nasa.gov/astronauts/biographies/active…",
    "LIVE: Cosmonauts are about to embark on a spacewalk to deploy and activate a radiator that will help cool the \n@Space_Station\n’s Nauka science module: http://nasa.gov/live",
    "New images from \n@NASAPersevere\n may show evidence of what was once a wild and deep river on Mars. The observations are leading scientists to rethink how ancient water once flowed on the Red Planet. https://go.nasa.gov/41tYxEP",
    "This \n@NASAWebb\n image of the Pillars of Creation helps astronomers determine how stars form. Plus, it makes pretty sweet digital wallpaper.\n\nDownload high-resolution images from https://webbtelescope.org.",
    "When the Relativity Space Terran 1 rocket lit up the night sky as it launched this past March, it became the first 3D-printed rocket test of its kind. Learn about GRCop—an innovative, high strength material at the center of this breakthrough: https://go.nasa.gov/44igKrA",
    "This week was busy.\n\n@Space_Station crew members relocated their @SpaceX Dragon to a new docking port, @NASAWebb imaged a nearby star, and @RocketLab launched two small satellites to study hurricanes.\n\nSubscribe to our newsletter and get the full scoop: http://nasa.gov/subscribe",
    "For the first time, two @NASA super pressure balloons are in flight at the same time!\n\nThe two balloons launched from New Zealand with a primary goal of testing & qualifying the super pressure balloon tech for flight, while also flying science missions. https://go.nasa.gov/3pzfNvk",
    "Over their eight days on the @Space_Station, the private astronauts of @Axiom_Space's Axiom Mission 2 will run activities from student outreach to scientific experiments.\n\n#Ax2 is set to lift off from @NASAKennedy on Sunday, May 21—here's how to watch: https://go.nasa.gov/41yAdlp",
    "14 years ago, @Astro_Mike wrote the first tweet from space. Since then, we’ve been sharing snippets of our life in orbit—and what it’s like to gaze upon our home planet.\n\nFollow along: http://nasa.gov/astronauts/biographies/active…",
    "LIVE: Cosmonauts are about to embark on a spacewalk to deploy and activate a radiator that will help cool the @Space_Station’s Nauka science module: http://nasa.gov/live",
    "New images from @NASAPersevere may show evidence of what was once a wild and deep river on Mars. The observations are leading scientists to rethink how ancient water once flowed on the Red Planet. https://go.nasa.gov/41tYxEP",
    "This @NASAWebb image of the Pillars of Creation helps astronomers determine how stars form. Plus, it makes pretty sweet digital wallpaper.\n\nDownload high-resolution images from https://webbtelescope.org.",
    " LIVE from #SpaceSymposium: a look at our \n@NASAArtemis\n \"Moon to Mars\" strategy, and what it takes as an agency to make it all possible—from engaging the #Artemis Generation to supporting our workforce and improving our infrastructure. https://bit.ly/3GZ6rPk",
    "A solar eclipse will be visible over parts of Western Australia and Southeast Asia today. No matter where you are, you can watch the Moon block the Sun with us.\n \n At 10:30pm ET (0330 UTC), watch #NASAScience Live and ask NASA experts your questions, plus get a preview of… Show more",
    "On Friday, April 21, \n@NorthropGrumman\n's uncrewed Cygnus cargo craft is scheduled to depart the \n@Space_Station\n. Live coverage begins at 7am ET (1100 UTC). More info: https://go.nasa.gov/3UObN5r",
    "Two cosmonauts are about to venture outside the \n@Space_Station\n for a six-and-a-half-hour spacewalk. Live coverage begins at 9pm ET (0100 UTC April 19) on https://go.nasa.gov/3Lc1mFI.",
    "To help defend Earth from potentially hazardous asteroids and comets, we developed the #PlanetaryDefense Strategy & Action Plan. We’re eager to work with \n@WHOSTP\n in implementing it. https://go.nasa.gov/3mI3MlZ\n\nNote: There are no known asteroid impact threats for 100+ years."
]