[
    "38 astronauts to orbit so far!",
    "The space laser mesh is what enabled Starlink coverage for critical infrastructure, schools, and communities across the 169 island nation of Tonga in the South Pacific Ocean after it was hit by a tsunami last year ",
    "Falcon 9 launches 52 \n@Starlink\n satellites to orbit, completing this first stage booster’s 14th launch and landing",
    "Starlink satellites are equipped with optical space lasers (pew pew), which allow us to provide truly global coverage and serve customers in the most remote locations on Earth http://starlink.com/technology",
    "Starlink helping to connect schools in Rwanda ",
    "AKA, don’t pull out. \n@elonmusk",
    " Untamed Free Speech FTW ",
    "Walter is incredibly thorough in his research. Highly recommend his other books!",
    "Happens a lot",
    "Was the Internet Archive manipulated for nepotistic reasons?",
    "I am excited to welcome Linda Yaccarino as the new CEO of Twitter!\n\n\n@LindaYacc\n will focus primarily on business operations, while I focus on product design & new technology.\n\nLooking forward to working with Linda to transform this platform into X, the everything app.",
    "As seen by an unaffected third party",
    "Wow",
    "Interesting article. Perhaps \n@CommunityNotes\n can add further context & corrections.",
    "For my part, I just want to support content creators, whether or not they provide extra content when you subscribe",
    "Your support of content creators on this platform is very much appreciated.\n\nWe keep none of the subscription revenue for the first 12 months & only 10% thereafter.",
    "Increasing lithium refining capacity is critical to a sustainable energy economy—today, we're breaking ground on our in-house lithium refinery outside of Corpus Christi, TX. \n\nThis facility will also prioritize the elimination of a challenging refinery byproduct (sodium sulfate).… Show more",
    "Tesla Lithium Groundbreaking Ceremony",
    "Livestream starting soon",
    "Assume you’re always being manipulated",
    "In the time it takes you to read this tweet, the expansion of the universe will carry this gorgeous spiral galaxy, called NGC 3147, another 31,000 miles away from us. That’s about four Earth diameters. #MondayMotivation",
    "First Model Y deliveries in Türkiye",
    "Sunset in space",
    "They are the same picture",
    "Cult / Culture",
    "[right wing meme]",
    "@ylecun",
    "Liftoff!",
    "Anyone making materially false statements on this platform will get Community Noted, including you, me, Tucker, advertisers, head of state, etc. No exceptions. \n\nConvince the people and let the chips fall where they may. \n\n\n@CommunityNotes",
    "The data with which the Federal Reserve is making decisions has too much latency"
]