[
    "Training begins for the \n@NASAArtemis\n II astronauts!\n\nWhile some of us are enjoying the start of summer vacation, they just began training for their mission to the Moon and back.\n\nHere's the trajectory map they covered in class this week: https://go.nasa.gov/44dztUs",
    "A new way to visualize our changing planet, \n@NASAWebb\n searches for an atmosphere on TRAPPIST-1 c, and a look inside the future home of asteroid samples from OSIRIS-REx.\n\nAll this and more—This Week at NASA. http://nasa.gov/subscribe",
    "LIVE: Watch the ribbon-cutting for our new Earth Information Center at NASA Headquarters in Washington. The new tool will provide data to the public and decision makers to help adapt and respond to our changing planet: https://go.nasa.gov/eic",
    "We’ve taken light data detected by four of our telescopes—\n@ChandraXray\n, \n@NASAWebb\n, \n@NASAHubble\n, and Spitzer Space Telescope—and turned them into sound. Hear what some galaxies and stars sound like: https://go.nasa.gov/3PjoNzt",
    "The Sun emitted a strong solar flare on June 20, 2023, peaking at 1:09 ET. NASA’s Solar Dynamics Observatory captured an image of the event, which was classified as X1.0. https://go.nasa.gov/3qSaNT7",
    "Astronauts-eye view \n\nTake a look through the helmet cams of \n@Astro_Woody\n and Steve Bowen as they prepare to install a roll-out solar array during today's spacewalk.",
    "Suits are set to battery power and today's spacewalk is underway!\n\nThis is Hoburg's second spacewalk and Bowen's 10th—tying a record for most spacewalks made by a U.S. astronaut.",
    "Astronauts Frank Rubio and \n@Astro_Alneyadi\n are closing the hatch in the \n@Space_Station\n's Quest airlock as Steve Bowen and \n@Astro_Woody\n prepare to step outside for today's spacewalk.",
    "LIVE: Steve Bowen and \n@Astro_Woody\n are installing a new roll-out solar array outside the \n@Space_Station\n.\n\nToday's spacewalk is scheduled to start around 8:55am ET (1255 UTC) and run for six hours.",
    "In collaboration with \n@GoogleArts\n, \n@NASAGoddard\n scientist Dr. Heather Graham sits down with \n@Astro_Kobi\n to discuss how we find answers to the age-old question: Is there life beyond Earth?",
    "Why is Venus so hot?\n\nThe planet’s thick CO2-filled atmosphere is great at trapping heat. This creates a runaway greenhouse effect that makes Venus roughly 700°F (389°C) hotter than it would be otherwise. \n@NASAJPL\n's Dr. Amy Hofmann gives us the details: https://go.nasa.gov/42FxR4v",
    "Join us at 7:30am ET (1130 UTC) on June 15 for another spacewalk! \n@NASA_Astronauts\n Steve Bowen and \n@Astro_Woody\n will install another roll-out solar array on the \n@Space_Station\n, scheduled to start at 8:55am ET (1255 UTC).",
    "Live Now \n\nJoin us for a \"guided tour\" of our \"Eyes on Asteroids\" real-time visualization app. Learn how to use the tool and explore the 28,000 known asteroids and comets in our cosmic neighborhood.",
    "My first EVA (Extravehicular Activity) was an incredible life experience. The team in mission control \n@NASA_Johnson\n was superb. The 1A power channel is now 10kW more powerful. Looking forward to doing it again this week.",
    "Astronauts-eye view \n\nTake a look through the helmet cams of @Astro_Woody and Steve Bowen as they prepare to install a roll-out solar array during today's spacewalk.",
    "Astronauts Frank Rubio and @Astro_Alneyadi are closing the hatch in the @Space_Station's Quest airlock as Steve Bowen and @Astro_Woody prepare to step outside for today's spacewalk.",
    "LIVE: Steve Bowen and @Astro_Woody are installing a new roll-out solar array outside the @Space_Station.\n\nToday's spacewalk is scheduled to start around 8:55am ET (1255 UTC) and run for six hours.",
    "In collaboration with @GoogleArts, @NASAGoddard scientist Dr. Heather Graham sits down with @Astro_Kobi to discuss how we find answers to the age-old question: Is there life beyond Earth?",
    "Why is Venus so hot?\n\nThe planet’s thick CO2-filled atmosphere is great at trapping heat. This creates a runaway greenhouse effect that makes Venus roughly 700°F (389°C) hotter than it would be otherwise. @NASAJPL's Dr. Amy Hofmann gives us the details: https://go.nasa.gov/42FxR4v",
    "Join us at 7:30am ET (1130 UTC) on June 15 for another spacewalk! @NASA_Astronauts Steve Bowen and @Astro_Woody will install another roll-out solar array on the @Space_Station, scheduled to start at 8:55am ET (1255 UTC).",
    "My first EVA (Extravehicular Activity) was an incredible life experience. The team in mission control @NASA_Johnson was superb. The 1A power channel is now 10kW more powerful. Looking forward to doing it again this week.",
    "You're looking at 45,000+ galaxies.\n\nThis image was taken as part of the JWST Advanced Deep Extragalactic Survey (JADES) — a massive science program that’s revolutionizing what we know about galaxies in the early universe: https://go.nasa.gov/3CdLq0s\n\nHere are the highlights ",
    "Dragon flies! \n@SpaceX\n's #CRS28 cargo launch lifted off from \n@NASAKennedy\n at 11:47am ET (1547 UTC). Learn more about the \n@ISS_Research\n it's sending to space: http://go.nasa.gov/43dcbOt",
    "LIVE: We're sending science—and a new set of unrolling solar arrays—to the \n@Space_Station\n!\n\n\n@SpaceX\n's uncrewed #CRS28 mission is scheduled to launch at 11:47am ET (1547 UTC), weather permitting. Watch with us.",
    "This month and every month, we recognize the achievements and contributions of our Asian American, Native Hawaiian, and Pacific Islander workforce.\n\nCheck out the gallery and celebrate #AANHPIHeritageMonth with us: https://go.nasa.gov/3MHtxf9",
    "NOW: An audio-only media briefing following today's public discussion on unidentified anomalous phenomena, or UAPs.",
    "Stay tuned: Our UAP study panelists are taking a brief break. Check the agenda for the upcoming topics and timeline: http://go.nasa.gov/3MFpP5T",
    "Join us and \n@LibraryCongress\n as U.S. Poet Laureate Ada Limón reveals her poem for the \n@EuropaClipper\n mission. The poem will be engraved on the spacecraft, and travel 1.8 billion miles (2.89 billion kilometers) to an icy moon of Jupiter. \n\nTune in: https://bit.ly/42eJZJO",
    "I just reached a milestone only surpassed by Opportunity: 30 km on Mars   \n\nI've explored so much in my 10-plus-year trek through Gale Crater, but there are many more rocks to sample and analyze! Retrace my tracks with this interactive map: http://go.nasa.gov/3EtmSCi",
    "The diversity of our NASA team is what brings different perspectives to our missions, and we celebrate and share their stories. To protect our people from personal attacks, we have decided to limit comments on this post."
]