[
    "Great conversation with \n@NarendraModi",
    "Falcon 9’s first stage has landed on the A Shortfall of Gravitas droneship",
    "Liftoff!",
    "“Highlights Tab” is now live on Twitter. You can now showcase your favorite tweets on your profile. ",
    "Let’s work together ! #ChooseFrance ",
    "Amphitheatrum Flavium",
    "This conspiracy theory that birds are actually government spy drones is … totally false",
    "Quanto sei bella Roma!",
    "Ho accolto con grande piacere oggi a Palazzo Chigi \n@elonmusk\n. Un incontro molto proficuo e un momento di grande cordialità dove abbiamo affrontato alcuni temi cruciali: innovazione, opportunità e rischi dell'intelligenza artificiale, regole europee di mercato e natalità. Avanti… Show more",
    "… attack on the military-industrial complex. \n\nThe lobbying power of large government contractors is far higher than it should be for the good of the people.",
    "Powerwall with Backup Switch automatically detects grid outages & powers your home when you need it most → https://tesla.com/support/energy/powerwall/learn/tesla-backup-switch…",
    "“What are you thinking?”",
    "Starlink is now available in Trinidad and Tobago   → http://starlink.com/map",
    "Augmented reality is amazing",
    "Looking to hire a VP of Witchcraft & Propaganda",
    "Best WW3 song ever",
    "In-flight internet that works as soon as you walk on your flight  \n\nh/t \n@flyjsx",
    "Credit to Larry Page for alerting me to the importance of air filtration",
    "Cry 'Havoc!' and let slip the Doges of war",
    "In a few weeks, X/Twitter will start paying creators for ads served in their replies. First block payment totals $5M.\n\nNote, the creator must be verified and only ads served to verified users count.",
    "It is worth noting that kids who are same-sex attracted and/or autistic are the most vulnerable",
    "Big difference",
    "",
    "Extremely concerning",
    "Starlink connecting schools in Peru ",
    "Tesla Model S & Model X have hospital-grade HEPA air filters, protecting you from dust, bacteria, pollen (allergies), spores & many toxic gases",
    "And on June 6, the Dragon 2 fleet's cumulative time in space surpassed the Space Shuttle fleet's time with 1,324 total days in orbit!",
    "This platform will provide email addresses of subscribers (who opt in) to content creators, so that creators are able to leave this platform easily & take their subscribers with them if they want",
    "We currently have over 20 of our latest generation implants that have passed the 5-year mark of accelerated aging on benchtop (and still going!)  #techtuesday",
    "Would be great to have shows from all parts of the political spectrum on this platform!"
]