[
    "Optimus will come in many forms",
    "Great conversation with \n@NarendraModi",
    "Falcon 9’s first stage has landed on the A Shortfall of Gravitas droneship",
    "This conspiracy theory that birds are actually government spy drones is … totally false",
    "Quanto sei bella Roma!",
    "Ho accolto con grande piacere oggi a Palazzo Chigi \n@elonmusk\n. Un incontro molto proficuo e un momento di grande cordialità dove abbiamo affrontato alcuni temi cruciali: innovazione, opportunità e rischi dell'intelligenza artificiale, regole europee di mercato e natalità. Avanti… Show more",
    "Who should be President in 2032?",
    "Let’s work together ! #ChooseFrance ",
    "Amphitheatrum Flavium",
    "Ho accolto con grande piacere oggi a Palazzo Chigi @elonmusk. Un incontro molto proficuo e un momento di grande cordialità dove abbiamo affrontato alcuni temi cruciali: innovazione, opportunità e rischi dell'intelligenza artificiale, regole europee di mercato e natalità. Avanti… Show more",
    "… attack on the military-industrial complex. \n\nThe lobbying power of large government contractors is far higher than it should be for the good of the people.",
    "Powerwall with Backup Switch automatically detects grid outages & powers your home when you need it most → https://tesla.com/support/energy/powerwall/learn/tesla-backup-switch…",
    "“What are you thinking?”",
    "Augmented reality is amazing",
    "Looking to hire a VP of Witchcraft & Propaganda",
    "Best WW3 song ever",
    "In-flight internet that works as soon as you walk on your flight  \n\nh/t \n@flyjsx",
    "Credit to Larry Page for alerting me to the importance of air filtration",
    "Cry 'Havoc!' and let slip the Doges of war",
    "In a few weeks, X/Twitter will start paying creators for ads served in their replies. First block payment totals $5M.\n\nNote, the creator must be verified and only ads served to verified users count.",
    "It is worth noting that kids who are same-sex attracted and/or autistic are the most vulnerable",
    "In-flight internet that works as soon as you walk on your flight  \n\nh/t @flyjsx",
    "Big difference",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "2,000 sites now live in North America, delivering up to 500 million miles per month ",
    "38 astronauts to orbit so far!",
    "The space laser mesh is what enabled Starlink coverage for critical infrastructure, schools, and communities across the 169 island nation of Tonga in the South Pacific Ocean after it was hit by a tsunami last year ",
    "Falcon 9 launches 52 \n@Starlink\n satellites to orbit, completing this first stage booster’s 14th launch and landing",
    "I was today’s years old when I learned that some people genuinely love cooked salmon",
    "Regenerative braking enables you to bring your Tesla to a complete stop without using the brake pedal, maximizing efficiency & reducing wear & tear\n\nAlso, traction & stability controls are active during regen, giving you more control during deceleration"
]