[
    "The \n@NASAArtemis\n II astronauts visit Washington, \n@BlueOrigin\n is selected to develop the landing system that will take astronauts to and from the surface of the Moon on #Artemis V, and \n@NASARoman\n takes shape.\n\nSubscribe for all this and more: http://nasa.gov/subscribe",
    "LIVE: We're announcing the Phase 2 winners for our \n@NASAPrize\n Deep Space Food Challenge, a global competition to develop sustainable ways of producing healthy food for long-term missions to the Moon, Mars, and beyond.\n\nWatch with us at #NYCxDESIGN:",
    "We selected \n@BlueOrigin\n to develop the human landing system for the #Artemis V mission. This component for deep space transportation will help us in our goal of sending astronauts to the surface of the Moon and returning them home safely: https://go.nasa.gov/3Mn3QQU",
    "LIVE NOW: We are announcing which company will develop the human landing system for the #Artemis V mission to the Moon. This system will help us establish recurring, long-term access to the lunar surface: http://nasa.gov/live",
    "Insights on InSight: Chat LIVE with experts from the mission that detected more than 1,000 marsquakes.",
    "We have final engine cutoff of \n@RocketLab\n's Curie engine on #RocketLikeAHurricane carrying two TROPICS CubeSats.  \n\nExpected Payload Deployment!   \n\nIt will take several orbits to confirm signal. Follow along for more mission updates! http://blogs.nasa.gov/smallsatellites/…",
    "Liftoff! Two TROPICS shoebox-sized satellites are on their way to join the fleet of \n@NASAEarth\n missions studying our home planet. Together, TROPICS will have the potential to gather near-hourly data on the formation and development of tropical cyclones.",
    "LIVE: Watch two small satellites for our storm tracking TROPICS mission launch to orbit. Liftoff on a \n@RocketLab\n Electron rocket is targeted at 9pm ET (0100 UTC May 8), with a two-hour window.",
    "NASA and \n@RocketLab\n are targeting 9pm ET Sunday, May 7 (0100 May 8 UTC), for the first launch of our cyclone-studying TROPICS CubeSats.\n\nTune in here and at http://nasa.gov/live at 8:40pm ET (0040 May 8 UTC) for live launch coverage from New Zealand: https://go.nasa.gov/42xYE3n",
    "A new habitat is prepped for volunteers to test living in Mars-like conditions for a year, \n@NASAWebb\n detects signs of water vapor on a distant planet, and we celebrate #BlackHoleWeek—that’s what’s up This Week at NASA. \n\nWrap up the celebration with us: https://go.nasa.gov/44B3u1j",
    "Live Now: The #Crew6 astronauts are relocating their \n@SpaceX\n Dragon spacecraft to a new docking port on the \n@Space_Station\n ahead of a cargo resupply mission. Undocking is scheduled for 7:10am ET (1110 UTC), with redocking targeted for 7:53am (1153 UTC).",
    "Not too hot, not too cold.\n\nNo, not April 25. It's what \n@NASAExoplanets\n scientists call the habitable zone of a star—the range where liquid water could exist on a planet's surface: https://go.nasa.gov/41FqY3w",
    " LIVE: \n@VP\n Kamala Harris & \n@President_KR\n Yoon Suk Yeol deliver remarks during their tour of \n@NASAGoddard\n to see our climate change research.",
    "People travel to national parks every year to be surrounded by the beauty of nature. #NationalParkWeek\n\nNational parks seen from space are just as beautiful. Maybe more? \n\nYou be the judge. https://go.nasa.gov/4449VtO",
    "What's your favorite \n@NASAHubble\n image? http://bit.ly/3NauIG3\n\nLaunched 33 years ago today, the orbiting telescope captured this image of a nebula where stars are born -- 960 light-years away. http://go.nasa.gov/3VizSlr",
    "On April 25, \n@VP\n Kamala Harris & \n@President_KR\n Yoon Suk Yeol will tour \n@NASAGoddard\n and meet with scientists to see firsthand climate change research underway. They will also take an early look at \n@NASARoman\n, our next space telescope. https://go.nasa.gov/3Nbslmm",
    "LIVE: Preview the next spacewalk set for Friday, April 28. Veteran astronaut Steve Bowen and first-time spacewalker \n@Astro_Alneyadi\n will prepare the \n@Space_Station\n for solar power upgrades.",
    "NOW: \n@NASAEarth\n and \n@CenterForAstro\n scientists are answering questions on Reddit about TEMPO, a new space-based instrument that will revolutionize our understanding of air quality.\n \nWant to learn more? Ask your own Qs on our AMA.",
    "Earth is our home. \n\nOn #EarthDay and every day, we’re learning more about our world and how it’s changing – giving us a deeper appreciation for the planet we call home.\n\nCelebrate with us: https://go.nasa.gov/3mZmeXx",
    "Wow! Look at all this love for Earth!  While you’re here, check out how we study Earth every day at \n@nasa\n.",
    "This #WorldQuantumDay, discover what the quantum realm is really like and how NASA studies it every day—with Ant-Man actor Paul Rudd!\n\nFind out how our exploration of quantum science could help unlock the universe’s biggest mysteries. https://go.nasa.gov/3U0RjG9",
    "Congratulations, \n@ESA\n! #ESAJuice is on its way to Jupiter's large ocean-bearing moons – Callisto, Europa, and Ganymede – to help see whether these icy worlds have the conditions to harbor life. Here's to science. ",
    "Ingenuity perseveres.\n\nOur #MarsHelicopter just flew its 50th flight on the Red Planet (out of a planned five), nearly two years after it first took to the Martian skies. This demo is giving a glimpse of the future of powered flight on other worlds. https://mars.nasa.gov/ingenuity",
    "We love Lucy!\n\nThe \n@NASASolarSystem\n #LucyMission captured its first views of four of its Trojan asteroid targets, from 330 million miles (530 million kilometers) away. Set to fly by in 2027-2028, Lucy will be the first mission ever to visit them:\nhttps://go.nasa.gov/43tu8c3",
    "Space tomatoes, heart studies, and other \n@ISS_Research\n experiments are heading back to Earth this weekend on \n@SpaceX\n's #CRS27, the latest cargo return from the \n@Space_Station\n.\n\nUndocking coverage begins Saturday, April 15, at 10:45am ET (1445 UTC): https://go.nasa.gov/3zRgx0q",
    "We’re bringing back a bit of Bennu. Have questions about our asteroid sample return mission? Submit your question below and hear from experts starting at 2 pm ET.",
    "We celebrate International #HumanSpaceFlight Day honoring the accomplishments of the first person in space in 1961, and the first launch of the space shuttle in 1981. \n\nNext, with \n@NASAArtemis\n, we continue humanity’s progress with Moon & Mars exploration!",
    "Tail installed \n\nSoon, \n@NASAAero\n’s X-59 will take to the skies to demonstrate a new quiet form of supersonic flight. This technology could bring a return to supersonic flight over land—cutting flight times in half. More on the Quesst mission: https://nasa.gov/specials/Quesst/…",
    "Congratulations, @ESA! #ESAJuice is on its way to Jupiter's large ocean-bearing moons – Callisto, Europa, and Ganymede – to help see whether these icy worlds have the conditions to harbor life. Here's to science. ",
    "We love Lucy!\n\nThe @NASASolarSystem #LucyMission captured its first views of four of its Trojan asteroid targets, from 330 million miles (530 million kilometers) away. Set to fly by in 2027-2028, Lucy will be the first mission ever to visit them:\nhttps://go.nasa.gov/43tu8c3"
]