[
    "Interview with \n@BillMaher",
    "Falcon 9’s first stage has landed on the Just Read the Instructions droneship",
    "Liftoff!",
    " Happy Mother’s Day! ",
    "Poetry with quill  \nWritten on rose  \nWith my blood ",
    "Contributors’ time is valuable, and best spent reviewing high quality notes. Today we’re making the number of notes one can write in 24h proportional to their track record. The more helpful notes you’ve written, the more you can write. If you hit your limit, you’ll see this:",
    "S3XY vehicles  hot engineers \n\nOur field quality engineers head to Dubai at the hottest time of the year for extreme heat & durability testing—temperatures reach over 50°C",
    "Also, which kind of bat – fruit eating bat or insect eating bat ?",
    "Vote at the 2023 Tesla Shareholder Meeting →",
    "The spice must flow",
    "\"Twitter has proven itself to be among the best, if not the best, platform for return on ad spend and conversion campaigns right now.\" - \n@SeanEcom\n CEO, The Ridge Wallet \n\nStand out in a crowded DTC market ",
    "Congratulations Tesla Texas Team!!",
    "\"Twitter has proven itself to be among the best, if not the best, platform for return on ad spend and conversion campaigns right now.\" - @SeanEcom CEO, The Ridge Wallet \n\nStand out in a crowded DTC market ",
    "While other car manufacturers struggle with updates, Tesla continuously improves its fleet and features. With its latest update, AEB now works in reverse and up to 124 mph (200 km/h).",
    "Imagine the countless lives we could save if more people drove Teslas. With safety as a top priority, Tesla is leading the charge towards a safer future on our roads.",
    "Not all active safety systems are created equal. Even within the 5-star category, there can be considerable differences in the effectiveness of assistance systems like AEB.",
    "The least bad solution to the AGI control problem that I can think of is to give every verified human a vote",
    "We live in the most interesting of times",
    "More photos from the first flight test of a fully integrated Starship and Super Heavy rocket",
    "FIRST STARSHIP LAUNCH.\n3 PEOPLE  SHARE THEIR EXPERIENCES.\n\n(April 22, 2023) S. Padre Island, Texas\n\nI wanted to write about my first rocket launch. I realized that to best write for you, I had to talk to other people about their experiences.  I’m sharing with you some of the… Show more",
    "What makes \n@CommunityNotes\n so powerful is that people with different points of view have to agree that a note is correct for it to be shown",
    "check mate",
    "Every vehicle we sell, battery we install & solar panel we add moves the needle in the direction of a sustainable future.\n\nThank you to the Tesla team, customers & supporters for bringing us closer to our goal!\n\nHappy Earth Day ",
    "Starship liftoff in slow motion",
    "Creators can now sign up and earn a living directly on Twitter in the EU, UK, and EEA.\n\nTap on “Monetization” in settings to apply today.\n\nFor a full list of available countries see our Help Center:",
    "More Community Notes! Today’s new algorithm update boosts the number of Helpful notes by 10%+. It builds on last week’s change that uses confidence scores to identify notes that are broadly found helpful with high precision. https://communitynotes.twitter.com/guide/en/under-the-hood/ranking-notes#modeling-uncertainty…",
    "We’re adding more transparency to the enforcement actions we take on Tweets. As a first step, soon you’ll start to see labels on some Tweets identified as potentially violating our rules around Hateful Conduct letting you know that we’ve limited their visibility. … Show more",
    "Learned a lot today, now offloading propellant, retrying in a few days …",
    "A pressurant valve appears to be frozen, so unless it starts operating soon, no launch today",
    "Cryogenic propellant load of Starship is underway, liftoff in T minus 1 hour"
]