[
    "We completed a joint checkpoint review with \n@BoeingSpace\n ahead of the first #Starliner flight to carry astronauts, set for no earlier than July 21. Teams will provide updates leading up to the inaugural Crew Flight Test to and from the \n@Space_Station\n: https://go.nasa.gov/3MZR1xG",
    "Hot new bombshells enter the villa.\n\nOtherwise invisible to the unaided eye, infrared data from \n@NASAWebb\n and x-ray data from \n@ChandraXray\n make details in these proper fit cosmic wonders available by mapping the data to colors that humans can perceive:\nhttps://go.nasa.gov/43wTsx9",
    "The \n@NASAArtemis\n II astronauts visit Washington, \n@BlueOrigin\n is selected to develop the landing system that will take astronauts to and from the surface of the Moon on #Artemis V, and \n@NASARoman\n takes shape.\n\nSubscribe for all this and more: http://nasa.gov/subscribe",
    "LIVE: We're announcing the Phase 2 winners for our \n@NASAPrize\n Deep Space Food Challenge, a global competition to develop sustainable ways of producing healthy food for long-term missions to the Moon, Mars, and beyond.\n\nWatch with us at #NYCxDESIGN:",
    "We selected \n@BlueOrigin\n to develop the human landing system for the #Artemis V mission. This component for deep space transportation will help us in our goal of sending astronauts to the surface of the Moon and returning them home safely: https://go.nasa.gov/3Mn3QQU",
    "LIVE NOW: We are announcing which company will develop the human landing system for the #Artemis V mission to the Moon. This system will help us establish recurring, long-term access to the lunar surface: http://nasa.gov/live",
    "Insights on InSight: Chat LIVE with experts from the mission that detected more than 1,000 marsquakes.",
    "Are you there, Moon? It’s me, #CAPSTONE \n\nOur microwave-oven sized #CubeSat has taken its first images! And tested a new navigation tech with our Lunar Reconnaissance Orbiter. Learn how it lays the groundwork for future peer-to-peer navigation at the Moon: https://go.nasa.gov/3o8O4Bk",
    "Ever feel like you're being pulled in different directions and you might erupt?\n\nAn Earth-size exoplanet, spotted by NASA's orbiting telescopes, is at the center of a cosmic tug-of-war in its star system—which may stud its surface with fiery volcanoes: https://go.nasa.gov/3MzUxhS",
    "Want to help us find asteroids? A new \n@DoNASAScience\n project lets you do that from anywhere in the world. Help scientists go through images to identify which specks of light are real space rocks and which are false detections: https://go.nasa.gov/41MRmHT",
    "What healthy and sustainable ways would you use to keep astronauts fed on long-duration missions to the Moon, Mars, and beyond?\n\nThe Phase 2 winners of our Deep Space Food Challenge will be revealed live Friday, May 19, at the #NYCxDESIGN Festival: https://go.nasa.gov/3MCRLIF",
    "We can’t imagine a more beautiful thing than May’s full moon – the Corn Moon. \n\nSet to peak on May 5 at 1:34pm ET (1634 UTC ), this full moon, also known as the Flower Moon, will appear full till Sunday. Discover how it got its names: http://go.nasa.gov/3piIAUs",
    "Four of Uranus’ largest moons—Ariel, Umbriel, Titania, and Oberon—may have oceans beneath their icy crusts, according to a re-analysis of Voyager 2 data. https://go.nasa.gov/3VQtF0l",
    "Today we mourn the passing of Samuel Durrance, an astronomer who flew aboard two @NASA Space Shuttle missions as a payload specialist and operated a collection of four telescopes as part of the Astro-1 and Astro-2 Spacelabs. Godspeed, Samuel.",
    "Join us tomorrow from the @Space_Station!\n\nWith #Crew6 aboard, @SpaceX's Dragon Endeavour spacecraft is undocking and moving to a new port to make room for an upcoming cargo launch. Watch here and at http://nasa.gov/live starting at 7am ET (1100 UTC) on Saturday, May 6.",
    "@WomenNASA Liz Landau, host and science communicator\n\n@ChandraXray Daryl Haggard, astrophysicist\n\n@NASAJPL Michele Vallisneri, theoretical physicist\n\n@NASAUniverse Regina Caputo, astrophysicist",
    "It’s a TRAP(PIST)-1! \n\nAbout 40 light-years away lies a planetary system with the most Earth-sized exoplanets found in a star's habitable zone. Learn more about the TRAPPIST-1 system that was recently studied by @NASAWebb: http://go.nasa.gov/415DmsC\n\n#MayTheFourth",
    "When we say “supermassive black holes,” just how do they measure up? \n\nUsing their shadows for size, we’ve rounded up 10 black holes and compared them to objects in our solar system. Don’t worry – these black holes are many light-years away: https://go.nasa.gov/3HIcDeW #BlackHoleWeek",
    "The eta Aquariid meteor shower is expected to reach its peak tonight (May 4-5)—and even with the full Moon, it could still be a great night for skywatching!\n\nHere's how, where and when to track the eta Aquariids: https://go.nasa.gov/42iqGQk",
    "Astronaut \n@Astro_Watkins\n spent 170 days in space as a member of #Crew4. In our Curious Universe podcast season finale, she talks about how her background and training prepared her for life and work in space. https://go.nasa.gov/41j8YLT",
    "Designed to endure at least 7 passes through Jupiter's intense radiation, the JunoCam instrument has survived 50 so far – and it’s still going strong. In this new @googlearts exhibition, celebrate the otherworldly vistas “the public’s camera” has shown us: https://artsandculture.google.com/story/XwUxhKx1GDOOTA…",
    "The #JunoMission completed its 50th close pass of Jupiter this past weekend. Relive highlights from its journey around the solar system’s largest planet, download high-res images and learn more: https://go.nasa.gov/40ZRrIQ",
    "A new \n@NASAEarth\n & \n@CenterForAstro\n mission preparing for launch will be the first to take hourly observations of air quality in North America. Data from #TEMPO will improve forecasts & reveal disparities in pollution exposure within cities and communities. https://go.nasa.gov/3K3Zhd4",
    "Our crawler-transporter was recognized as the world's heaviest self-powered vehicle, DC welcomed the #Crew4 astronauts, and we prepare to recover asteroid samples returning in September—This Week at NASA.\n\nSubscribe for videos on Earth, flight & space at http://bit.ly/3mFZr2s",
    "Through #WomensHistoryMonth and every day, we honor the women at NASA who brought us to where we are and inspire generations past, present, and future to explore the cosmos. http://nasa.gov/women",
    "One mission. Four astronauts. So many ways to watch the #Artemis II astronaut announcement.     The thread below tells you all the places you can find this historic event. We make history on Monday, April 3, starting at 11am ET (1500 UTC).",
    " Need more space in your inbox? Subscribe to our weekly newsletter for the latest stories from across the universe.\n\nSign up: http://nasa.gov/subscribe\n\n¡También en español! http://nasa.gov/suscribete",
    " What's up in the night sky this April?\n\nThe Moon will pair up beautifully with several planets, while viewing conditions may be ideal for the Lyrid meteor shower. More skywatching tips:",
    "In our search to provide drinking water for astronauts, we helped solve water problems here on Earth. One resulting \n@NASASpinoff\n has been incorporated into water bottles, industrial water purification & a water-recycling shower, filtering out contaminants. https://go.nasa.gov/3nD3ltd",
    "Tiny bits of Saturn’s rings are falling into the massive planet, causing its upper atmosphere to heat up. The discovery was made using 40 years of data from several \n@NASASolarSystem\n missions, including \n@NASAHubble\n: https://go.nasa.gov/3G4ova1"
]