[
    "",
    "Extremely concerning",
    "Starlink connecting schools in Peru ",
    "This platform will provide email addresses of subscribers (who opt in) to content creators, so that creators are able to leave this platform easily & take their subscribers with them if they want",
    "We currently have over 20 of our latest generation implants that have passed the 5-year mark of accelerated aging on benchtop (and still going!)  #techtuesday",
    "Lil X just asked if there are police cats, since there are police dogs ",
    "Congratulations to Giga Shanghai & Tesla China SDS teams for their excellent work overcoming many obstacles over many years!!",
    "38 astronauts to orbit so far!",
    "Congratulations Neuralink team!",
    "Starlink helping to connect schools in Rwanda ",
    "AKA, don’t pull out. \n@elonmusk",
    " Untamed Free Speech FTW ",
    "@GovRonDeSantis\n announced he’s running for president on Twitter. This was by far the biggest room ever held on social media. Twitter performed great after some initial scaling challenges. Thanks Twitter Team for adapting so quickly to make history!",
    "All Presidential candidates are most welcome on this platform",
    "Spaces with \n@RonDeSantis\n in ~2 hours!",
    "Twitter is the town square of the people",
    "BREAKING: \n@FoxNews\n confirms Florida Governor \n@RonDeSantis\n will announce his 2024 Presidential run tomorrow night, 6pm ET in a Twitter Spaces interview with \n@elonmusk\n.",
    "And works almost everywhere on Earth with global roaming enabled!",
    "Both quality & quantity of high quality posts of all kinds (short text, long essays, pictures, audio & video) have improved dramatically. \n\nThank you for contributing your voice to humanity’s digital public square!",
    "Starlink for RVs can be used anywhere Starlink provides service and is ideal for camping and other activities in rural or remote locations where internet access has been unreliable or completely unavailable → http://starlink.com/rv",
    "Falcon 9 and Dragon vertical at 39A; targeting Sunday, May 21 at 5:37 p.m. ET for launch of Ax-2 → http://spacex.com/launches/mission/?missionId=ax-2…",
    "Over one-third of secondary schools and two-thirds of primary schools around the world are not connected to the internet.\n\nOn the isolated island of Pangan-an in the Philippines, Starlink was set up to support 700+ elementary and high school students → http://sunstar.com.ph/article/1961567/cebu/local-news/satellite-connects-isolated-cebu-island-to-the-internet…… Show more",
    "Walter is incredibly thorough in his research. Highly recommend his other books!",
    "Happens a lot",
    "Was the Internet Archive manipulated for nepotistic reasons?",
    "Twitter Blue Verified subscribers can now upload 2 hour videos (8GB)!",
    "Ship 25 moved to a suborbital pad at Starbase for an upcoming static fire of its six Raptor engines",
    "Why is sleep so hard!? Perhaps we will never know.",
    "One-third of humanity remains offline, and many users only have basic connectivity.\n\nThe Ministry of Education in El Salvador—among many others around the world—is installing Starlink in schools to help close the digital divide ",
    "I am excited to welcome Linda Yaccarino as the new CEO of Twitter!\n\n\n@LindaYacc\n will focus primarily on business operations, while I focus on product design & new technology.\n\nLooking forward to working with Linda to transform this platform into X, the everything app."
]