[
    "#MissionToPsyche is on track for launch in October 2023!\n\nAn independent review board found JPL’s response to address factors contributing to the mission’s 2022 launch delay has been \"world class.\"",
    "LIVE: Tune in as we review next steps for the Psyche mission, set to launch no earlier than Oct. 2023. The spacecraft will study a metal-rich asteroid of the same name that may be the partial core of a building block of rocky planets in our solar system.",
    "You're looking at 45,000+ galaxies.\n\nThis image was taken as part of the JWST Advanced Deep Extragalactic Survey (JADES) — a massive science program that’s revolutionizing what we know about galaxies in the early universe: https://go.nasa.gov/3CdLq0s\n\nHere are the highlights ",
    "Dragon flies! \n@SpaceX\n's #CRS28 cargo launch lifted off from \n@NASAKennedy\n at 11:47am ET (1547 UTC). Learn more about the \n@ISS_Research\n it's sending to space: http://go.nasa.gov/43dcbOt",
    "Ad astra per aspera \n\nJoin us this #MemorialDay in remembering and honoring all those who made the ultimate sacrifice in service to our country.",
    "After just over a week in space, \n@Axiom_Space\n's #Ax2 astronauts are set to return to Earth on Tuesday, May 30. Here’s how to watch live coverage, from closing of the hatches to splashdown: https://go.nasa.gov/43vWzp6",
    "Two \n@NASA_Astronauts\n will do a pair of spacewalks on June 9 and June 15 to install new solar arrays on the \n@Space_Station\n. We’ll stream them live.\n \nJoin us for a preview on June 1: https://go.nasa.gov/3MGCCFj",
    "We completed a joint checkpoint review with \n@BoeingSpace\n ahead of the first #Starliner flight to carry astronauts, set for no earlier than July 21. Teams will provide updates leading up to the inaugural Crew Flight Test to and from the \n@Space_Station\n: https://go.nasa.gov/3MZR1xG",
    "Hot new bombshells enter the villa.\n\nOtherwise invisible to the unaided eye, infrared data from \n@NASAWebb\n and x-ray data from \n@ChandraXray\n make details in these proper fit cosmic wonders available by mapping the data to colors that humans can perceive:\nhttps://go.nasa.gov/43wTsx9",
    "Completing a squad of severe weather satellites, testing out a ssssnake-like robot, and sending the second all-private astronaut mission to the \n@Space_Station\n—all in a week’s work at NASA. See what we’ve been up to.",
    "We’re launching solar arrays, small satellites, and a plant experiment to the \n@Space_Station\n on the next \n@SpaceX\n cargo mission, set for June 3.\n\nTune in on May 30 at 2pm ET (1800 UTC) for details. #AskNASA your questions and we may answer them on-air. https://go.nasa.gov/430oldn",
    "Paula Cain started her career in fashion design—now, she's a thermal blanket technician at \n@NASAGoddard\n, making sure our telescopes and spacecraft can run at a steady temperature.\n\nLearn more about her journey in our latest \n@NASASTEM\n episode of \"Surprisingly STEM!\"",
    "Our \n@NASAEarth\n TROPICS mission is safely in orbit following today's successful launch by \n@RocketLab\n. Two small satellites join a pair already in space, where they'll track the formation and evolution of tropical cyclones, including hurricanes. https://go.nasa.gov/3MVXPwa",
    "Insights on InSight: Chat LIVE with experts from the mission that detected more than 1,000 marsquakes.",
    "Are you there, Moon? It’s me, #CAPSTONE \n\nOur microwave-oven sized #CubeSat has taken its first images! And tested a new navigation tech with our Lunar Reconnaissance Orbiter. Learn how it lays the groundwork for future peer-to-peer navigation at the Moon: https://go.nasa.gov/3o8O4Bk",
    "Ever feel like you're being pulled in different directions and you might erupt?\n\nAn Earth-size exoplanet, spotted by NASA's orbiting telescopes, is at the center of a cosmic tug-of-war in its star system—which may stud its surface with fiery volcanoes: https://go.nasa.gov/3MzUxhS",
    "Want to help us find asteroids? A new \n@DoNASAScience\n project lets you do that from anywhere in the world. Help scientists go through images to identify which specks of light are real space rocks and which are false detections: https://go.nasa.gov/41MRmHT",
    "What healthy and sustainable ways would you use to keep astronauts fed on long-duration missions to the Moon, Mars, and beyond?\n\nThe Phase 2 winners of our Deep Space Food Challenge will be revealed live Friday, May 19, at the #NYCxDESIGN Festival: https://go.nasa.gov/3MCRLIF",
    "Astronaut Dr. Jonny Kim joins Anita Dey, strategic partnerships manager at NASA, in a chat with chief historian Dr. Brian Odom as they delve into supporting the #AANHPI community, Kim's journey in the space program, and the impact of stereotypes:",
    "The launch of two more small satellites for our \n@NASAEarth\n TROPICS mission is targeted for no earlier than Monday, May 22 at 1:30am ET (0530 UTC) on a \n@RocketLab\n rocket. They’ll join a pair in orbit to make observations of cyclones and intense weather. https://go.nasa.gov/3MdEEwb",
    "It’s handy to have one of these. Know why?",
    "Want to help us find asteroids? A new @DoNASAScience project lets you do that from anywhere in the world. Help scientists go through images to identify which specks of light are real space rocks and which are false detections: https://go.nasa.gov/41MRmHT",
    "The launch of two more small satellites for our @NASAEarth TROPICS mission is targeted for no earlier than Monday, May 22 at 1:30am ET (0530 UTC) on a @RocketLab rocket. They’ll join a pair in orbit to make observations of cyclones and intense weather. https://go.nasa.gov/3MdEEwb",
    "Four of Uranus’ largest moons—Ariel, Umbriel, Titania, and Oberon—may have oceans beneath their icy crusts, according to a re-analysis of Voyager 2 data. https://go.nasa.gov/3VQtF0l",
    "It’s a TRAP(PIST)-1! \n\nAbout 40 light-years away lies a planetary system with the most Earth-sized exoplanets found in a star's habitable zone. Learn more about the TRAPPIST-1 system that was recently studied by \n@NASAWebb\n: http://go.nasa.gov/415DmsC\n\n#MayTheFourth",
    "When we say “supermassive black holes,” just how do they measure up? \n\nUsing their shadows for size, we’ve rounded up 10 black holes and compared them to objects in our solar system. Don’t worry – these black holes are many light-years away: https://go.nasa.gov/3HIcDeW #BlackHoleWeek",
    "The eta Aquariid meteor shower is expected to reach its peak tonight (May 4-5)—and even with the full Moon, it could still be a great night for skywatching!\n\nHere's how, where and when to track the eta Aquariids: https://go.nasa.gov/42iqGQk",
    "Bring balance to the force, not leave it in darkness.\n\nHappy #StarWarsDay. And #MayThe4thBeWithYou.",
    "Reflecting on the past two years, I am humbled by the dedication of the \n@NASA\n team and their commitment to advancing science and exploration. We have so much to look forward to. Together, we will continue to push the limits of exploration and achieve the impossible.",
    "“I can see you’re lonely down there... Don’t you know that I’m right here?”\n\nHonored to be an inspiration to robots everywhere, \n@Harry_Styles\n. "
]