[
    "With a phone or computer, you can help astronomers \n@DoNASAScience\n and uncover some of the most elusive objects in the universe—brown dwarfs. These balls of gas never became stars, so this is your chance to shine a light on them: https://go.nasa.gov/3r4wdMO",
    "Our next cargo mission to the \n@Space_Station\n is set to lift off from \n@NASA_Wallops\n on Tuesday, Aug. 1!\n\n\n@NorthropGrumman\n's #NG19 launch will carry gene therapy research, materials to study fires in space, and digital art from students around the world: https://go.nasa.gov/3JAWhFE",
    "As Chair of the National Space Council, I am thrilled to announce the public opening of \n@NASA\n's Earth Information Center (EIC).\n\nLeveraging 60 years of space-based Earth observation, the EIC will use life-saving data to tackle the climate crisis at home.\nhttps://gis.earthdata.nasa.gov/portal/apps/sites/#/earth-information-center…",
    "Spaceship update! \n@SpaceX\n's Dragon spacecraft for the uncrewed #CRS28 cargo mission is scheduled to undock from the \n@Space_Station\n at 12:05pm ET (1605 UTC) on Thursday, June 29, with splashdown early Friday morning. Here's the full timeline: https://go.nasa.gov/3NLmWCi",
    "\"And when we do things that improve equity for the people who have it the worst, we are improving equity across the board.\" — S. J. Ralston, Mars research scientist, advocates for transgender and nonbinary people in the workplace. #PrideMonth https://nasa.gov/faces-of-nasa/sj-ralston…",
    "The diversity of our NASA team is what brings different perspectives to our missions, and we celebrate and share their stories. To protect our people from personal attacks, we have decided to limit comments on this post.",
    "LIVE: Two cosmonauts are stepping outside the \n@Space_Station\n to install equipment and retrieve experiments. Today's spacewalk is scheduled to start around 10:20am ET (1420 UTC) and last up to seven hours—follow along at http://nasa.gov/live.",
    "Watch the \n@Space_Station\n's new roll-out solar array begin to unfurl in a process that takes about 12 minutes to complete. This is the helmet camera view from astronaut Steve Bowen:",
    "Another spacewalk in the books! \n\nToday’s spacewalk concluded at 2:17pm ET (1817 UTC) and lasted 5 hours and 35 minutes. Steve Bowen and \n@Astro_Woody\n installed a new roll-out solar array and completed numerous additional tasks outside the \n@Space_Station\n.",
    "Check out our Guide to Visiting a Gamma-Ray Burst",
    "@NASAUniverse\n: Judy Racusin, astronomer at NASA Goddard\n\n@NASA_Marshall\n: Cori Fletcher, astronomer at NASA Marshall via USRA\n\n@PSUScience\n: Jamie Kennea, astronomer at #PennState\n\n@WomenNASA\n: Liz Landau, host, NASA HQ",
    ".\n@EuropaClipper\n is set to launch on a journey to Jupiter’s icy moon next fall. Ask mission experts at \n@NASAJPL\n your questions live now:",
    "JUST ANNOUNCED @ #AIAAaviation: We've got an X designation for the Sustainable Flight Demonstrator!\n\nIntroducing, X-66A \n\nThe new X-plane seeks to inform a potential new gen of more sustainable single-aisle aircraft-the workhorse of passenger airlines. https://nasa.gov/press-release/next-generation-experimental-aircraft-becomes-nasa-s-newest-x-plane/…",
    "How do places on Mars get their name? \n\nMore than 2,000 locations on the Red Planet have official names, recognizing places on Earth, explorers, and even cartoon characters. Learn what inspires names for Martian hills, craters, and rocks: https://go.nasa.gov/3CmCYMm",
    "Later this month, we're opening the Earth Information Center—a hybrid exhibit that offers an interactive look at our changing planet.\n\nMedia are invited to a ribbon-cutting ceremony on Wednesday, June 21, at NASA Headquarters in Washington: https://go.nasa.gov/43STHT7",
    "In the early universe, the gas between stars and galaxies was opaque – energetic starlight could not penetrate it. But 1 billion years after the big bang, the gas had become completely transparent. Why? New data from \n@NASAWebb\n has pinpointed the reason: https://go.nasa.gov/3qCcOmn",
    "Scientists detected a gamma-ray burst on Oct. 9, 2022, that they called the BOAT: Brightest Of All Time. Data from our \n@NASAUniverse\n NuSTAR telescope provided clues about the collapsing star that triggered this record-breaking event. https://go.nasa.gov/3qvQt9L",
    "Love space but nervous to travel 1.8 billion miles? That’s okay!\n\nLeave your mark by having your name engraved on the \n@EuropaClipper\n spacecraft! \n\n#SendYourName here: https://go.nasa.gov/449nDLd",
    "@NASAUniverse: Judy Racusin, astronomer at NASA Goddard\n@NASA_Marshall: Cori Fletcher, astronomer at NASA Marshall via USRA\n@PSUScience: Jamie Kennea, astronomer at #PennState\n@WomenNASA: Liz Landau, host, NASA HQ",
    ".@EuropaClipper is set to launch on a journey to Jupiter’s icy moon next fall. Ask mission experts at @NASAJPL your questions live now:",
    "In the early universe, the gas between stars and galaxies was opaque – energetic starlight could not penetrate it. But 1 billion years after the big bang, the gas had become completely transparent. Why? New data from @NASAWebb has pinpointed the reason: https://go.nasa.gov/3qCcOmn",
    "Scientists detected a gamma-ray burst on Oct. 9, 2022, that they called the BOAT: Brightest Of All Time. Data from our @NASAUniverse NuSTAR telescope provided clues about the collapsing star that triggered this record-breaking event. https://go.nasa.gov/3qvQt9L",
    "Love space but nervous to travel 1.8 billion miles? That’s okay!\n\nLeave your mark by having your name engraved on the @EuropaClipper spacecraft! \n\n#SendYourName here: https://go.nasa.gov/449nDLd",
    "U.S. Poet Laureate Ada Limón’s poem celebrates water—what connects the two ocean worlds \n@EuropaClipper\n travels between. \n\nMake your special connection to Europa & #SendYourName aboard our spacecraft on this 1.8 billion-mile journey to Jupiter’s moon: http://go.nasa.gov/MessageInABottle…",
    "Keep your eyes in the sky throughout June — you may see the Moon, Mars, Venus, Saturn, Jupiter, or even the Stars of the Summer Triangle!\n\nGet the details with our monthly episode of What’s Up: http://go.nasa.gov/37ePy0B",
    "There’s space for everyone this #PrideMonth, and we’re celebrating the LGBTQI+ employees who help us reach for the stars, examine humanity’s place in the universe, and study our home planet: http://go.nasa.gov/3C9ncnU",
    "Live from \n@LibraryCongress\n: U.S. Poet Laureate Ada Limón reveals her Poem for Europa, an original work that will fly aboard the \n@EuropaClipper\n spacecraft to Jupiter's icy moon.",
    "LIVE: Join NASA and \n@BoeingSpace\n officials as we share an update on the first #Starliner Crew Flight Test. Tune in.",
    " \n@NASA\n and \n@BoeingSpace\n will host a media teleconference at 5pm ET today for an update on Boeing's first crewed flight on the CST-100 Starliner to the \n@Space_Station\n.\n\nListen in: http://nasa.gov/live",
    "LIVE: Experts at \n@NASA_Johnson\n are discussing our upcoming spacewalks, scheduled for June 9 and June 15, to set up new solar arrays outside the \n@Space_Station\n.\n\nWe're taking questions from media and the public—share your spacewalk Qs with #AskNASA."
]