[
    "The ocean is one of Earth’s largest ecosystems and helps moderate our climate. NASA has an array of missions dedicated to studying this precious part of the planet, with more to come. \n\nDive in: http://go.nasa.gov/43yYj0w ",
    "It’s giving…life.    #WorldOceansDay",
    "Stay tuned: Our UAP study panelists are taking a brief break. Check the agenda for the upcoming topics and timeline: http://go.nasa.gov/3MFpP5T",
    "NOW: We're holding a public meeting of our independent study team for categorizing and evaluating data of unidentified anomalous phenomena, or UAP. More info on today's meeting: https://go.nasa.gov/3nVqp7g",
    "Welcome back to Earth! It's been an incredible journey for the all-private astronaut crew of #Ax2. They've conducted vital scientific experiments and brought the wonders of space closer to us all. Congratulations to \n@SpaceX\n and \n@Axiom_Space\n for another successful mission!",
    "#Ax2 has arrived! The \n@SpaceX\n Dragon crew ship with four private astronauts from \n@Axiom_Space\n docked to the station at 9:12am ET today. They will enter the orbital outpost soon live on \n@NASA\n TV.",
    "NOW: Watch the \n@Axiom_Space\n #Ax2 astronauts arrive at the \n@Space_Station\n. The \n@SpaceX\n Dragon is set to dock at around 9:16am ET (1316 UTC).",
    "LIVE: Mission experts recap the launch of #Ax2, \n@Axiom_Space\n's second all-private mission to the \n@Space_Station\n.",
    "#Ax2's \n@SpaceX\n Dragon Freedom spacecraft has separated from its rocket—the Axiom Mission 2 crew is now on course for the \n@Space_Station\n.\n\nTune in for docking coverage (here and on NASA TV) starting at 7:30am ET (1130 UTC) on Monday, May 22.",
    "#Ax2 is on its way to space!\n\nThe all-private astronaut mission lifted off from \n@NASAKennedy\n at 5:37pm ET (2137 UTC).",
    "Did you catch our latest \n@NASAArtemis\n Moon Minute in the Axiom-2 launch broadcast?\n\n\n@NASA\n and \n@Axiom_Space\n are working to prepare the suits that astronauts will wear when they land on the Moon for Artemis III.",
    "LIVE: Four private astronauts are heading to the \n@Space_Station\n for scientific research, student outreach and commercial activities on \n@Axiom_Space\n's #Ax2 mission.\n\nWatch with NASA, Axiom Space, and \n@SpaceX\n—liftoff is scheduled for 5:37pm ET (2137 UTC).",
    "On a power trip. \n\nAfter a 10-month voyage attached to the \n@Space_Station\n, a power cell material survives and thrives. The efficient light-absorbing material may play a valuable role in powering long-duration space missions: https://go.nasa.gov/3MKK4jH",
    "NOW: Get the latest status update on the all-private #Ax2 mission, set to lift off on Sunday, May 21 at 5:37pm ET (2137 UTC) from \n@NASAKennedy\n. https://youtube.com/watch?v=63TWnnZhePo…",
    "Our next \n@SpaceX\n cargo launch, carrying supplies and a new set of unrolling solar panels to the \n@Space_Station\n, is now scheduled to lift off from \n@NASAKennedy\n on Saturday, June 3. Media accreditation is open: https://go.nasa.gov/3M5UuKB",
    "Happy #TeacherAppreciationWeek! Our thanks go out to the teachers and educators who work tirelessly to elevate the next generation of explorers.\n\nJoin us this week for live webinars and ready-to-use resources from \n@NASASTEM\n and \n@DoNASAScience\n: https://go.nasa.gov/3NOWmZu",
    "Two storm-observing TROPICS small satellites lifted off on a \n@RocketLab\n Electron rocket, with two more to follow this month. This marks the first completed launch for a \n@NASA_LSP\n contract designed to increase access to space for science and tech missions. https://go.nasa.gov/44QozFo",
    "Two TROPICS CubeSats successfully deployed from a \n@RocketLab\n Electron rocket after launch. Signal acquisition from the pair of \n@NASAEarth\n small satellites may take some time to establish, which is not unexpected.\n\nWe'll provide confirmation when signal is acquired:… Show more",
    "We have final engine cutoff of \n@RocketLab\n's Curie engine on #RocketLikeAHurricane carrying two TROPICS CubeSats.  \n\nExpected Payload Deployment!   \n\nIt will take several orbits to confirm signal. Follow along for more mission updates! http://blogs.nasa.gov/smallsatellites/…",
    "Liftoff! Two TROPICS shoebox-sized satellites are on their way to join the fleet of \n@NASAEarth\n missions studying our home planet. Together, TROPICS will have the potential to gather near-hourly data on the formation and development of tropical cyclones.",
    "LIVE: Watch two small satellites for our storm tracking TROPICS mission launch to orbit. Liftoff on a \n@RocketLab\n Electron rocket is targeted at 9pm ET (0100 UTC May 8), with a two-hour window.",
    "NASA and \n@RocketLab\n are targeting 9pm ET Sunday, May 7 (0100 May 8 UTC), for the first launch of our cyclone-studying TROPICS CubeSats.\n\nTune in here and at http://nasa.gov/live at 8:40pm ET (0040 May 8 UTC) for live launch coverage from New Zealand: https://go.nasa.gov/42xYE3n",
    "A new habitat is prepped for volunteers to test living in Mars-like conditions for a year, \n@NASAWebb\n detects signs of water vapor on a distant planet, and we celebrate #BlackHoleWeek—that’s what’s up This Week at NASA. \n\nWrap up the celebration with us: https://go.nasa.gov/44B3u1j",
    "Today, \n@VP\n and \n@President_KR\n toured \n@NASAGoddard\n for a close-up look at how we study our changing planet—and got a glimpse of \n@NASARoman\n, our next space telescope, as it's being built: https://go.nasa.gov/3mXIRf3",
    "Not too hot, not too cold.\n\nNo, not April 25. It's what \n@NASAExoplanets\n scientists call the habitable zone of a star—the range where liquid water could exist on a planet's surface: https://go.nasa.gov/41FqY3w",
    " LIVE: \n@VP\n Kamala Harris & \n@President_KR\n Yoon Suk Yeol deliver remarks during their tour of \n@NASAGoddard\n to see our climate change research.",
    "The first of two TROPICS launches will send cyclone-tracking CubeSats to low Earth orbit from New Zealand. The launch window opens at 9pm ET April 30 (0100 UTC May 1).\n\nA second launch is planned for May 16 to complete the constellation: http://go.nasa.gov/3Ax7aDG",
    "We did it together. Thanks to you, we're bringing home five People's Voice Awards in this year's #Webbys.\n\nFrom \n@NASAWebb\n's first images to \n@NASA_Eyes\n's interactive map of the asteroids, check out our full set of Webby winners: https://go.nasa.gov/3n7iNOw",
    "People travel to national parks every year to be surrounded by the beauty of nature. #NationalParkWeek\n\nNational parks seen from space are just as beautiful. Maybe more? \n\nYou be the judge. https://go.nasa.gov/4449VtO",
    "What's your favorite \n@NASAHubble\n image? http://bit.ly/3NauIG3\n\nLaunched 33 years ago today, the orbiting telescope captured this image of a nebula where stars are born -- 960 light-years away. http://go.nasa.gov/3VizSlr"
]