[
    "Lil X just asked if there are police cats, since there are police dogs ",
    "Congratulations to Giga Shanghai & Tesla China SDS teams for their excellent work overcoming many obstacles over many years!!",
    "38 astronauts to orbit so far!",
    "The space laser mesh is what enabled Starlink coverage for critical infrastructure, schools, and communities across the 169 island nation of Tonga in the South Pacific Ocean after it was hit by a tsunami last year ",
    "Falcon 9 launches 52 \n@Starlink\n satellites to orbit, completing this first stage booster’s 14th launch and landing",
    "Congratulations Neuralink team!",
    "Starlink helping to connect schools in Rwanda ",
    "I recommend subscribing to \n@shellenberger",
    "Starlink on Siargao Island in the Philippines  \n\n: \n@buddhasiargao",
    "",
    "I hope this platform increasingly brings you joy & elucidation",
    "Falcon 9 and Dragon vertical at 39A; targeting Sunday, May 21 at 5:37 p.m. ET for launch of Ax-2 → http://spacex.com/launches/mission/?missionId=ax-2…",
    "Over one-third of secondary schools and two-thirds of primary schools around the world are not connected to the internet.\n\nOn the isolated island of Pangan-an in the Philippines, Starlink was set up to support 700+ elementary and high school students → http://sunstar.com.ph/article/1961567/cebu/local-news/satellite-connects-isolated-cebu-island-to-the-internet…… Show more",
    "Walter is incredibly thorough in his research. Highly recommend his other books!",
    "Happens a lot",
    "Was the Internet Archive manipulated for nepotistic reasons?",
    "You asked (loudly), we listened.\n\nWe’ve reduced the signup flow for creators from 27 steps to just 4.\n\nIt’s never been easier to earn a living on Twitter. Tap on “Monetization” in settings to apply today.",
    "One-third of humanity remains offline, and many users only have basic connectivity.\n\nThe Ministry of Education in El Salvador—among many others around the world—is installing Starlink in schools to help close the digital divide ",
    "I am excited to welcome Linda Yaccarino as the new CEO of Twitter!\n\n\n@LindaYacc\n will focus primarily on business operations, while I focus on product design & new technology.\n\nLooking forward to working with Linda to transform this platform into X, the everything app.",
    "Raptor V3 just achieved 350 bar chamber pressure (269 tons of thrust). Congrats to \n@SpaceX\n propulsion team!\n\nStarship Super Heavy Booster has 33 Raptors, so total thrust of 8877 tons or 19.5 million pounds.",
    "When you have Starlink on your ship, not only can you stay connected while on the vast majority of the Earth’s oceans and seas, but apparently it’s also easier to find sunken treasure → http://yachtworld.com/research/yacht-wifi-revolutionizes-sunken-treasure-discovery/…",
    "As soon as \n@LindaYacc\n is ready, we will do a Spaces where you can ask us anything",
    "As seen by an unaffected third party",
    "Wow",
    "The most entertaining outcome is the most likely",
    "economic enema en route",
    "Powerwall now available in Spain →",
    "Say goodbye to prying eyes and hello to secure conversations. We're giving early access to Encrypted Direct Messages v1 to our verified users.\n\nWe're excited to get feedback, improve the experience, and roll it out to even more users. Learn more:",
    "Excited to announce that I’ve hired a new CEO for X/Twitter. She will be starting in ~6 weeks!\n\nMy role will transition to being exec chair & CTO, overseeing product, software & sysops.",
    "For my part, I just want to support content creators, whether or not they provide extra content when you subscribe"
]