[
    "Edufuture Excellence Awards",
    "Siliguri Mango Festival: West Bengal Farmers Grow World's Most Expensive Mango, It Is Priced At..",
    "Partygate: Boris Johnson Resigns As UK Lawmaker With Immediate Effect Over Partygate Report",
    "WTC 2023 Final: From India's Top Order Failure To Steve Smith's Century, All About WTC | Day 2",
    "Why Is ICC Preparing Two Pitches In The Oval Stadium? | WTC Finals | Rohit Sharma | Pat Cummins",
    "Angry Rohit Sharma's Reaction After Controversial Third Umpire Call - Watch",
    "At Madhu Mantena And Ira Trivedi's Starry Mehendi, Aamir Khan, Hrithik Arrive",
    "'Cheater, Cheater...', Green Trends On Twitter As Gill Given Out",
    "Who's Arifa Jan, Kashmiri Enterpreneur Behind Reviving Traditional Namda Craft",
    "Viral Video: Shah Rukh Khan Greets Ocean Of Fans Outside Mannat - Watch",
    "Pawar Names Supriya, Praful Patel As NCP Working Presidents; Ajit Sidelined",
    "Meet IPS Officer Navjot Simi: Doctor Who Became Top Cop Of Bihar",
    "When Will Jasprit Bumrah Make Comeback? Dinesh Karthik Gives Major Update",
    "Modi In US: What Is A State Visit, What Are Different Types Of Foreign Visits?",
    "'Don't Panic': Akhilesh's Scathing Attack At BJP Over 'Soft Hindutva' Jibe",
    "IAS vs IPS - Who Is More Powerful? Detailed Explaination Here",
    "india vs australia wtc final 2023",
    "IND 164-3 (40) | IND VS AUS: India Need 280 Runs With 7 Wickets In Hand",
    "Maruti Suzuki Jimny Deliveries Begin, Owners Share Videos On Internet",
    "JioTag Launched In India: Track Your Belongings With Ease, Know Its Cost",
    "Relief For Home Buyers! RBI MPC keeps repo rate unchanged; maintains withdrawal of accommodation",
    "News Wrap: Modi's Meet With Biden With To Green's Controversial Catch- In Pics",
    "2023 Range Rover Autobiography Review: Design, Features, Performance- IN PICS",
    "Top 5 Bizarre Pre-Batting Antics Of Cricketers - In Pics",
    "Biparjoy To Turn Into Extremely Severe Cyclonic Storm. Will It Hit Gujarat?",
    "PM Narendra Modi - Joe Biden’s Relationship So Far: A Brief Overview",
    "MK Stalin's Challenge To Amit Shah: 'List Work Done By Modi Govt For TN'",
    "Blast At Pharma Factory Near Mumbai, 1 Killed, 4 Hurt",
    "10 Unique Celebrity Baby Names",
    "Top 10 Places To Visit In Bhutan",
    "Top 10 Highest Grossing Marvel Movies Of All Time",
    "11 Foods To Avoid During Pregnancy",
    "From Gabba To Port Of Spain, Top 5 Highest 4th Innings Chase By India In Test Cricket",
    "10 Must Visit Places In Nepal",
    "5 Wedding Trends For Every Summer Bride",
    "10 Indian Baby Boy Names With Meanings From Alphabet G",
    "5 Easy Makeup Tips From Shehnaaz Gill's Vanity",
    "Horoscope Today, June 10 By Astro Sundeep Kochar: Pisces, Be Swift Today",
    "Horoscope Today, June 9 By Astro Sundeep Kochar: Taurus, Focus On Your Work",
    "John Abraham, Shahid Kapoor To Dino Morea - Bollywood Hotties Who Are Legit Bike Lovers",
    "Who Is 'Sholay Girl' Reshma Pathan? India’s Best Dancer Season 3 Honours Her",
    "Meet Rakshitha Reddy, The Ravishing Wife Of Telugu Star Sharwanand - Pics",
    "Varun Tej Lavanya Tripathi Engagement",
    "As Varun Tej, Lavanya Tripathi Get Engaged, Ram Charan And Wife Shower Love",
    "Arjun Rampal's Hot Fierce Avatar In Bhagavanth Kesari Teaser Is Unmissable",
    "Tiger Shroff Updates Fans About Ganapath, Says 'Will Be Worth Your Wait'",
    "India's Best Dancer 3 Team Celebrates 25 Years Of 'Chaiyya Chaiyya'",
    "Veteran Actor Gufi Paintal Dies Of Heart Failure In Mumbai Due To Heart Failure",
    "Manoj Bajpayee Talks About His Favourite Moments While Shooting Sirf Ek Bandaa Kaafi Hai",
    "IIFA 2023: Vicky Kaushal Gets A Hug From Salman Khan, Shares The Truth Behind The Viral Video",
    "LIVE-1 Inning |10-14GERMANY VS BELGIUMGERVS 0/0BELGermany elected to field",
    "UPCOMINGKENYA VS BOTSWANAKENVSBOTSun, 11 Jun (06:30 GMT|12:00 IST)",
    "UPCOMINGCZECH REPUBLIC VS HUNGARYCZEVSHUNSun, 11 Jun (07:30 GMT|13:00 IST)",
    "UPCOMINGGERMANY VS BELGIUMGERVSBELSun, 11 Jun (08:00 GMT|13:30 IST)",
    "UPCOMINGRWANDA VS UGANDARWAVSUGASun, 11 Jun (10:30 GMT|16:00 IST)",
    "MATCH ENDED | 10-14KENYA VS UGANDAKEN 185/3VS 97UGAKenya beat Uganda by 88 runs",
    "MATCH ENDED | 10-14GERMANY VS BELGIUMGER 181/5VS 179/9BELGermany beat Belgium by 5 wickets",
    "MATCH ENDED | 10-14RWANDA VS BOTSWANARWA 134VS 169/2BOTBotswana beat Rwanda by 35 runs",
    "MATCH ENDED | 09-13GERMANY VS BELGIUMGER 174/7VS 168/9BELGermany beat Belgium by 6 runs",
    "IND: 164-3 (40) | IND VS AUS WTC Final, Day 5: All Eyes On Kohli And Rahane",
    "How Many Runs Can Team India Chase Down In 4th Innings Of WTC Final?",
    "Watch: Yadav's Wild Celebration After Taking Wicket Of Labuschagne Goes Viral",
    "CSK Star Ruturaj Gaikwad Marries Utkarsha Pawar, Shares Pics From Wedding Ceremony; See Here",
    "Happy Birthday Wasim Akram: Top 6 Records Which Belong Exclusively To 'Sultan Of Swing'",
    "Neeraj Chopra Pulls Out Of Paavo Nurmi Games 2023",
    "'I'm So Excited For...', Heat's Butler On Lionel Messi Playing For Inter Miami",
    "Man City vs Inter Milan Champions League Final: Check Live Streaming Details",
    "Who Is 'World's Sexiest Athlete' Alica Schmidt, who went viral for THIS Reason",
    "French Open 2023: Novak Djokovic Advances To Roland Garros Final",
    "WTC 2023 Final: Best Memes After Team India's Poor Batting Show On Day 2 Of WTC 2023",
    "WTC 2023 Final: Mohammed Siraj and Steve Smith Engage In A Combative Exchange",
    "Smith's Record Ton To Rahane's Landmark Catch: TOP Records From WTC Final",
    "John Abraham, Shahid Kapoor To Dino Morea - B-Town Actors Who Are Bike Lovers",
    "Travis Head's Ton To Steve Smith's Fifty: TOP Records After Day 1 Of WTC Final",
    "2023 Range Rover Autobiography Review: Design, Features, Performance, Price - IN PICS",
    "Modified Volkswagen Virtus 1.0L TSI With Stage-2 Tune Is As Peppy As 1.0L TSI",
    "Air India Sats Introduces AeroWash, India’s First Aircraft Dry Washing Robot",
    "Mahindra CEO Teases BE.05 Electric SUV, Shares Picture Of EV's Interior",
    "Air India Aircraft Stranded In Russia Flies Out From Magadan To Mumbai",
    "Meet 2023 Range Rover Autobiography: Design, Feature, Price",
    "Meet zPod, India's 'first autonomous car' unveiled in Bengaluru",
    "Honda Elevate Review: Can This Mid Size SUV Dominate Hyundai Creta, Maruti Suzuki Grand Vitara?",
    "Tata Altroz iCNG First Drive Review: Enough Trunk To Put Rivals At Rest?",
    "International Women’s Day 2022: Check out the top tech gifts for your girlfriend or wife",
    "Upgrad’s Ad Campaign’s Uncanny Resemblance To Sundar Pichai Irks Netizens",
    "Meta 'Talking' To Oprah Winfrey, Dalai Lama To Explore Its Twitter-Like App",
    "Microsoft Launches Voice Chat Feature To AI-Powered Bing Chat",
    "OpenAI CEO Sam Altman Says India's ChatGPT Attempt Is 'Hopeless'",
    "WhatsApp, Facebook Messenger To Get AI-Generated Stickers",
    "DNA: When Nano Technology started in 1959",
    "Playing video games can boost brain development, behaviour in children: Research",
    "Indian hackers take part in the \"Olympics of hacking\" tournament in Las Vegas",
    "Alia Bhatt To Priyanka Chopra: Bollywood's Newest, Coolest, And Most Fashionable Moms - In Pics",
    "High Blood Sugar Control: 5 Yoga Asanas To Check Diabetes - In Pics",
    "Nora Fatehi's Summer Wardrobe: 7 Times Diva Flirted With Floral Prints - In Pics",
    "Vikram Bhatt's Daughter Krishna's Mehendi Pic Goes Viral, Wedding on June 11",
    "Vidya Balan Remembers Pradeep Sarkar As ‘Parineeta’ Turns 18",
    "10 Beauty Ingredients You Must Add To Your SkinCare Routine For Glowing Skin",
    "Toxic Relationship: 5 Behavioural Warning Indicators Of An Abusive Marriage",
    "Super hot Anushka Sen looks hot stunning in frock have a look",
    "Hot actress Reem Sameer flaunts her backless sexy blouse video goes viral",
    "Mahima Makwana looks hot flaunts her sexy curvy figure in dazzling saree",
    "NASA Announces Artemis II Mission Crew, Names First Woman, Black Astronauts",
    "It's 'A Cosmic Superbloom'; NASA Shares Picture of Rare Phase of Star",
    "Aditya L-1: All About ISRO's First Solar Mission",
    "10 Deadliest Animals Found in India and Other Countries Across World",
    "Are You Taking The Right Supplements? Check Expert Tips And Risk Factors",
    "The Benefits Of Yoga and A Natural Diet: A Path To A Healthier You",
    "Boosting Metabolism: 7 Ways To Stay Fit And Healthy After 30",
    "What Too Much Sugar Can Do To Your Digestive System - Expert Explains",
    "NExT Mandatory For Foreign Medical Graduates; Will It Replace NEET PG?",
    "Live| AP ICET 2023 Result: Manabadi Rank Cards To Be Out SOON, Check Updates",
    "CSBC Recruitment: Over 21,000 Vacancies For Constable Posts Announced",
    "IIT Guwahati To Release JEE Advanced 2023 Answer Key On June 11",
    "26/11 Terror Attack: World Jewish Congress joins Indian govt to mourn victims",
    "Bangladesh SHOCKER: Married man beheads lover, cuts body into three pieces",
    "Cyclone Sitrang: 13 dead in Bangladesh; heavy rains wreak havoc in Assam",
    "22 dead from Russian strike on Ukraine’s Chernihiv"
]