[
    "Edufuture Excellence Awards",
    "Siliguri Mango Festival: West Bengal Farmers Grow World's Most Expensive Mango, It Is Priced At..",
    "Partygate: Boris Johnson Resigns As UK Lawmaker With Immediate Effect Over Partygate Report",
    "WTC 2023 Final: From India's Top Order Failure To Steve Smith's Century, All About WTC | Day 2",
    "Why Is ICC Preparing Two Pitches In The Oval Stadium? | WTC Finals | Rohit Sharma | Pat Cummins",
    "Petrol, Diesel Prices Hiked By AAP-Led Punjab Government; Check Latest Rates",
    "Who Is Amrudeen Sheik Dawood Sahib? Meet The Man Who Built Mini Taj Mahal",
    "Ranbir Kapoor Unleashes The Roar Of 'Animal' In Pre-Teaser - Watch",
    "Odisha Train Tragedy: No Trains To Stop At Bahanaga Bazar As CBI Seals Station",
    "'Buniyaad' Actor Mangal Dhillon Passes Away After Battling Cancer",
    "Best-Selling Cars In India: Maruti Suzuki Baleno, Tata Nexon, And More",
    "Meet Ira Trivedi, The Sizzling Wife-To-Be Of Bollywood Producer Madhu Mantena",
    "Vote Counting LIVE | Bihar Municipal Election Result 2023: Result Declared",
    "Kapil Sibal Joins Kejriwal In Fight Against Centre's Ordinance",
    "Despite Karnataka Assembly Poll Drubbing, BJP Remains A Divided House",
    "india vs australia wtc final 2023",
    "IND: 213-7 (58) | IND VS AUS WTC Final: Shardul Thakur Departs, India 7 Down",
    "Meet Ratan Tata's Brother Who Lives In A 2 BHK Flat, Doesn't Even Own A Mobile",
    "Watch: Anushka's Reaction To Kohli's Dismissal Goes Viral As Smith Takes Catch",
    "Why Did A Dreaded ULFA Lieutenant Give Up His Weapon To Become Entrepreneur?",
    "Relief For Home Buyers! RBI MPC keeps repo rate unchanged; maintains withdrawal of accommodation",
    "Horoscope Today, June 11 By Astro Sundeep Kochar: Gemini, Meet your Friends",
    "News Wrap: Modi's Meet With Biden With To Green's Controversial Catch- In Pics",
    "2023 Range Rover Autobiography Review: Design, Features, Performance- IN PICS",
    "Top Most Mad, Cruelest Monarchs Of World In Ancient History",
    "Meet Simran Bala, J&K's First Woman To Crack UPSC CAPF This Year",
    "Telangana Election 2023: BJP Shifts Focus On Telugu States",
    "Shocking Forced Conversion In Delhi: Youths Offered Rs 1 Lakh/Month, Govt Jobs",
    "Not Ambani, Tata, This Is Google's India Rival Whom ChatGPT CEO Met",
    "10 Easy Ways To Get Rid Of Dark Circles",
    "10 Best Books For Holiday Reading",
    "10 Beauty Tips For Teen Girls",
    "10 Places To Visit Allahabad Prayagaraj",
    "AI Pics Of World Leaders Like Modi, Trump, Obama In Baby Avatar Go Viral",
    "AI Artist Imagines Virat Kohli In Various Professions",
    "10 Power Of IPS Officer India",
    "10 Best Indian Foods For Reducing High Cholesterol",
    "Weekly Love & Relationship Horoscope For June 11 To June 17",
    "Horoscope Today, June 11 By Astro Sundeep Kochar: Gemini, Get Back To Your Social Cycle",
    "Horoscope Today, June 10 By Astro Sundeep Kochar: Pisces, Be Swift Today",
    "Horoscope Today, June 9 By Astro Sundeep Kochar: Taurus, Focus On Your Work",
    "Sanjay Kapoor Opens Up About His Character In Shahid Kapoor's 'Bloody Daddy'",
    "Director Sudipto Sen Comes On Board For Subrata Roy Biopic 'Saharasri'",
    "Who Is 'Sholay Girl' Reshma Pathan? India’s Best Dancer Season 3 Honours Her",
    "Meet Rakshitha Reddy, The Ravishing Wife Of Telugu Star Sharwanand - Pics",
    "Varun Tej Lavanya Tripathi Engagement",
    "As Varun Tej, Lavanya Tripathi Get Engaged, Ram Charan And Wife Shower Love",
    "Veteran Actor Gufi Paintal Dies Of Heart Failure In Mumbai Due To Heart Failure",
    "Manoj Bajpayee Talks About His Favourite Moments While Shooting Sirf Ek Bandaa Kaafi Hai",
    "IIFA 2023: Vicky Kaushal Gets A Hug From Salman Khan, Shares The Truth Behind The Viral Video",
    "LIVE-4 Inning |07-11AUSTRALIA VS INDIAAUS 270/8 469VS 213/7 296IND",
    "LIVE-2 Inning |11-15CZECH REPUBLIC VS HUNGARYCZE 169/4VS 169HUN",
    "LIVE-2 Inning |11-15GERMANY VS BELGIUMGER 13/0VS 148/9BEL",
    "LIVE-1 Inning |11-15RWANDA VS UGANDARWA 44/4VSUGA",
    "UPCOMINGCZECH REPUBLIC VS HUNGARYCZEVSHUNSun, 11 Jun (12:30 GMT|18:00 IST)",
    "UPCOMINGBOTSWANA VS RWANDABOTVSRWATue, 13 Jun (06:30 GMT|12:00 IST)",
    "UPCOMINGWEST INDIES VS SCOTLANDWIVSSCOTue, 13 Jun (07:00 GMT|12:30 IST)",
    "UPCOMINGZIMBABWE VS OMANZIMVSOMATue, 13 Jun (07:00 GMT|12:30 IST)",
    "MATCH ENDED | 11-15KENYA VS BOTSWANAKEN 98/2VS 92/8BOTKenya beat Botswana by 8 wickets",
    "MATCH ENDED | 10-14GERMANY VS BELGIUMGER 167/6VS 164BELGermany beat Belgium by 4 wickets",
    "MATCH ENDED | 10-14KENYA VS UGANDAKEN 185/3VS 97UGAKenya beat Uganda by 88 runs",
    "Who Is The Best Sledger In Indian Cricket Team? Ravindra Jadeja Answers",
    "'Fortunate To Have...,' Chahal Pens Heartfelt Note For Dhoni, Kohli And Rohit",
    "Watch: Fan's Love Takes Center Stage At WTC Final As He Scores A Proposal",
    "Asia Cup 2023 To Be Played In Pakistan And Sri Lanka: Report",
    "Sehwag, Jaffer Troll Umpires After Shubman Gill's Controversial Dismissal",
    "WTC 2023 Final: Virat Kohli Joins Sachin Tendulkar, Rahul Dravid In Elite List",
    "WTC: 'Show Correct Angle,' Fans React As ICC Shares Pics Of Green's Catch",
    "CSK Star Ruturaj Gaikwad Marries Utkarsha Pawar, Shares Pics From Wedding Ceremony; See Here",
    "Happy Birthday Wasim Akram: Top 6 Records Which Belong Exclusively To 'Sultan Of Swing'",
    "French Open Final 2023: Djokovic vs Ruud LIVE Streaming Details",
    "Watch: French Open Trophy's Lid Drops After Iga Swiatek Celebrates Her Third W",
    "Man City Are Champions Of Europe As They Clinch Historic CL Title For 1st Time",
    "Neeraj Chopra Pulls Out Of Paavo Nurmi Games 2023",
    "'I'm So Excited For...', Heat's Butler On Lionel Messi Playing For Inter Miami",
    "Man City vs Inter Milan Champions League Final: Check Live Streaming Details",
    "WTC 2023 Final: From Australia setting daunting Target To Virat-Rahane Partnership | WTC | Day 4",
    "Top 5 Bizarre Pre-Batting Antics Of Cricketers - In Pics",
    "Smith's Record Ton To Rahane's Landmark Catch: TOP Records From WTC Final",
    "John Abraham, Shahid Kapoor To Dino Morea - B-Town Actors Who Are Bike Lovers",
    "2023 Range Rover Autobiography Review: Design, Features, Performance, Price - IN PICS",
    "Air India Begins Second Mumbai-Mangaluru Daily Flight Services",
    "Delta Airlines Flight's Air Slide Opens Inside Plane, Injures Crew Member",
    "IndiGo Flight Strays Into Pakistan Amid Inclement Weather: Report",
    "Indian Railways Services To Be Colour Coded In Lucknow Division: Read Details",
    "Meet zPod, India's 'first autonomous car' unveiled in Bengaluru",
    "Honda Elevate Review: Can This Mid Size SUV Dominate Hyundai Creta, Maruti Suzuki Grand Vitara?",
    "Tata Altroz iCNG First Drive Review: Enough Trunk To Put Rivals At Rest?",
    "International Women’s Day 2022: Check out the top tech gifts for your girlfriend or wife",
    "Twitter Is Refusing To Pay Its Google Cloud Bills - Platformer",
    "LinkedIn Introduces AI Copy Suggestion Feature For Ad Creatives",
    "WhatsApp Rolling Out New Interface For Group Settings Screen On iOS",
    "JioTag Launched In India: Track Your Belongings With Ease, Know Its Cost",
    "Upgrad’s Ad Campaign’s Uncanny Resemblance To Sundar Pichai Irks Netizens",
    "DNA: When Nano Technology started in 1959",
    "Playing video games can boost brain development, behaviour in children: Research",
    "Indian hackers take part in the \"Olympics of hacking\" tournament in Las Vegas",
    "Alia Bhatt To Priyanka Chopra: Bollywood's Newest, Coolest, And Most Fashionable Moms - In Pics",
    "High Blood Sugar Control: 5 Yoga Asanas To Check Diabetes - In Pics",
    "Nora Fatehi's Summer Wardrobe: 7 Times Diva Flirted With Floral Prints - In Pics",
    "Sensitive Skin Care Routine",
    "7 Tips To Take Care Of Sensitive Skin During Summers",
    "Shraddha Kapoor Is Excited For 'Her Season,' Shares Stunning Pics Of Monsoon",
    "Wedding Bells For Gehna Vasisth And Faizan Ansari? Here's What We Know",
    "Priyanka Chopra Performs Puja With Daughter On Father's Death Anniversary",
    "Super hot Anushka Sen looks hot stunning in frock have a look",
    "Hot actress Reem Sameer flaunts her backless sexy blouse video goes viral",
    "Mahima Makwana looks hot flaunts her sexy curvy figure in dazzling saree",
    "NASA Announces Artemis II Mission Crew, Names First Woman, Black Astronauts",
    "It's 'A Cosmic Superbloom'; NASA Shares Picture of Rare Phase of Star",
    "Aditya L-1: All About ISRO's First Solar Mission",
    "10 Deadliest Animals Found in India and Other Countries Across World",
    "Why Do We Crave 'Comfort Food' When Chronically Stressed? Study Explains",
    "How Does Hot Weather Affect The Heart And Brain? Check Symptoms & Diagnosis",
    "High BP: Cause And Cure For Common Type Of Hypertension, Reveals Study",
    "India Is Seeing A Rise In Hypertension And Diabetes: Check Expert Opinion",
    "Who Is Navniet Sekera: The IPS Officer Who Inspired Web Series 'Bhaukaal'?",
    "NExT Mandatory For Foreign Medical Graduates; Will It Replace NEET PG?",
    "Live| AP ICET 2023 Result: Manabadi Rank Cards To Be Out SOON, Check Updates",
    "CSBC Recruitment: Over 21,000 Vacancies For Constable Posts Announced",
    "26/11 Terror Attack: World Jewish Congress joins Indian govt to mourn victims",
    "Bangladesh SHOCKER: Married man beheads lover, cuts body into three pieces",
    "Cyclone Sitrang: 13 dead in Bangladesh; heavy rains wreak havoc in Assam",
    "22 dead from Russian strike on Ukraine’s Chernihiv"
]