[
    "Edufuture Excellence Awards",
    "From Lionel Messi To David Beckham: Top Footballers Who Played In the United States League",
    "Relief For Home Buyers! RBI MPC keeps repo rate unchanged; maintains withdrawal of accommodation",
    "Gitanjali Iyer, 1st English News Presenter Of The Country, Passes Away",
    "Gun Violence: Two dead after gunman opens fire at Virginia high school graduation",
    "Why Is ICC Preparing Two Pitches In The Oval Stadium? | WTC Finals | Rohit Sharma | Pat Cummins",
    "Shanaya Kapoor's Electrifying Dance Goes Viral, Fans Call Her Katrina Kaif",
    "india vs australia wtc final 2023",
    "IND: 151-5 (38) | IND VS AUS WTC Final Day 3: Watch Out For Boland And Cummins",
    "To Nayanthara, A Heartwarming Wedding Anniversary Post From Vignesh Shivan",
    "Gavaskar Slams Kohli's Technique After Sorry Show In 1st Innings of WTC Final",
    "Who Is UPSC Topper Muktendra Kumar, The Son Of A Poor Brick Kiln Worker",
    "Walking Vs Treadmill: Which Should Be Your Choice Of Exercise? Expert Explains",
    "Paytm pioneered QR Code payments tagged as ‘one of India's Biggest Achievement",
    "How A Trip To Bali Changed The Lives Of This Couple? Earning 18L Per Month",
    "Why Modi Says Thank You To Mohammed Bin Salman, Crown Prince Of Saudi Arabia?",
    "Weather Update: Heavy Rainfall In Kerala, Karnataka, Severe Heatwave In Bihar",
    "Who Is Pratik Doshi, A Key PM Modi Aide Who Married FM Nirmala's Daughter?",
    "ICC ODI World Cup And Asia Cup To Be Available For FREE On Livestream",
    "Who Is Manoj Sane, The Mira Road Monster Who Killed, Boiled His Lover?",
    "Fire Breaks Out In AC Coach On Durg-Puri Express In Odisha; Video Surfaces",
    "Meet zPod, India's 'first autonomous car' unveiled in Bengaluru",
    "Smith's Record Ton To Rahane's Landmark Catch: TOP Records From WTC Final",
    "Horoscope Today, June 9 By Astro Sundeep Kochar: Taurus, Focus On Your Work",
    "John Abraham, Shahid Kapoor To Dino Morea - B-Town Actors Who Are Bike Lovers",
    "Who Is Prof. Balaram And Dr. Ashutosh, Who Will Be Awarded Prestigious Award?",
    "Kejriwal Wanted Navjot Singh Sidhu To Lead Punjab, Claims Sidhu's Wife",
    "Delhi Latest breaking news",
    "No Cognizable Offence Of Hate Speech Made Out Against Wrestlers, DC To Court",
    "Birsa Munda Jayanti 2023: Know All About This Legendary Freedom Fighter",
    "10 Medicinal Plants And Their Uses",
    "10 Largest Egg Producer Countries In The World",
    "Top 10 Places To Visit In Kerala",
    "10 TOP Wicket-takers In T20 Cricket History",
    "8 Superfoods To Eat After 50",
    "10 Super Foods To Have During PCOS",
    "10 Baby Names For Twin Boys With Meanings",
    "10 Countries With Fastest Mobile Internet",
    "10 Must Visit Places In Kashmir - 'The Heaven On Earth'",
    "John Abraham, Shahid Kapoor To Dino Morea - Bollywood Hotties Who Are Legit Bike Lovers",
    "Horoscope Today, June 8 By Astro Sundeep Kochar: Libra, You Will Be In A Love Bubble",
    "Chiranjeevi Leaves Fans Excited With BTS Video From ‘Bholaa Shankar’ Shoot",
    "Akshay Kumar Turns Into Lord Shiva In OMG 2 First Look, Reveals Release Date",
    "Rishab Shetty Wishes Kantara's Leela Aka Sapthami Gowda On Her Birthday",
    "Bigg Boss OTT 2 Highest Paid Contestants: Anjali Arora Charging Huge Fees?",
    "Gadar: Ek Prem Katha Re-Release: Makers Announce Buy-1-Get-1 Free Offer",
    "Veteran Actor Gufi Paintal Dies Of Heart Failure In Mumbai Due To Heart Failure",
    "Manoj Bajpayee Talks About His Favourite Moments While Shooting Sirf Ek Bandaa Kaafi Hai",
    "IIFA 2023: Vicky Kaushal Gets A Hug From Salman Khan, Shares The Truth Behind The Viral Video",
    "LIVE-2 Inning |07-11AUSTRALIA VS INDIAAUS 469VS 151/5INDIndia trail by 318 runs",
    "LIVE-1 Inning |09-13KENYA VS RWANDAKENVS 134/9RWARwanda elected to bat",
    "UPCOMINGBOTSWANA VS UGANDABOTVSUGAFri, 09 Jun (10:30 GMT|16:00 IST)",
    "UPCOMINGUNITED ARAB EMIRATES VS WEST INDIESUAEVSWIFri, 09 Jun (12:30 GMT|18:00 IST)",
    "UPCOMINGRWANDA VS BOTSWANARWAVSBOTSat, 10 Jun (06:30 GMT|12:00 IST)",
    "UPCOMINGKENYA VS UGANDAKENVSUGASat, 10 Jun (10:30 GMT|16:00 IST)",
    "MATCH ENDED | 04-8SRI LANKA VS AFGHANISTANSL 323/6VS 191AFGSri Lanka beat Afghanistan by 132 runs",
    "Sunil Gavaskar Slams India’s Top Order Collapse In WTC Final",
    "ICC ODI World Cup 2023 To Be Announced SOON, CEO Allardice Gives Big Update",
    "WATCH: Rishabh Pant’s Instagram Post Exudes Unwavering Support For Team India",
    "WATCH: Shubman Gill Left Shocked After Shouldering Arms To Get Bowled On Day 2",
    "Kohli Gets Trolled As Pictures Of Batter Having Food After Dismissal Go Viral",
    "CSK Star Ruturaj Gaikwad Marries Utkarsha Pawar, Shares Pics From Wedding Ceremony; See Here",
    "Happy Birthday Wasim Akram: Top 6 Records Which Belong Exclusively To 'Sultan Of Swing'",
    "French Open 2023: Unseeded Muchova To Face World No 1 Iga Swiatek In Final",
    "French Open 2023: World No.1 Swiatek Books Semifinal Berth With Win Over Gauff",
    "How Apple And Adidas Got Lionel Messi To Pick Inter Miami Over FC Barcelona",
    "Lionel Messi To Pele: TOP Footballers Who Played In United States",
    "Lionel Messi Move To Inter Miami Stuns Football World After Exit From PSG",
    "Lionel Messi Set To Join Inter Miami After Parting Ways With PSG",
    "WTC 2023 Final: Ajinkya Rahane's Top 3 Test Knocks Vs Australia | Zee News English",
    "Travis Head's Ton To Steve Smith's Fifty: TOP Records After Day 1 Of WTC Final",
    "Horoscope Today, June 8 By Astro Sundeep Kochar: Libra, You'll Be In Love",
    "Janhvi-Khushi To Alia-Shaheen - Bollywood's Most Stunning Sister Duos",
    "Weight Loss: 5 Low-Calorie Foods That Will Make You Feel Full All Day Long",
    "Horoscope Today, June 7 By Astro Sundeep Kochar: Capri, Good company Is Key",
    "Tata Altroz iCNG First Drive Review: Design, Features, Specs, Boot Space - IN PICS",
    "Sourav Ganguly Buys New Mercedes-Benz GLS Luxury SUV Worth Rs 1.29 Crore",
    "SpiceJet To Induct 10 Boeing 737 Narrow-Body Aircraft, Launch New Routes",
    "Delhi Airport: UP Man On Dubai-Bound Vistara Flight Arrested Over Bomb Threat",
    "Delhi Airport: Passengers At IGI T3 Can Use DigiYatra Facility Without App",
    "Go First Extends Flight Cancellation Till June 12 Citing 'Operational Reasons'",
    "Honda Elevate Review: Can This Mid Size SUV Dominate Hyundai Creta, Maruti Suzuki Grand Vitara?",
    "Tata Altroz iCNG First Drive Review: Enough Trunk To Put Rivals At Rest?",
    "International Women’s Day 2022: Check out the top tech gifts for your girlfriend or wife",
    "WhatsApp To Roll Out HD Photo Feature Soon",
    "Asus Zenfone 10 Global Launch On June 29 — All You Need To Know",
    "Instagram Down For Thousands Of Users, Netizens Share Hilarious Memes",
    "Get Apple iPhone 14 Plus At Just Rs 50,000 On Amazon Sale",
    "All You Need To Know About The Government's Free Bot Removal Tools",
    "WhatsApp Launches New Feature 'Channels' For Broadcast Messages",
    "DNA: When Nano Technology started in 1959",
    "Playing video games can boost brain development, behaviour in children: Research",
    "Indian hackers take part in the \"Olympics of hacking\" tournament in Las Vegas",
    "Alia Bhatt To Priyanka Chopra: Bollywood's Newest, Coolest, And Most Fashionable Moms - In Pics",
    "High Blood Sugar Control: 5 Yoga Asanas To Check Diabetes - In Pics",
    "Nora Fatehi's Summer Wardrobe: 7 Times Diva Flirted With Floral Prints - In Pics",
    "Sonam Kapoor Turns 38: 10 Top Picks From Diva’s Family Album",
    "Samantha Ruth Prabhu Juggles Between Kushi Sets And Citadel India Shoot",
    "Meet AI Artist Abhishek Golecha, Who Worked On Sonakshi Sinha's Nail Brand",
    "Peer Recognition Initiatives Can Make Employees Feel Mistreated: Study",
    "Sonnalli Seyggal Ashesh Sajnani Wedding",
    "Viral Video: Sonnalli Seyggal, Ashesh Sajnani's Glittering Wedding Reception",
    "Super hot Anushka Sen looks hot stunning in frock have a look",
    "Hot actress Reem Sameer flaunts her backless sexy blouse video goes viral",
    "Mahima Makwana looks hot flaunts her sexy curvy figure in dazzling saree",
    "NASA Announces Artemis II Mission Crew, Names First Woman, Black Astronauts",
    "It's 'A Cosmic Superbloom'; NASA Shares Picture of Rare Phase of Star",
    "Aditya L-1: All About ISRO's First Solar Mission",
    "10 Deadliest Animals Found in India and Other Countries Across World",
    "Drinking Beetroot Juice Associated With Reducing Risk Of Heart Attack: Study",
    "Physical Exercise May Decrease Risk Of Type 2 Diabetes: Study",
    "Covid-19 Virus Can Fuse Cells Leading To Brain Fog, Headaches: Study",
    "JEE Advanced 2023: Response Sheets To Release Today, Results On June 18",
    "Live | NEET UG Result 2023: NTA To Release NEET Result Anytime- Direct Link",
    "Who Is Taruni Pandey? A Jharkhand Girl Who Uses YouTube To Pass UPSC CSE Exam",
    "CHSE Odisha 12th Arts Result 2023: Odisha +2 Arts Results Declared",
    "26/11 Terror Attack: World Jewish Congress joins Indian govt to mourn victims",
    "Bangladesh SHOCKER: Married man beheads lover, cuts body into three pieces",
    "Cyclone Sitrang: 13 dead in Bangladesh; heavy rains wreak havoc in Assam",
    "22 dead from Russian strike on Ukraine’s Chernihiv"
]