[
    "Edufuture Excellence Awards",
    "Ban On Hitler’s Nazi Symbol In Australia, How Is Nazi Symbol Different From Hindu's Swastika?",
    "School Students Scared To Join The School Where Bodies Of The Train Accident Victims Were Kept",
    "WTC 2023 Final: Mohammed Siraj and Steve Smith Engage In A Combative Exchange",
    "WTC 2023 Final: From India's Top Order Failure To Steve Smith's Century, All About WTC | Day 2",
    "Why Is ICC Preparing Two Pitches In The Oval Stadium? | WTC Finals | Rohit Sharma | Pat Cummins",
    "Asaduddin Owaisi Slams Devendra Fadnavis Over 'Aurangzeb Ki Aulaad' Remarks",
    "How A Trip To Bali Changed The Lives Of This Couple? Earning 18L Per Month",
    "'My Best Is....', Rahane's Old Statement Goes Viral After Comeback Fifty",
    "Walking Vs Treadmill: Which Should Be Your Choice Of Exercise? Expert Explains",
    "Paytm pioneered QR Code payments tagged as ‘one of India's Biggest Achievement",
    "Modern Lifestyle Major Factor For Increasing Diabetes Cases In Goa: Expert",
    "No Ball Trends On Twitter As Pat Cummins' Overstepping Saves Indian Batters",
    "MS Dhoni's CSK Teammate Matheesha Pathirana Included In Sri Lanka Team",
    "Congress Dismisses Reports Of Sachin Pilot Floating A New Party As 'Rumours'",
    "A Former Delhi Maths Instructor Who Is Now A \"Symbol Of Hope\" For Wildlife",
    "Viral Video: 2 Delhi Metro Commuters Prevent Doors From Closing Using Feet",
    "Scammers Trick Car Owners With Fake RSA Cards:",
    "india vs australia wtc final 2023",
    "AUS: 22/1 (10) | IND VS AUS WTC Final: Australia Lead Nearing 200 Mark",
    "Rev Up Your Savings: Maruti Suzuki Unveils Unbeatable Deals On Arena Cars",
    "From Lionel Messi To David Beckham: Top Footballers Who Played In the United States League",
    "Relief For Home Buyers! RBI MPC keeps repo rate unchanged; maintains withdrawal of accommodation",
    "Gitanjali Iyer, 1st English News Presenter Of The Country, Passes Away",
    "Smith's Record Ton To Rahane's Landmark Catch: TOP Records From WTC Final",
    "Horoscope Today, June 9 By Astro Sundeep Kochar: Taurus, Focus On Your Work",
    "John Abraham, Shahid Kapoor To Dino Morea - B-Town Actors Who Are Bike Lovers",
    "Who Is IAS Niyaz Khan, Pro-Brahmin Officer Who Wants Muslims To Go Vegetarian?",
    "Who Is Justice Vivek Aggarwal? Who Has Thousands Of Social Media Followers",
    "WTC 2023 Final: Meet Shardul Thakur's Gorgeous Wife Mittali Parulkar",
    "Bollywood Movies That Have Food In Their Names",
    "10 Side Effects Of Overeating Mangoes",
    "8 Cars With Huge Discounts In June 2023",
    "10 Health Benefits of Dragon Fruit",
    "Realme 11 Pro 5G Launched In India: Check Price, Specifications, Flipkart Offers, And More",
    "8 Side Effects Of Electronic Smoking You Must Know",
    "ICC Finals Won By 8 Test Playing Nations",
    "10 Most Expensive Flowers In The World",
    "John Abraham, Shahid Kapoor To Dino Morea - Bollywood Hotties Who Are Legit Bike Lovers",
    "Horoscope Today, June 8 By Astro Sundeep Kochar: Libra, You Will Be In A Love Bubble",
    "Zara Hatke Zara Bachke: Vicky Kaushal, Sara Ali Khan's Film Earns Rs 37.35 Cr",
    "‘Pathaan’ To Release In Russia And CIS Countries On This Date",
    "Chiranjeevi Leaves Fans Excited With BTS Video From ‘Bholaa Shankar’ Shoot",
    "To Nayanthara, A Heartwarming Wedding Anniversary Post From Vignesh Shivan",
    "Akshay Kumar Turns Into Lord Shiva In OMG 2 First Look, Reveals Release Date",
    "Rishab Shetty Wishes Kantara's Leela Aka Sapthami Gowda On Her Birthday",
    "Veteran Actor Gufi Paintal Dies Of Heart Failure In Mumbai Due To Heart Failure",
    "Manoj Bajpayee Talks About His Favourite Moments While Shooting Sirf Ek Bandaa Kaafi Hai",
    "IIFA 2023: Vicky Kaushal Gets A Hug From Salman Khan, Shares The Truth Behind The Viral Video",
    "LIVE-3 Inning |07-11AUSTRALIA VS INDIAAUS 22/1 469VS 296IND",
    "LIVE-1 Inning |09-13UNITED ARAB EMIRATES VS WEST INDIESUAE 150/3VSWI",
    "UPCOMINGRWANDA VS BOTSWANARWAVSBOTSat, 10 Jun (06:30 GMT|12:00 IST)",
    "UPCOMINGGERMANY VS BELGIUMGERVSBELSat, 10 Jun (08:30 GMT|14:00 IST)",
    "UPCOMINGKENYA VS UGANDAKENVSUGASat, 10 Jun (10:30 GMT|16:00 IST)",
    "UPCOMINGCZECH REPUBLIC VS HUNGARYCZEVSHUNSat, 10 Jun (13:00 GMT|18:30 IST)",
    "MATCH ENDED | 09-13BOTSWANA VS UGANDABOT 115VS 116/4UGAUganda beat Botswana by 6 wickets",
    "MATCH ENDED | 09-13KENYA VS RWANDAKEN 139/7VS 137/9RWAKenya beat Rwanda by 3 wickets",
    "Who Is Scott Boland, Australia Pacer Who Dismissed Shubman Gill With A Peach",
    "ICC World Test Championships 2023",
    "A Look At Rohit Sharma's Record In ICC Knockouts; Only 2 Tons In 16 Innings",
    "Watch: Shardul Thakur Hit Twice By Pat Cummins' Fiery Deliveries",
    "How Can Team India Make Comeback In WTC Final Vs Australia?",
    "CSK Star Ruturaj Gaikwad Marries Utkarsha Pawar, Shares Pics From Wedding Ceremony; See Here",
    "Happy Birthday Wasim Akram: Top 6 Records Which Belong Exclusively To 'Sultan Of Swing'",
    "French Open 2023: Unseeded Muchova To Face World No 1 Iga Swiatek In Final",
    "French Open 2023: World No.1 Swiatek Books Semifinal Berth With Win Over Gauff",
    "How Apple And Adidas Got Lionel Messi To Pick Inter Miami Over FC Barcelona",
    "Lionel Messi To Pele: TOP Footballers Who Played In United States",
    "Lionel Messi Move To Inter Miami Stuns Football World After Exit From PSG",
    "Lionel Messi Set To Join Inter Miami After Parting Ways With PSG",
    "WTC 2023 Final: Best Memes After Team India's Poor Batting Show On Day 2 Of WTC 2023",
    "Travis Head's Ton To Steve Smith's Fifty: TOP Records After Day 1 Of WTC Final",
    "Horoscope Today, June 8 By Astro Sundeep Kochar: Libra, You'll Be In Love",
    "Janhvi-Khushi To Alia-Shaheen - Bollywood's Most Stunning Sister Duos",
    "Weight Loss: 5 Low-Calorie Foods That Will Make You Feel Full All Day Long",
    "Horoscope Today, June 7 By Astro Sundeep Kochar: Capri, Good company Is Key",
    "Tata Altroz iCNG First Drive Review: Design, Features, Specs, Boot Space - IN PICS",
    "Anushka Ranjan, Aditya Seal Buy New Mercedes-Benz E-Class Worth Rs 75 Lakh",
    "Maruti Suzuki Jimny vs Mahindra Thar: Top 5 Features That 3-Door SUV Lacks",
    "Sourav Ganguly Buys New Mercedes-Benz GLS Luxury SUV Worth Rs 1.29 Crore",
    "SpiceJet To Induct 10 Boeing 737 Narrow-Body Aircraft, Launch New Routes",
    "Delhi Airport: UP Man On Dubai-Bound Vistara Flight Arrested Over Bomb Threat",
    "Delhi Airport: Passengers At IGI T3 Can Use DigiYatra Facility Without App",
    "Meet zPod, India's 'first autonomous car' unveiled in Bengaluru",
    "Honda Elevate Review: Can This Mid Size SUV Dominate Hyundai Creta, Maruti Suzuki Grand Vitara?",
    "Tata Altroz iCNG First Drive Review: Enough Trunk To Put Rivals At Rest?",
    "International Women’s Day 2022: Check out the top tech gifts for your girlfriend or wife",
    "Work From Office Or Risk Your Performance Review At Google",
    "Disney+ Hotstar To Offer ICC Men's World Cup & Asia Cup 2023 For Free In India",
    "WhatsApp To Roll Out HD Photo Feature Soon",
    "Asus Zenfone 10 Global Launch On June 29 — All You Need To Know",
    "DNA: When Nano Technology started in 1959",
    "Playing video games can boost brain development, behaviour in children: Research",
    "Indian hackers take part in the \"Olympics of hacking\" tournament in Las Vegas",
    "Alia Bhatt To Priyanka Chopra: Bollywood's Newest, Coolest, And Most Fashionable Moms - In Pics",
    "High Blood Sugar Control: 5 Yoga Asanas To Check Diabetes - In Pics",
    "Nora Fatehi's Summer Wardrobe: 7 Times Diva Flirted With Floral Prints - In Pics",
    "Who is Lady Ambani Of Bollywood? She Has Special Connection With Suniel Shetty",
    "Aa Gaya Pakistan Ka Damaad: Gadar 2 Teaser Starts With Powerful Dialogue",
    "Salman's Uber Luxurious Farm House Is Everyone's Dream:Things You Want To Know",
    "Salman Khan Bodyguard Shera - Popularity, Salary Comparison With IITs and IIMs",
    "Kajol Takes A Break From Social Media, Writes 'Facing Toughest Trials...'",
    "Sonam Kapoor Turns 38: 10 Top Picks From Diva’s Family Album",
    "Super hot Anushka Sen looks hot stunning in frock have a look",
    "Hot actress Reem Sameer flaunts her backless sexy blouse video goes viral",
    "Mahima Makwana looks hot flaunts her sexy curvy figure in dazzling saree",
    "NASA Announces Artemis II Mission Crew, Names First Woman, Black Astronauts",
    "It's 'A Cosmic Superbloom'; NASA Shares Picture of Rare Phase of Star",
    "Aditya L-1: All About ISRO's First Solar Mission",
    "10 Deadliest Animals Found in India and Other Countries Across World",
    "Over 300 Million Indians Suffer From Hypertension: ICMR Study",
    "Drinking Beetroot Juice Associated With Reducing Risk Of Heart Attack: Study",
    "ICAI CA Foundation 2023 June Exam Admit Card Released At icai.org, Direct Link",
    "JEE Advanced 2023: Response Sheets To Release Today, Results On June 18",
    "Live | NEET UG Result 2023: NTA To Release NEET Result ANYTIME- Direct Link",
    "Who Is Taruni Pandey? A Jharkhand Girl Who Uses YouTube To Pass UPSC CSE Exam",
    "26/11 Terror Attack: World Jewish Congress joins Indian govt to mourn victims",
    "Bangladesh SHOCKER: Married man beheads lover, cuts body into three pieces",
    "Cyclone Sitrang: 13 dead in Bangladesh; heavy rains wreak havoc in Assam",
    "22 dead from Russian strike on Ukraine’s Chernihiv"
]