{
  "status": "ok",
  "totalResults": 585,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "VOA News"
      },
      "author": "VOA Learning English",
      "title": "Researchers Identify Owner of Ancient Siberian Jewelry - VOA Learning English",
      "description": "A new way of pulling out DNA from objects permitted scientists to learn about the owner of a piece of jewelry from 20,000 years ago.",
      "url": "https://learningenglish.voanews.com/a/researchers-identify-owner-of-ancient-siberian-jewelry/7081076.html",
      "urlToImage": "https://gdb.voanews.com/8c9a1743-3237-4ef4-83ef-7342b72010d6_cx0_cy50_cw0_w1200_r1.jpg",
      "publishedAt": "2023-05-14T21:55:04Z",
      "content": "A new way of pulling DNA from soft materials such as bones, teeth and tusks makes it easier for scientists to find out about objects made by ancient people.\r\nAs a result, researchers are working to l… [+2964 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "YouTube"
      },
      "author": null,
      "title": "A closer look at the novel celestial events thrilling scientists this month - PBS NewsHour",
      "description": "It's been an exciting time for astronomers, astrophysicists and other scientists who specialize in deciphering the far reaches of space. Since the beginning ...",
      "url": "https://www.youtube.com/watch?v=0n1-vpCVSgE",
      "urlToImage": "https://i.ytimg.com/vi/0n1-vpCVSgE/maxresdefault.jpg",
      "publishedAt": "2023-05-14T21:31:26Z",
      "content": null
    },
    {
      "source": {
        "id": null,
        "name": "Fox Business"
      },
      "author": "Bradford Betz",
      "title": "SpaceX launches 56 new Starlink satellites, lands rocket at sea - Fox Business",
      "description": "SpaceX launched a batch of 56 Starlink satellites into orbit early Sunday from the Cape Canaveral Space Force Station in Florida and successfully landed a rocket in the sea.",
      "url": "https://www.foxbusiness.com/technology/spacex-launches-56-new-starlink-satellites-lands-rocket-sea",
      "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2023/04/0/0/launch.jpg?ve=1&tl=1",
      "publishedAt": "2023-05-14T21:11:10Z",
      "content": "SpaceX recorded another successful mission early Sunday after launching a new batch of Starlink satellites into orbit and landing a rocket at sea. \r\nA Falcon 9, carrying 56 Starlink spacecraft, launc… [+1070 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "SciTechDaily"
      },
      "author": null,
      "title": "Potentially Impacting Development – Preterm Infants Do Not Get Used to Repeated Pain - SciTechDaily",
      "description": "According to a study led by researchers from University College London (UCL), preterm infants do not habituate to repeated pain in the same way as full-term infants, children, and adults. The authors of the new study published in the journal Current Biology s…",
      "url": "https://scitechdaily.com/potentially-impacting-development-preterm-infants-do-not-get-used-to-repeated-pain/",
      "urlToImage": "https://scitechdaily.com/images/Infant-Pain-Headache.jpg",
      "publishedAt": "2023-05-14T20:02:08Z",
      "content": "ByUniversity College LondonMay 14, 2023\r\nRecent research has revealed that preterm infants do not habituate, or get used to, repeated pain in the same way as full-term infants, children, and adults. … [+5386 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "SciTechDaily"
      },
      "author": null,
      "title": "A Cutting-Edge Diamond Sensor for Neutron Experiments and Quantum Information Science - SciTechDaily",
      "description": "The University of Illinois Urbana-Champaign's nuclear physics group is participating in the nEDM experiment at Oak Ridge National Laboratory, aiming to measure the neutron's electric dipole moment to constrain theories in particle physics. The researchers aim…",
      "url": "https://scitechdaily.com/a-cutting-edge-diamond-sensor-for-neutron-experiments-and-quantum-information-science/",
      "urlToImage": "https://scitechdaily.com/images/Nitrogen-Vacancy-Diamond-Sensor.jpg",
      "publishedAt": "2023-05-14T19:15:39Z",
      "content": "Artists rendering illustrates the nitrogen-vacancy diamond sensor the Beck group will develop. The internal grid lines represent the path of laser light within the diamondthe incoming beam (thicker r… [+2246 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "OilPrice.com"
      },
      "author": "Brian Westenhaus",
      "title": "Photosynthesis Research Opens New Avenues For Renewable Energy - OilPrice.com",
      "description": "Researchers have applied artificial photosynthesis as the basis for developing new sustainable processes.",
      "url": "https://oilprice.com/Alternative-Energy/Renewable-Energy/Photosynthesis-Research-Opens-New-Avenues-For-Renewable-Energy.html",
      "urlToImage": "https://d32r1sh890xpii.cloudfront.net/article/718x300/2023-05-12_koxwkpc6ju.jpg",
      "publishedAt": "2023-05-14T19:00:00Z",
      "content": "While China and Europe have…\r\nETH Zurich researchers are working…\r\nAramco's plan for blue hydrogen…\r\nBy Brian Westenhaus - May 14, 2023, 2:00 PM CDTTechnical University of Munich (TUM) researchers us… [+4372 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Ynetnews"
      },
      "author": "Yogev Israely",
      "title": "Book-shaped rock photographed on Mars - Ynetnews",
      "description": "Curiosity rover photographs a rock on Mars called Terra Firme, which is shaped like an open book, formed naturally by erosion due to water seeping through crevices and powerful winds",
      "url": "https://www.ynetnews.com/health_science/article/r1s5sva42",
      "urlToImage": "https://ynet-pic1.yit.co.il/picserver5/crop_images/2023/05/11/rk48gAvcN3/rk48gAvcN3_0_0_1000_659_0_large.jpg",
      "publishedAt": "2023-05-14T18:30:09Z",
      "content": "NASA's Curiosity Mars rover took a close-up picture of a rock nicknamed Terra Firme, whose shape resembles an open book. The picture was taken with a specialized camera called the Mars Hand Lens Imag… [+1928 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Forbes"
      },
      "author": "Jennifer Kite-Powell",
      "title": "See How This AI Prototype Can Detect Asian Hornets And Protect Bees - Forbes",
      "description": "Pollenize and Encord partnered to develop an Asian Hornet device that could help save bees in the UK. The prototye device uses artificial intelligence and computer vision to detect Asian Hornets and notify authorities.",
      "url": "https://www.forbes.com/sites/jenniferhicks/2023/05/14/see-how-this-ai-prototype-can-detect-asian-hornets-and-protect-bees/",
      "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/64611ada45143ca23758caf8/0x0.jpg?format=jpg&width=1200",
      "publishedAt": "2023-05-14T17:57:08Z",
      "content": "A White-tailed bumblebee collects nectar on 8.8.2022, Knutsford, England. Honey bees play a vital ... [+] role in the pollination of the food we eat but changing weather, increased land use, imported… [+6372 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "SciTechDaily"
      },
      "author": null,
      "title": "This Week @NASA: Webb's Surprising Look at Fomalhaut's Asteroid Belt, TROPICS CubeSats Launched - SciTechDaily",
      "description": "A spacecraft changes parking spots at the space station … A surprising look at a star in another solar system … And small satellites that could be a big help tracking tropical storms … A few of the stories to tell you about – This Week at NASA! https://youtu.…",
      "url": "https://scitechdaily.com/this-week-nasa-webbs-surprising-look-at-fomalhauts-asteroid-belt-tropics-cubesats-launched/",
      "urlToImage": "https://scitechdaily.com/images/Two-Planetesimals-Colliding.jpg",
      "publishedAt": "2023-05-14T17:36:28Z",
      "content": "ByNASAMay 14, 2023\r\nThis artists illustration depicts a collision of two icy, dusty bodies orbiting the bright star Fomalhaut, located 25 light-years away. This may have caused an expanding cloud of … [+5393 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NASASpaceflight.com"
      },
      "author": "William Graham",
      "title": "Skylab at 50 – How the United States entered the space station era - NASASpaceFlight.com - NASASpaceflight.com",
      "description": "On May 14, 1973, the final Saturn V rocket lifted off to deploy Skylab, America’s…",
      "url": "https://www.nasaspaceflight.com/2023/05/skylab-at-50/",
      "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2023/05/skylab-crop.jpg",
      "publishedAt": "2023-05-14T17:18:27Z",
      "content": "5On May 14, 1973, the final Saturn V rocket lifted off to deploy Skylab, America’s first space station. Despite a troubled start to its life, Skylab pioneered long-duration spaceflight, and fifty yea… [+19702 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Tech Explorist"
      },
      "author": "Dr. Prajakta Banik",
      "title": "Exploring the human retina: A detailed look - Tech Explorist",
      "description": "A new atlas illustrates how the human retina is developing.",
      "url": "https://www.techexplorist.com/exploring-human-retina-detailed-look/60225/",
      "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/retinal-organoid.jpg",
      "publishedAt": "2023-05-14T17:13:59Z",
      "content": "The human retina is a complex and vital part of the eye that plays a crucial role in our ability to see. Researchers from Basel and Zurich are currently working on creating a high-resolution atlas fo… [+2641 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Universe Today"
      },
      "author": "Paul M. Sutter",
      "title": "Black Holes Might be Defects in Spacetime - Universe Today",
      "description": "A team of theoretical physicists have discovered strange structures that would be defects in the very fabric of the universe.",
      "url": "https://www.universetoday.com/161291/black-holes-might-be-defects-in-spacetime/",
      "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/01/gw170104.jpg",
      "publishedAt": "2023-05-14T17:09:02Z",
      "content": "A team of theoretical physicists have discovered a strange structure in space-time that to an outside observer would look exactly like a black hole, but upon closer inspection would be anything but: … [+2771 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Phys.Org"
      },
      "author": "Brad E Tucker",
      "title": "How fast is the universe really expanding? Multiple views of an exploding star raise new questions - Phys.org",
      "description": "How did we get here? Where are we going? And how long will it take? These questions are as old as humanity itself, and, if they've already been asked by other species elsewhere in the universe, potentially very much older than that.",
      "url": "https://phys.org/news/2023-05-fast-universe-multiple-views-star.html",
      "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/how-fast-is-the-univer.jpg",
      "publishedAt": "2023-05-14T16:40:01Z",
      "content": "How did we get here? Where are we going? And how long will it take? These questions are as old as humanity itself, and, if they've already been asked by other species elsewhere in the universe, poten… [+6090 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "SciTechDaily"
      },
      "author": null,
      "title": "Google Quantum AI Braids Non-Abelian Anyons – A Breakthrough That Could Revolutionize Quantum Computing - SciTechDaily",
      "description": "Google Quantum AI has observed non-Abelian anyons for the first time, a breakthrough that could revolutionize quantum computing by making it more robust to noise and leading to topological quantum computation. Our intuition tells us that it should be impossib…",
      "url": "https://scitechdaily.com/?p=277928",
      "urlToImage": "https://scitechdaily.com/images/Non-Abelian-Braiding.jpg",
      "publishedAt": "2023-05-14T16:25:01Z",
      "content": "ByGoogle Quantum AIMay 14, 2023\r\nResearchers were able to observe the curious effects of braiding non-Abelian anyons for the first time. Credit: Google Quantum AI\r\nGoogle Quantum AI has observed non-… [+5697 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Freethink.com"
      },
      "author": "Ömer F. Bodur",
      "title": "Supercomputers revealed giant “pillars of heat” funnelling diamonds upwards from deep within Earth - Freethink",
      "description": "Understanding Earth’s internal history can be used to target mineral reserves – not only diamonds, but also crucial minerals.",
      "url": "https://www.freethink.com/science/kimberlites-diamonds",
      "urlToImage": "https://www.freethink.com/wp-content/uploads/2023/05/tahlia-doyle-R13RJX_V42A-unsplash-e1684081020377.jpg?resize=1200,630",
      "publishedAt": "2023-05-14T16:23:35Z",
      "content": null
    },
    {
      "source": {
        "id": null,
        "name": "SpaceNews"
      },
      "author": "Jeff Foust",
      "title": "Astroscale and Momentus offer concept for reboosting Hubble - SpaceNews",
      "description": "Two companies have disclosed details about how they could raise the orbit of the Hubble Space Telescope as NASA evaluates that and other concepts.",
      "url": "https://spacenews.com/astroscale-and-momentus-offer-concept-for-reboosting-hubble/",
      "urlToImage": "https://spacenews.com/wp-content/uploads/2021/07/hubble-sts125release.jpg",
      "publishedAt": "2023-05-14T16:01:22Z",
      "content": "WASHINGTON Two companies have disclosed details about how they could raise the orbit of the Hubble Space Telescope as NASA evaluates that and other concepts offered to the agency.\r\nAstroscale and Mom… [+4347 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Theglobestalk.com"
      },
      "author": "https://m.facebook.com/theglobestalk/?ref=bookmarks",
      "title": "New Stunning Image Revealed Intense Activity Near a Supermassive Black Hole - The Globe's Talk",
      "description": "The Event Horizon Telescope (EHT) team revealed the first radio picture of M87’s core black hole in May 2022. It was an incredible discovery based on",
      "url": "https://theglobestalk.com/new-stunning-image-revealed-intense-activity-near-a-supermassive-black-hole/",
      "urlToImage": "https://theglobestalk.com/wp-content/uploads/2023/05/images-1-2.jpeg",
      "publishedAt": "2023-05-14T15:24:15Z",
      "content": "The Event Horizon Telescope (EHT) team revealed the first radio picture of M87s core black hole in May 2022. It was an incredible discovery based on observations made with a global network of radio t… [+4529 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Phys.Org"
      },
      "author": "Shi Dai et al.",
      "title": "Flip-flopping magnetic fields hint at a solution for puzzling fast radio bursts from space - Phys.org",
      "description": "Fast radio bursts—intense, milliseconds-long flashes of radio energy from outer space—have puzzled astronomers since they were first spotted in 2007. A single burst can emit as much energy in its brief life as the Sun does in a few days.",
      "url": "https://phys.org/news/2023-05-flip-flopping-magnetic-fields-hint-solution.html",
      "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/flip-flopping-magnetic.jpg",
      "publishedAt": "2023-05-14T15:20:01Z",
      "content": "Fast radio burstsintense, milliseconds-long flashes of radio energy from outer spacehave puzzled astronomers since they were first spotted in 2007. A single burst can emit as much energy in its brief… [+4610 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "SciTechDaily"
      },
      "author": null,
      "title": "Revolutionary Stretchable OLED Display Bends and Expands – “An Entirely New Display Technology” - SciTechDaily",
      "description": "Researchers have developed a highly flexible and stretchable digital display material that emits a fluorescent pattern. The material, which can bend in half and stretch to more than twice its original length, has potential applications in wearable electronics…",
      "url": "https://scitechdaily.com/revolutionary-stretchable-oled-display-bends-and-expands-an-entirely-new-display-technology/",
      "urlToImage": "https://scitechdaily.com/images/Stretchable-OLED-Display.jpg",
      "publishedAt": "2023-05-14T15:15:46Z",
      "content": "ByUniversity of ChicagoMay 14, 2023\r\nA material developed by Asst. Prof. Sihong Wang and Prof. Juan de Pablo can stretch more than twice its original length without disrupting its ability to emit lig… [+7035 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "SYFY WIRE"
      },
      "author": "Cassidy Ward",
      "title": "The First Spark of Life on Earth May Have Come from the Sun - Syfy",
      "description": "Super solar flares hitting the early Earth could have created prebiotic molecules, sparking origin of life.",
      "url": "https://www.syfy.com/syfy-wire/the-first-spark-of-life-on-earth-may-have-come-from-the-sun",
      "urlToImage": "https://www.syfy.com/sites/syfy/files/2020/02/frankenstein.jpg",
      "publishedAt": "2023-05-14T15:00:03Z",
      "content": "Mary Shelleys Frankenstein remains one of the most influential and definitive pieces of science fiction, more than two centuries after it was first published. The Monster has appeared in more than 75… [+5210 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "ZME Science"
      },
      "author": "Fermin Koop",
      "title": "Scientists finally confirm what's inside the Moon – and it's not cheese - ZME Science",
      "description": "That's one mystery about the Moon we can take off of the list.",
      "url": "https://www.zmescience.com/space/what-is-inside-moon/",
      "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2023/05/1024px-The_Moon_August_11_2019.jpg",
      "publishedAt": "2023-05-14T14:46:17Z",
      "content": "For many years prior to spacecraft landing on the moon, astronomers have been perplexed by its structure. In the first half of the 20th century, there was a discussion regarding whether the moon was … [+3084 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Phys.Org"
      },
      "author": "Bob Yirka",
      "title": "Polarized optical emission from tidal disruption found to be caused by colliding streams of material from a star - Phys.org",
      "description": "A team of space scientists from Finland, Greece and the U.S. has found evidence showing that polarized optical emissions observed during a tidal disruption event were caused by colliding streams of material from a destroyed star. In their study, reported in t…",
      "url": "https://phys.org/news/2023-05-polarized-optical-emission-tidal-disruption.html",
      "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/polarized-optical-emis.jpg",
      "publishedAt": "2023-05-14T14:10:01Z",
      "content": "A team of space scientists from Finland, Greece and the U.S. has found evidence showing that polarized optical emissions observed during a tidal disruption event were caused by colliding streams of m… [+2501 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Post Magazine"
      },
      "author": null,
      "title": "Chinese scientists develop cutting-edge tech for 3D ceramic printing in the air - South China Morning Post",
      "description": "Jiangnan University team creates new printing paste and improved curing technique to enhance 3D printing efficiency and remove need for support structures.",
      "url": "https://www.scmp.com/news/china/science/article/3220513/chinese-scientists-develop-cutting-edge-tech-3d-ceramic-printing-air-create-complex-engineering",
      "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2023/05/14/9fcde0fd-ed5d-49d2-8910-a0cb7c5295e0_8a44936f.jpg?itok=Ueq9-ZNF&v=1684050465",
      "publishedAt": "2023-05-14T14:00:12Z",
      "content": "Published: 10:00pm, 14 May, 2023\r\nUpdated: 10:00pm, 14 May, 2023"
    },
    {
      "source": {
        "id": null,
        "name": "SciTechDaily"
      },
      "author": null,
      "title": "Carbon Neutral Biochemicals: Transforming CO2 Into Valuable Materials Using Formic Acid - SciTechDaily",
      "description": "Scientists at the Max Planck Institute have created a synthetic metabolic pathway that converts carbon dioxide into formaldehyde via formic acid, offering a carbon-neutral method for producing valuable materials. New synthetic metabolic pathways for the fixat…",
      "url": "https://scitechdaily.com/carbon-neutral-biochemicals-transforming-co2-into-valuable-materials-using-formic-acid/",
      "urlToImage": "https://scitechdaily.com/images/Formate-Carbon-Neutral-Bioeconomy-scaled.jpg",
      "publishedAt": "2023-05-14T13:34:59Z",
      "content": "ByMax Planck Institute for Terrestrial MicrobiologyMay 14, 2023\r\nFormate can be envisioned at the core of a carbon-neutral bioeconomy, where it is produced from CO2 by (electro-)chemical means and co… [+6223 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Sportskeeda"
      },
      "author": "Ashim",
      "title": "What is a supernova? Details revealed as astronomers witness the largest cosmic explosion 10 times brighter than any explosion of a star - Sportskeeda",
      "description": "Astronomers have recently witnessed the largest-ever cosmic explosion and named the event AT2021lwx. It is said to have been 10 times brighter than any known supernova.",
      "url": "https://www.sportskeeda.com/pop-culture/what-supernova-details-revealed-astronomers-witness-largest-cosmic-explosion-10-times-brighter-explosion-star",
      "urlToImage": "https://staticc.sportskeeda.com/editor/2023/05/57ecb-16840690410093-1920.jpg",
      "publishedAt": "2023-05-14T13:32:00Z",
      "content": "Astronomers have recently witnessed the largest-ever cosmic explosion and named the event AT2021lwx. It is said to have been 10 times brighter than any known supernova. For those unfamiliar with the … [+2862 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Interesting Engineering"
      },
      "author": "Loukia Papadopoulos",
      "title": "Chinese team invents new family of metallic compounds - Interesting Engineering",
      "description": "A multi-institute research team based in China has fabricated a novel family of metallic compounds, each of which exhibit unique properties desirable for next-generation technologies.",
      "url": "https://interestingengineering.com/innovation/chinese-team-invents-new-family-of-metallic-compounds",
      "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/05/14/image/jpeg/3hCLX2oLKfmqWPOkYmfdKD4a7gerXGW5m3z9sNMw.jpg",
      "publishedAt": "2023-05-14T13:31:00Z",
      "content": "Ligands have the unique ability to stabilize the structure of the complexes because they bond to a metal atom. As such, the researchers used hydrolysis to breakdown lanthanides in a bath containing a… [+1639 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Sakshipost.com"
      },
      "author": "Sakshi Post",
      "title": "Saturn beats other planets with most number of moons in solar system - Sakshi Post",
      "description": "Toronto, May 14 (IANS) An international team of astronomers has discovered 62 new moons orbiting Saturn, taking the total number...",
      "url": "https://www.sakshipost.com/news/saturn-beats-other-planets-most-number-moons-solar-system-189334",
      "urlToImage": "https://www.sakshipost.com/sites/default/files/article_images/2023/05/14/4eca324e4c24d6192110df7d7663444e-1684069501.jpg",
      "publishedAt": "2023-05-14T13:05:01Z",
      "content": "Toronto, May 14 (IANS) An international team of astronomers has discovered 62 new moons orbiting Saturn, taking the total number to 145.\r\nThe planet is back into first place in the Solar System's 'mo… [+2450 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Gizmodo.com"
      },
      "author": "Chris Impey",
      "title": "AI Is Speeding Up Astronomical Discoveries - Gizmodo",
      "description": "Artificial intelligence has begun helping astronomers tame massive data sets and uncover their secrets, writes a University of Arizona astronomy professor.",
      "url": "https://gizmodo.com/ai-chatgpt-astronomy-discoveries-harvard-astrobert-1850418252",
      "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/59d3171c6cb215103cfcc7936121fc84.jpg",
      "publishedAt": "2023-05-14T13:00:00Z",
      "content": "The famous first image of a black hole just got two times sharper. A research team used artificial intelligence to dramatically improve upon its first image from 2019, which now shows the black hole … [+6912 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Interesting Engineering"
      },
      "author": "Amal Jos Chacko",
      "title": "Membrane technology inspired by milk reaction could revolutionize wearables - Interesting Engineering",
      "description": "This simple, yet effective process can rapidly create 2D ionogel membranes which could be used in batteries and wearable tech.",
      "url": "https://interestingengineering.com/innovation/membrane-technology-inspired-by-milk-reaction-could-revolutionize-wearables",
      "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/05/14/image/jpeg/bTCCsa47Wk7mvHsgr7OuYC9R5uMJAhPsUKNQxlFM.jpg",
      "publishedAt": "2023-05-14T12:22:00Z",
      "content": "By dipping sustainable biomass materials in certain solvents in a dip-and-peel process, their molecules rearrange themselves into thin films at the edge of the material, creating two-dimensional iono… [+2097 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Indian Express"
      },
      "author": "New York Times",
      "title": "How Deep-Diving Sharks Stay Warm Will Take Your Breath Away - The Indian Express",
      "description": "To survive as they seek food in freezing parts of the ocean, hammerhead sharks use a trick that hasn’t been observed in other fish.",
      "url": "https://indianexpress.com/article/explained/explained-sci-tech/how-deep-diving-sharks-stay-warm-will-take-your-breath-away-8608948/",
      "urlToImage": "https://images.indianexpress.com/2023/05/Hammerhead-shark-final.jpg",
      "publishedAt": "2023-05-14T12:12:44Z",
      "content": "Hammerhead sharks like it warm, but for a good meal theyre willing to get cold. The flat-headed predators dive more than 2,600 feet from tropical surface waters into the oceans frigid depths multiple… [+3810 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Www.geo.tv"
      },
      "author": "Web Desk",
      "title": "Scientists criticise Nasa for halting Kuiper Belt mission - Geo News",
      "description": "Scientists could not reach Kuiper Belt due to its remote distance therefore New Horizons was built to get there",
      "url": "https://www.geo.tv/latest/487370-scientists-criticise-nasa-for-halting-kuiper-belt-mission",
      "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-05-14/487370_041522_updates.jpg",
      "publishedAt": "2023-05-14T11:44:00Z",
      "content": "A dispute has arisen between US space officials and scientists after Nasa decided to halt funding of New Horizons spacecraft that was designed to carry out a study of the Kuiper Belt regarding the de… [+3466 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "YouTube"
      },
      "author": null,
      "title": "Blastoff! SpaceX launches 56 Starlink satellites, nails landing at sea - VideoFromSpace",
      "description": "A SpaceX Falcon 9 rocket launched 56 Starlink satellites from Cape Canaveral Space Force Station in Florida on May 14, 2023 at 1:03 a.m. EDT (0503 GMT). Full...",
      "url": "https://www.youtube.com/watch?v=RtWKTkvpMQY",
      "urlToImage": "https://i.ytimg.com/vi/RtWKTkvpMQY/maxresdefault.jpg",
      "publishedAt": "2023-05-14T11:26:46Z",
      "content": null
    },
    {
      "source": {
        "id": null,
        "name": "Hackaday"
      },
      "author": "Joseph Long",
      "title": "Artemis II Will Phone Home From The Moon Using Laser Beams - Hackaday",
      "description": "[NASA] Astronauts will be testing the Orion Artemis II Optical Communications System (O2O) to transmit live, 4K ultra-high-definition video back to Earth from the Moon. The system will also support…",
      "url": "https://hackaday.com/2023/05/14/artemis-ii-will-phone-home-from-the-moon-using-laser-beams/",
      "urlToImage": "https://hackaday.com/wp-content/uploads/2023/05/Artemis-2-Laser.png",
      "publishedAt": "2023-05-14T11:00:00Z",
      "content": "[NASA] Astronauts will be testing the Orion Artemis II Optical Communications System (O2O) to transmit live, 4K ultra-high-definition video back to Earth from the Moon. The system will also support c… [+1378 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Hindustan Times"
      },
      "author": "Manshi Singh",
      "title": "Asteroid speeding towards close encounter with Earth today, says NASA - HT Tech",
      "description": "Asteroid speeding towards close encounter with Earth today says NASA The asteroid is travelling at 72871 kmph NASA said. NASA has warned about the bussized Asteroid 2023 JR1. Asteroid 2023 JR1 is a member of the Apollo group of asteroids.  NASA discovered thi…",
      "url": "https://tech.hindustantimes.com/web-stories/asteroid-speeding-towards-close-encounter-with-earth-today-says-nasa-71684061301891.html",
      "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/14/cropped/16-9/asteroid_1681212528521_1684061754139.jpg?impolicy=new-ht-20210112&width=1600/",
      "publishedAt": "2023-05-14T10:56:15Z",
      "content": "Photo Credit: NASA\r\n The asteroid is travelling at 72871 kmph, NASA said. \r\nPhoto Credit: Pixabay\r\n NASA has warned about the bus-sized Asteroid 2023 JR1. \r\nPhoto Credit: Pixabay\r\n Asteroid 2023 JR1 … [+867 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Space.com"
      },
      "author": "Andrew Jones",
      "title": "South Korean moon probe snaps pic of fellow lunar orbiter (photo) - Space.com",
      "description": "NASA's ShadowCam imager on the Danuri spacecraft captured a view of the Lunar Reconnaissance Orbiter.",
      "url": "https://www.space.com/danuri-moon-probe-photo-lunar-reconnaissance-orbiter",
      "urlToImage": "https://cdn.mos.cms.futurecdn.net/22Ctecu4t8HUqSCWc2M5NE-1200-80.jpeg",
      "publishedAt": "2023-05-14T10:00:58Z",
      "content": "South Korea's Danuri lunar orbiter flew 11 miles (18 kilometers) above the NASA Lunar Reconnaissance Orbiter on April 7, 2023, enabling ShadowCam to capture this dramatic image of LRO.  (Image credit… [+3263 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Inverse"
      },
      "author": "The Conversation, Christina Warinner, Alexander Hübner, Pierre Stallforth",
      "title": "Inside A Wild Method to Resurrect Ancient Molecules And Concoct New Antibiotics - Inverse",
      "description": "Exploring Earth's microbial past presents exciting opportunities to recover lost chemistry.",
      "url": "https://www.inverse.com/health/inside-a-wild-method-to-resurrect-ancient-molecules-and-concoct-new-antibiotics",
      "urlToImage": "https://imgix.bustle.com/uploads/getty/2023/5/12/58f397e3-3981-4f36-8b32-da3b74abf3d4-getty-1289422078.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg",
      "publishedAt": "2023-05-14T10:00:25Z",
      "content": "Microorganisms in particular, bacteria are skillful chemists that can produce an impressive diversity of chemical compounds known as natural products. These metabolites provide the microbes major evo… [+6740 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Hindustan Times"
      },
      "author": "HT Tech",
      "title": "NASA Astronomy Picture of the Day 14 May 2023: Iconic first free flight in space! - HT Tech",
      "description": "NASA Astronomy Picture of the Day for May 14 has remembered the iconic and first image of a free flight in space. Who is in this image? Read on.",
      "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-14-may-2023-iconic-first-free-flight-in-space-71684057689856.html",
      "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/14/cropped/16-9/freeflyer_nasa_960_1684057775190_1684057784801.jpg?impolicy=new-ht-20210112&width=1600",
      "publishedAt": "2023-05-14T09:50:32Z",
      "content": "How does it feel to fly in space without any attachments to a spaceship? Surreal, right? The experience can be literally out of this world - flying freely in the vastness of the cosmos! Such untether… [+1896 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Republic World"
      },
      "author": "Saumya joshi",
      "title": "50 years of NASA's Skylab: Interesting facts about America's first space station - Republic World",
      "description": "Skylab, America’s first space station and first crewed research laboratory in space was launched on May 14, 1973, which would be 50 years ago today.",
      "url": "https://www.republicworld.com/science/space/50-years-of-nasas-skylab-interesting-facts-about-americas-first-space-station-articleshow.html",
      "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/jej2f6fvbzcjqgif_1684051335.jpeg",
      "publishedAt": "2023-05-14T09:49:00Z",
      "content": "Skylab, Americas first space station and first crewed research laboratory in space was launched on May 14, 1973, which would be 50 years ago today, according to NASA's official website. \"Clouds of sm… [+2623 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Earth.com"
      },
      "author": null,
      "title": "Desert dust over the Bay of Biscay - Earth.com",
      "description": "Today's Image of the Day from NASA Earth Observatory features Saharan dust over the Bay of Biscay, where a phytoplankton bloom makes the water appear bright green and blue",
      "url": "https://www.earth.com/image/desert-dust-over-the-bay-of-biscay/",
      "urlToImage": "https://cff2.earth.com/uploads/2023/05/13231223/bloomdust_tmo_2011098_lrg.jpg",
      "publishedAt": "2023-05-14T08:48:16Z",
      "content": "Today’s Image of the Day from NASA Earth Observatory features Saharan dust over the Bay of Biscay, where a phytoplankton bloom makes the water appear bright green and blue. According to NASA, sedimen… [+2329 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "SciTechDaily"
      },
      "author": null,
      "title": "Mars' Mega Volcano: A Tour of Ascraeus Mons' Rugged Terrain - SciTechDaily",
      "description": "ESA's Mars Express has captured detailed images of Mars' second-tallest volcano, Ascraeus Mons, revealing features such as lava flows, tubes, chains of craters, and large fissures created by a combination of lava, ash, and water flows, and the presence of sub…",
      "url": "https://scitechdaily.com/mars-mega-volcano-a-tour-of-ascraeus-mons-rugged-terrain/",
      "urlToImage": "https://scitechdaily.com/images/Perspective-View-of-Ascraeus-Mons.jpg",
      "publishedAt": "2023-05-14T08:40:47Z",
      "content": "ByEuropean Space Agency (ESA)May 14, 2023\r\nThis image from ESAs Mars Express shows the southern flanks of Ascraeus Mons, the second-tallest volcano on Mars.This image comprises data gathered by Mars … [+8363 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Earth.com"
      },
      "author": null,
      "title": "Largest known cosmic explosion has been visible for three years - Earth.com",
      "description": "Largest known cosmic explosion has been visible for three years • Earth.com",
      "url": "https://www.earth.com/news/largest-known-cosmic-explosion-has-been-visible-for-three-years/",
      "urlToImage": "https://cff2.earth.com/uploads/2023/05/13230841/Low-Res_23_42-Artist-impression-of-a-black-hole-accretion.-Credit-John-A.-Paice..png.png",
      "publishedAt": "2023-05-14T08:08:45Z",
      "content": "A team of astronomers led by the University of Southampton in the UK has recently uncovered the largest cosmic explosion ever observed. This explosion, known as AT2021lwx, was first detected in 2020 … [+4872 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "RNZ"
      },
      "author": "RNZ News",
      "title": "You're emitting carbon just by reading this headline - here's what you can do to reduce it - RNZ",
      "description": "If digital technology were a country, it'd be the third-biggest energy consumer behind China and the US.",
      "url": "https://www.rnz.co.nz/news/world/489898/you-re-emitting-carbon-just-by-reading-this-headline-here-s-what-you-can-do-to-reduce-it",
      "urlToImage": "https://rnz-ressh.cloudinary.com/image/upload/s--AElu6iAi--/t_tohu-badge-facebook/v1643790231/4O3Y7WH_copyright_image_132967",
      "publishedAt": "2023-05-14T08:02:29Z",
      "content": "File photo. Photo: 123rf.com\r\nIf you're reading this, you're emitting carbon.\r\nOne online search uses about as much electricity as a light bulb left on for 35 minutes. Sending an email with a large a… [+3736 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "SciTechDaily"
      },
      "author": null,
      "title": "Nano-Wheels: Metallic Clusters With Unique Properties for Advanced Technology - SciTechDaily",
      "description": "Researchers in China have developed nano-wheels, a new family of metallic compounds with unique properties for use in advanced sensors and other technologies. The team synthesized lanthanide-based nano-clusters with diverse applications, including fluorescenc…",
      "url": "https://scitechdaily.com/nano-wheels-metallic-clusters-with-unique-properties-for-advanced-technology/",
      "urlToImage": "https://scitechdaily.com/images/Nano-Wheels-Wield-Property-Potential.jpg",
      "publishedAt": "2023-05-14T07:59:14Z",
      "content": "A multi-institute research team synthesized a family of nano-wheel-like metallic clusters, each with specific properties such as fluorescence and different types of magnetism that could advance next-… [+2377 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Free Press Journal"
      },
      "author": "FPJ Web Desk",
      "title": "Stratospheric Mystery! Surprising vibrations captured by solar balloons in Earths upper atmosphere - Free Press Journal",
      "description": "",
      "url": "https://www.freepressjournal.in/lifestyle/stratospheric-mystery-surprising-vibrations-captured-by-solar-balloons-in-earths-upper-atmosphere",
      "urlToImage": "https://gumlet.assettype.com/freepressjournal/2023-05/5dd83eef-cd62-46ec-b17a-a4633f02cdb5/Screenshot_2023_05_14_130730.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true",
      "publishedAt": "2023-05-14T07:46:51Z",
      "content": "In a surprising and yet mysterious way, large solar balloons deployed for an experiment recorded sounds containing some unexpected elements at an impressive altitude of 70,000 feet in the Earth's str… [+3903 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Daijiworld.com"
      },
      "author": null,
      "title": "Hubble telescope images light-bending galaxy cluster - Daijiworld.com",
      "description": "Washington, May 14 (IANS): NASA and European Space Agency's (ESA) Hubble Space Telescope has imaged a galaxy cluster that is almost nine billion light-years away.\r\nThe galaxy cluster, called eMACS J1823.1+7822, lies in the constellation Draco.\r\nIt is one of f…",
      "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1079496",
      "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png",
      "publishedAt": "2023-05-14T07:08:36Z",
      "content": "Washington, May 14 (IANS): NASA and European Space Agency's (ESA) Hubble Space Telescope has imaged a galaxy cluster that is almost nine billion light-years away.\r\nThe galaxy cluster, called eMACS J1… [+1613 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Tech Explorist"
      },
      "author": "Vidya Nagalwade",
      "title": "Sea Star Study provides an essential toolkit for organ development - Tech Explorist",
      "description": "Tube formation is important for understanding genetics and mechanics.",
      "url": "https://www.techexplorist.com/sea-star-study-provides-essential-toolkit-organ-development/60193/",
      "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/sea-star.jpg",
      "publishedAt": "2023-05-14T06:56:12Z",
      "content": "The coordinated organization of cells into a precise three-dimensional architecture is important for creating functional organs. Tubulogenesis, or the formation of hollow tubes, is a critical tempora… [+3982 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Universityworldnews.com"
      },
      "author": null,
      "title": "Publishers can't be blamed for clinging to the golden goose - University World News",
      "description": "By adopting Green Open Access, the global research community could have forced academic publishers to downsize to the real costs of publication: manag...",
      "url": "https://www.universityworldnews.com/post.php?story=20230510155204375",
      "urlToImage": "https://www.universityworldnews.com/images/uwn-ball-320.png",
      "publishedAt": "2023-05-14T06:11:38Z",
      "content": "Scientists and scholars (henceforth S&amp;S) are an odd lot. Theyre clearly not savvy in business matters, otherwise they would go into business. (A few do not necessarily the best of the lot.)S&amp;… [+8452 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Thetimeshub.in"
      },
      "author": "Natasha Kumar",
      "title": "Astronomers have found a galaxy with an unusual tail of stars more than a million light-years long - The Times Hub",
      "description": "Spread the love Researchers have discovered an unusual system consisting of a pair of galaxies and a thin, extended tail of gas and stars. The preprint of the study is published on the arXiv website. An international team of astrophysicists has discovered an …",
      "url": "https://thetimeshub.in/astronomers-have-found-a-galaxy-with-an-unusual-tail-of-stars-more-than-a-million-light-years-long/",
      "urlToImage": null,
      "publishedAt": "2023-05-14T06:07:58Z",
      "content": "Researchers have discovered an unusual system consisting of a pair of galaxies and a thin, extended tail of gas and stars. The preprint of the study is published on the arXiv website. \r\nAn internatio… [+536 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NDTV News"
      },
      "author": null,
      "title": "Tides Are Eating Into Glaciers, Triggering More Melting, Study Finds - NDTV",
      "description": "Melting glaciers could raise sea levels more than previously thought because of the way polar ice behaves where it meets the ocean floor.",
      "url": "https://www.ndtv.com/science/tides-are-eating-into-glaciers-triggering-more-melting-study-finds-4033058",
      "urlToImage": "https://c.ndtvimg.com/2023-05/tsgcajdg_glacier-bloomberg_625x300_14_May_23.jpg",
      "publishedAt": "2023-05-14T05:55:45Z",
      "content": "Previously, scientists believed ice at a glacier's grounding line was rigid\r\nMelting glaciers could raise sea levels more than previously thought because of the way polar ice behaves where it meets t… [+3406 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "TRT World"
      },
      "author": "Staff Reporter",
      "title": "Over 300 whales die in New Zealand's largest strandings in years - TRT World",
      "description": "Rescuers tried to help more than a hundred mammals return to sea but many got stranded again. It is relatively common for whales to get stranded on the country's beaches.",
      "url": "https://www.trtworld.com/perspectives/over-300-whales-die-in-new-zealands-largest-strandings-in-years-13087890",
      "urlToImage": "https://cdn-i.pr.trt.com.tr/trtworld/w960/h540/q70/0m_5087-trtworld-294070-330543.jpg",
      "publishedAt": "2023-05-14T05:50:22Z",
      "content": "About 70 percent had perished and attempts were underway to get the remaining whales offshore at high tide, but the outlook is gloomy, he said.\r\n\"With that number dead, you have to assume that the re… [+877 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "SciTechDaily"
      },
      "author": null,
      "title": "Challenging Widely Accepted Theory of Planetary Formation – Small Stars May Host Bigger Planets Than Thought - SciTechDaily",
      "description": "Stars with a mass less than half that of the Sun can harbor massive gas giants similar to Jupiter, contradicting the prevailing theory of planetary formation, a recent study by researchers from University College London (UCL) and the University of Warwick rev…",
      "url": "https://scitechdaily.com/challenging-widely-accepted-theory-of-planetary-formation-small-stars-may-host-bigger-planets-than-thought/",
      "urlToImage": "https://scitechdaily.com/images/NGTS-1b-scaled.jpg",
      "publishedAt": "2023-05-14T05:43:05Z",
      "content": "ByUniversity College LondonMay 13, 2023\r\nArtists impression of sunrise on planet NGTS-1b, a gas giant previously discovered orbiting a low-mass star. Credit: University of Warwick/Mark Garlick\r\nStars… [+7992 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Indiaherald.com"
      },
      "author": "Sowmiya Sriram",
      "title": "What is the color of the sun? Neither Yellow nor Orange..!? - ఇండియా హెరాల్డ్ గ్రూప్ అఫ్ పబ్లిషర్స్ ప్రై లిమిటెడ్ - India Herald Group of Publishers P LIMITED ",
      "description": "viral : What is the color of the sun? Science s answer to social media controversies... Author Jackie Devoy recently tweeted about the sun changing fr",
      "url": "https://www.indiaherald.com/Viral/Read/994593718/What-is-the-color-of-the-sun-Neither-Yellow-nor-Orange",
      "urlToImage": "https://www.indiaherald.com/imagestore/images/viral/127/what-is-the-color-of-the-sun-neither-yellow-nor-orange4b34de5c-8134-475a-a9e5-508bca0f45b4-415x250-IndiaHerald.jpg",
      "publishedAt": "2023-05-14T05:10:08Z",
      "content": "What is the color of the sun? Neither Yellow nor Orange..!?What is the color of the sun? Science's answer to social media controversies... Author Jackie Devoy recently tweeted about the sun changing … [+1830 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "collectSPACE.com"
      },
      "author": null,
      "title": "Astronaut now on space station recalls Skylab launch 50 years ago - collectSPACE.com",
      "description": "Stephen Bowen remembers seeing Skylab fly overhead. At eight years old, Bowen's experience watching the United States' first space station cross the night sky fueled his interest in spaceflight. Little did he know where that would take him 50 years later.",
      "url": "http://www.collectspace.com/news/news-051423a-skylab-launch-50th-iss-astronaut-remembers.html",
      "urlToImage": "http://www.collectspace.com/images/news-051423a-fb.jpg",
      "publishedAt": "2023-05-14T05:05:15Z",
      "content": "May 14, 2023\r\n — Stephen Bowen remembers seeing Skylab fly overhead.\r\nAt eight years old, Bowen's experience watching the United States' first space station cross the night sky fueled his interest in… [+2813 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "SciTechDaily"
      },
      "author": null,
      "title": "“Surprising” Findings – Scientists Identify Complete Respiratory Supercomplex - SciTechDaily",
      "description": "Every eukaryotic cell houses tiny \"powerhouses\" known as mitochondria, responsible for generating the all-purpose energy molecule, ATP. In order to fulfill this role, mitochondria must maintain a spatial organization of the membrane proteins that handle diver…",
      "url": "https://scitechdaily.com/surprising-findings-scientists-identify-complete-respiratory-supercomplex/",
      "urlToImage": "https://scitechdaily.com/images/The-Complete-Respiratory-Supercomplex.jpg",
      "publishedAt": "2023-05-14T04:52:59Z",
      "content": "ByAarhus UniversityMay 13, 2023\r\nThe complete respiratory supercomplex identified. Credit: luminous-lab.com\r\nEvery eukaryotic cell houses tiny powerhouses known as mitochondria, responsible for gener… [+3552 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "News18"
      },
      "author": "Adithyan P",
      "title": "Saturn's Rings Much Younger Than The Planet Itself, Shows Study - News18",
      "description": "The study, led by physicist Sascha Kempf at the University of Colorado Boulder, US, said that it has delivered the strongest evidence yet that Saturn’s rings are remarkably young, much younger than Saturn itself, which is about 4.5 billion years old.",
      "url": "https://www.news18.com/viral/saturns-rings-much-younger-than-the-planet-itself-shows-study-7812241.html",
      "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/05/saturn-2-168403501616x9.png",
      "publishedAt": "2023-05-14T04:21:38Z",
      "content": "Researchers have pegged the planet Saturns rings age at no more than 400 million years old, potentially answering a question that has boggled scientists for well over a century. The study, led by phy… [+2545 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NDTV News"
      },
      "author": null,
      "title": "NASA's Perseverance Rover Spots Evidence Of A Turbulent River On Mars - NDTV",
      "description": "NDTV.com: India, Business, Bollywood, Cricket, Video and Breaking News",
      "url": "https://www.ndtv.com/news",
      "urlToImage": "https://cdn.ndtv.com/common/images/ogndtv.png",
      "publishedAt": "2023-05-14T03:51:13Z",
      "content": "If you are a climate change warrior or know someone who is doing incredible work in this space, send us your entries and we'll bring the most innovative stories to the world."
    },
    {
      "source": {
        "id": null,
        "name": "Hindustan Times"
      },
      "author": "HT Tech",
      "title": "NASA alert! Asteroid 2023 JR1 set to buzz Earth today at a scorching 72871 kmph - HT Tech",
      "description": "Asteroid 2023 JR1 is set to make a close approach to Earth at the blistering speed of 72871 km per hour, NASA said. Know its danger in advance.",
      "url": "https://tech.hindustantimes.com/tech/news/nasa-alert-asteroid-2023-jr1-set-to-buzz-earth-today-at-a-scorching-72871-kmph-71684031756593.html",
      "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/14/cropped/16-9/asteroid-6096994_640_1683023408159_1684031872341.jpg?impolicy=new-ht-20210112&width=1600",
      "publishedAt": "2023-05-14T02:38:26Z",
      "content": "Asteroid 2023 JR1, a member of the Apollo group of asteroids, is currently headed for an unexpectedly close engagement with Earth today. Surprisingly, NASA discovered this asteroid just on May 12, 20… [+2185 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Hackaday"
      },
      "author": "Maya Posch",
      "title": "ESA Juice's RIME Antenna Breaks Free After Some Jiggling And Percussive Action - Hackaday",
      "description": "After ESA’s Jupiter-bound space probe Juice (Jupiter Icy Moons Explorer) launched on April 14th of this year, it initially looked as if it had squeezed out a refreshingly uneventful deploymen…",
      "url": "https://hackaday.com/2023/05/13/esa-juices-rime-antenna-breaks-free-after-some-jiggling-and-percussive-action/",
      "urlToImage": "https://hackaday.com/wp-content/uploads/2023/05/juice_feat.jpg",
      "publishedAt": "2023-05-14T02:00:00Z",
      "content": "After ESA’s Jupiter-bound space probe Juice (Jupiter Icy Moons Explorer) launched on April 14th of this year, it initially looked as if it had squeezed out a refreshingly uneventful deployment, until… [+1630 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "SciTechDaily"
      },
      "author": null,
      "title": "A Game-Changer for Space Telescopes: Membrane Mirrors Revolutionize Astronomy - SciTechDaily",
      "description": "Mirrors that are both lightweight and flexible could be compactly rolled up for the launch, and then accurately reshaped once they are deployed. Scientists have developed a new method to produce and shape large, high-quality mirrors, significantly thinner tha…",
      "url": "https://scitechdaily.com/a-game-changer-for-space-telescopes-membrane-mirrors-revolutionize-astronomy/",
      "urlToImage": "https://scitechdaily.com/images/New-Way-To-Make-Telescope-Mirrors-scaled.jpg",
      "publishedAt": "2023-05-14T01:55:51Z",
      "content": "ByOpticaMay 13, 2023\r\nResearchers have developed a new way to make telescope mirrors that could enable much larger, and thus more sensitive, telescopes to be placed in orbit. Credit: Sebastian Rabien… [+6577 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Oup.com"
      },
      "author": null,
      "title": "Chandra X-ray study of Supernova Remnant N63A in the Large Magellanic Cloud - Oxford Academic",
      "description": "Abstract. We perform extensive spectroscopy of the supernova remnant N63A in the Large Magellanic Cloud, using ∼43 ks Chandra archival data. By analysing the sp",
      "url": "https://academic.oup.com/mnras/advance-article-abstract/doi/10.1093/mnras/stad1389/7161801",
      "urlToImage": "https://academic.oup.com/data/sitebuilderassetsoriginals/live/images/mnras/mnras_ogimage.png",
      "publishedAt": "2023-05-14T00:54:27Z",
      "content": null
    },
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "TOI Education",
      "title": "How genes are turned on and off: Explained molecular biology of the cell - Times of India",
      "description": "Learning with TOI News: Discover the fascinating world of gene regulation and understand how genes are switched on and off, shaping our traits and characteristics. Explore th",
      "url": "https://timesofindia.indiatimes.com/education/learning-with-toi/how-genes-are-turned-on-and-off-explained-molecular-biology-of-the-cell/articleshow/100121585.cms",
      "urlToImage": "https://static.toiimg.com/thumb/msid-100121687,width-1070,height-580,imgsize-31620,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "publishedAt": "2023-05-14T00:30:00Z",
      "content": "Top 10 Colleges From Where Google Recruits in India, Except IITs"
    },
    {
      "source": {
        "id": null,
        "name": "NASA"
      },
      "author": null,
      "title": "Dunes Along the Yellow River - nasa.gov",
      "description": "Dunes, crops, roads, and solar farms flank the river as it winds through China’s Inner Mongolia.",
      "url": "https://earthobservatory.nasa.gov/images/151333/dunes-along-the-yellow-river",
      "urlToImage": "https://eoimages.gsfc.nasa.gov/images/imagerecords/151000/151333/iss067e122535_th.jpg",
      "publishedAt": "2023-05-13T22:02:02Z",
      "content": null
    },
    {
      "source": {
        "id": null,
        "name": "ScienceAlert"
      },
      "author": "ScienceAlert",
      "title": "JWST Takes Our Closest Look Yet at a Steamy And Mysterious Mini-Neptune - ScienceAlert",
      "description": null,
      "url": "https://www.sciencealert.com/jwst-takes-our-closest-look-yet-at-a-steamy-and-mysterious-mini-neptune",
      "urlToImage": null,
      "publishedAt": "2023-05-13T22:01:11Z",
      "content": null
    },
    {
      "source": {
        "id": null,
        "name": "YouTube"
      },
      "author": null,
      "title": "New 'Pangenome' project reveals diverse look at human DNA - Al Jazeera English",
      "description": "Researchers in the United States have improved on the Human Genome Project.They are adding 47 new samples to the map of DNA that was completed at the turn of...",
      "url": "https://www.youtube.com/watch?v=gtxuxOvTykg",
      "urlToImage": "https://i.ytimg.com/vi/gtxuxOvTykg/maxresdefault.jpg",
      "publishedAt": "2023-05-13T21:25:24Z",
      "content": null
    },
    {
      "source": {
        "id": null,
        "name": "SciTechDaily"
      },
      "author": null,
      "title": "Protein Power Unleashed: Spitrobot Makes Time-Resolved Crystallography Accessible - SciTechDaily",
      "description": "Spitrobot is a groundbreaking experimental device developed by scientists in Hamburg that simplifies observing protein changes and makes time-resolved crystallography more accessible. This will speed up research in health and disease and allow more research g…",
      "url": "https://scitechdaily.com/protein-power-unleashed-spitrobot-makes-time-resolved-crystallography-accessible/",
      "urlToImage": "https://scitechdaily.com/images/Spitrobot.jpg",
      "publishedAt": "2023-05-13T19:52:52Z",
      "content": "ByMax Planck Institute for the Structure and Dynamics of MatterMay 13, 2023\r\nScientists from four research institutes in Hamburg have developed the Spitrobot, a groundbreaking experimental setup that… [+5948 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "nj.com"
      },
      "author": "Len Melisurgo | NJ Advance Media for NJ.com",
      "title": "Does home insurance cover meteor damage? Here’s what experts say. - NJ.com",
      "description": "Insurance experts weigh in on whether your home insurance policy would cover damage from a falling meteor, asteroid or other space debris.",
      "url": "https://www.nj.com/news/2023/05/does-home-insurance-cover-meteor-damage-heres-what-experts-say.html",
      "urlToImage": "https://www.nj.com/resizer/-68tzaGJqWL7XW-Y_3IjnB7wThI=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/67MQIM53DZFORCIRNELK7E46E4.jpg",
      "publishedAt": "2023-05-13T19:33:00Z",
      "content": "The odds of a meteor falling from the sky and crashing into your house are astronomical, with some experts putting it at 1 in 3.9 trillion, far less likely than a single lottery ticket winning a Powe… [+4554 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Universe Today"
      },
      "author": "Nancy Atkinson",
      "title": "New Photos Show Collapsed Chains of Craters on a Martian Volcano - Universe Today",
      "description": "Most everyone is familiar with Olympus Mons, the largest volcano on Mars and also the largest in the Solar System. But there are several other enormous shield volcanoes on Mars. The second largest is Ascraeus Mons, and new images from ESA’s Mars Express space…",
      "url": "https://www.universetoday.com/161353/new-photos-show-collapsed-chains-of-craters-on-a-martian-volcano/",
      "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/05/The_flanks_of_Ascraeus_Mons_pillars-scaled.jpg",
      "publishedAt": "2023-05-13T18:42:26Z",
      "content": "Most everyone is familiar with Olympus Mons, the largest volcano on Mars and also the largest in the Solar System. But there are several other enormous shield volcanoes on Mars. The second largest is… [+2067 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Inverse"
      },
      "author": "Carmen Drahl, Knowable Magazine",
      "title": "Carbon-Sniffing Rover Is Designed To Crack Mars' Biggest Mystery - Inverse",
      "description": "A next-generation instrument on a delayed Martian rover may be the key to answering the question of life on the Red Planet",
      "url": "https://www.inverse.com/science/rosalind-franklin-rover",
      "urlToImage": "https://imgix.bustle.com/uploads/image/2023/5/12/b8b2a608-0233-440e-8695-a8422e2d4e0d-mars_landscape_dry_wet_0.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg",
      "publishedAt": "2023-05-13T18:00:25Z",
      "content": "March 17, 2022, was a rough day for Jorge Vago. A planetary physicist, Vago heads science for part of the European Space Agencys ExoMars program. His team was mere months from launching Europes first… [+11404 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Arkeonews.net"
      },
      "author": "oguz kayra",
      "title": "Particle physics and archeology collaboration uncovers secret Hellenistic underground chamber in Naples - arkeonews",
      "description": "The ruins of the ancient necropolis of Neapolis, built by the Greeks between the end of the fourth and the beginning of the third century BC, are located about 10 meters beneath modern-day Naples.",
      "url": "https://arkeonews.net/particle-physics-and-archeology-collaboration-uncovers-secret-hellenistic-underground-chamber-in-naples/",
      "urlToImage": "https://arkeonews.net/wp-content/uploads/2023/05/Napoli-Necropolis-min-1-e1683999408359.png",
      "publishedAt": "2023-05-13T17:42:03Z",
      "content": null
    },
    {
      "source": {
        "id": "fox-news",
        "name": "Fox News"
      },
      "author": "Julia Musto",
      "title": "NASA's Perseverance Mars rover captures images of what may have been a wild river - Fox News",
      "description": "NASA's Perseverance Mars rover may have captured images of what once was a flowing river while exploring Jezero Crater. NASA scientists are also looking under the Martian surface.",
      "url": "https://www.foxnews.com/science/nasa-perseverance-mars-rover-images-may-have-been-river",
      "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/05/Percy.jpg",
      "publishedAt": "2023-05-13T16:51:00Z",
      "content": "New images from NASA's Perseverance Mars rover may have revealed what was once a river on the red planet. \r\nThe river, which the agency said was deeper and faster-moving than scientists have ever see… [+2478 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Guardian"
      },
      "author": "Robin McKie",
      "title": "Scientists criticise Nasa for scaling back mission to explore beyond Pluto - The Guardian",
      "description": "Anger at decision to axe the main task of the New Horizons spacecraft to probe the remote Kuiper belt",
      "url": "https://www.theguardian.com/science/2023/may/13/scientists-criticise-nasa-for-scaling-back-mission-to-explore-beyond-pluto",
      "urlToImage": "https://i.guim.co.uk/img/media/b8b5f6b8a5c9dd6895b92b984e9a3bffc7676fac/269_0_4562_2739/master/4562.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=24f27f4d12f2bdf8619f0c7d0633c6e3",
      "publishedAt": "2023-05-13T15:50:00Z",
      "content": "It may have reached the edge of the solar system and travelled more than 5 billion miles through space, but the New Horizons spacecraft is causing major ripples on Earth. A dispute has erupted betwee… [+4468 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Inshorts.com"
      },
      "author": null,
      "title": "Metallic object that crashed into US home was a meteorite: Experts - Inshorts",
      "description": "A meteorite that punched a hole in the roof of a New Jersey home in the US and bounced around a bedroom has been identified as a rare stony chondrite meteorite, as per researchers. The object weighs almost a kilogram and measures six-by-four inches. The ident…",
      "url": "https://inshorts.com/en/news/metallic-object-that-crashed-into-us-home-was-a-meteorite-experts-1683992444466",
      "urlToImage": "https://static.inshorts.com/inshorts/images/v1/variants/jpg/m/2023/05_may/13_sat/img_1683991138462_379.jpg?",
      "publishedAt": "2023-05-13T15:44:29Z",
      "content": null
    },
    {
      "source": {
        "id": null,
        "name": "India Education Diary"
      },
      "author": "iednewsdesk",
      "title": "Carnegie Mellon University's Machine Learning Method Illuminates Fundamental Aspects of Evolution - India Education Diary",
      "description": "A team of researchers in Carnegie Mellon University's Computational Biology Department(opens in new window) (CBD) have developed new methods to identify parts of the genome critical to understanding how certain traits of species evolved.The cover of",
      "url": "https://indiaeducationdiary.in/carnegie-mellon-universitys-machine-learning-method-illuminates-fundamental-aspects-of-evolution/",
      "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png",
      "publishedAt": "2023-05-13T15:33:08Z",
      "content": "A team of researchers in Carnegie Mellon University’s Computational Biology Department(opens in new window) (CBD) have developed new methods to identify parts of the genome critical to understanding … [+4537 chars]"
    },
    {
      "source": {
        "id": "cnn",
        "name": "CNN"
      },
      "author": "Katie Hunt",
      "title": "Updated human DNA map captures diversity of life - CNN",
      "description": "This week, find out how a new \"pangenome\" better captures the richness of human diversity, how NASA studies sleep issues for astronauts, how the Voyager space probes are kept operating, how privatized spaceflight is heating up, and more.",
      "url": "https://www.cnn.com/2023/05/13/world/human-pangenome-science-newsletter-scn/index.html",
      "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230511120703-wonder-theory-nl-0511-pangenome.jpg?c=16x9&q=w_800,c_fill",
      "publishedAt": "2023-05-13T15:04:00Z",
      "content": "A version of this story appeared in CNNs Wonder Theory science newsletter. To get it in your inbox, sign up for free here.\r\nAn international team of scientists mapped nearlythe entirehuman genome for… [+5107 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "KSL.com"
      },
      "author": "https://www.facebook.com/kslcom/",
      "title": "Stunning mosaic of baby star clusters created from 1 million telescope shots - KSL.com",
      "description": "Astronomers have created a stunning mosaic of baby star clusters hiding in our galactic backyard.",
      "url": "https://www.ksl.com/article/50642865/stunning-mosaic-of-baby-star-clusters-created-from-1-million-telescope-shots",
      "urlToImage": "https://img.ksl.com/slc/2929/292941/29294181.jpg?filter=kslv2/responsive_story_lg",
      "publishedAt": "2023-05-13T14:37:47Z",
      "content": "Estimated read time: Less than a minute\r\nCAPE CANAVERAL, Fla. Astronomers have created a stunning mosaic of baby star clusters hiding in our galactic backyard.\r\nThe montage, published Thursday, revea… [+1075 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "India Education Diary"
      },
      "author": "iednewsdesk",
      "title": "University of Göttingen researchers explain tooth abrasion in cows - India Education Diary",
      "description": "Ruminants like cows have developed an unusual way of digesting their food: they ingest plants, give them a rough chewing and then swallow the half-chewed mash before regurgitating it repeatedly and continuing to chew. This has clear advantages, as a",
      "url": "https://indiaeducationdiary.in/university-of-gottingen-researchers-explain-tooth-abrasion-in-cows/",
      "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/05/pic_659e39612b20230511172841-1024x786.jpg",
      "publishedAt": "2023-05-13T14:22:35Z",
      "content": "Ruminants like cows have developed an unusual way of digesting their food: they ingest plants, give them a rough chewing and then swallow the half-chewed mash before regurgitating it repeatedly and c… [+2264 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Phys.Org"
      },
      "author": "Morgan MacLeod",
      "title": "Astronomers just saw a star eat a planet—an astrophysicist on the team explains the first-of-its-kind discovery - Phys.org",
      "description": "For the first time, astronomers have captured images that show a star consuming one of its planets. The star, named ZTF SLRN-2020, is located in the Milky Way galaxy, in the constellation Aquila. As the star swallowed its planet, the star brightened to 100 ti…",
      "url": "https://phys.org/news/2023-05-astronomers-star-planetan-astrophysicist-team.html",
      "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/astronomers-just-saw-a.jpg",
      "publishedAt": "2023-05-13T14:01:41Z",
      "content": "For the first time, astronomers have captured images that show a star consuming one of its planets. The star, named ZTF SLRN-2020, is located in the Milky Way galaxy, in the constellation Aquila. As … [+6474 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "SYFY WIRE"
      },
      "author": "Cassidy Ward",
      "title": "NASA’s Racing Against the Clock to Keep Voyager Alive in Interstellar Space - Syfy",
      "description": "NASA scientists are using reserve power to keep Voyager 1 and 2 in operation.",
      "url": "https://www.syfy.com/syfy-wire/nasa-racing-to-keep-voyager-alive-in-interstellar-space",
      "urlToImage": "https://www.syfy.com/sites/syfy/files/2022/12/the_ark.jpg",
      "publishedAt": "2023-05-13T14:00:03Z",
      "content": "A century from now, a brave but desperate collection of humans will embark upon a journey to another world. Fleeing an Earth in decline, the crew of the Ark One will settle into stasis pods on a year… [+5445 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Abplive.com"
      },
      "author": "Radifah Kabir",
      "title": "Science For Everyone: Drug Research, Cancer Treatment — How International Space Station Experiments Benefit Earth - ABP Live",
      "description": "Science For Everyone: This week, on ABP Live's science column, we will discuss the numerous ways the experiments conducted on the International Space Station (ISS) benefit Earth.",
      "url": "https://news.abplive.com/science/science-for-everyone-drug-research-cancer-treatment-space-crops-artificial-retinas-how-international-space-station-experiments-benefit-earth-1602049",
      "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/05/13/762926a0e043cadaadb77075a9a0d8491683964950267324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628",
      "publishedAt": "2023-05-13T13:10:08Z",
      "content": "Science For Everyone: Welcome back to \"Science For Everyone\", ABP Live's weekly science column. Last week, we discussed black holes, and how they behave. This week, we will discuss the numerous ways … [+18226 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Earth.com"
      },
      "author": null,
      "title": "Saturn now leads the solar system moon race with 145 - Earth.com",
      "description": "Saturn now leads the solar system moon race with 145 • Earth.com",
      "url": "https://www.earth.com/news/saturn-now-leads-the-solar-system-moon-race-with-145/",
      "urlToImage": "https://cff2.earth.com/uploads/2023/05/13065906/Saturn-6-scaled.jpg",
      "publishedAt": "2023-05-13T13:00:10Z",
      "content": "In a thrilling development that propels Saturn back to the forefront of the Solar System’s “moon race,” an international team of astronomers, including researchers from the University of British Colu… [+7214 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Space.com"
      },
      "author": "Robert Lea",
      "title": "James Webb Space Telescope catches ancient galaxy in the act of explosive star birth - Space.com",
      "description": "The galaxy is one of the earliest active star-forming galaxies studied in detail by astronomers.",
      "url": "https://www.space.com/james-webb-space-telescope-ancient-galaxy-star-birth",
      "urlToImage": "https://cdn.mos.cms.futurecdn.net/qpAkShLp2kqGCkfGqGBMuf-1200-80.jpg",
      "publishedAt": "2023-05-13T13:00:00Z",
      "content": "The James Webb Space Telescope (JWST) continues to peer backwards through cosmic time, revealing the processes that created the universe as we see it today.\r\nAstronomers have used the James Webb Spac… [+3664 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Nature.com"
      },
      "author": null,
      "title": "False positive microbiological results in Acanthamoeba keratitis: the importance of clinico-microbiological correlation | Eye - Nature.com",
      "description": "Eye - False positive microbiological results in Acanthamoeba keratitis: the importance of clinico-microbiological correlation",
      "url": "https://www.nature.com/articles/s41433-023-02573-1",
      "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41433-023-02573-1/MediaObjects/41433_2023_2573_Fig1_HTML.png",
      "publishedAt": "2023-05-13T12:51:57Z",
      "content": null
    },
    {
      "source": {
        "id": null,
        "name": "YouTube"
      },
      "author": null,
      "title": "Amazing stellar nursery views created from '1 million images' - VideoFromSpace",
      "description": "ESO’s Visible and Infrared Survey Telescope for Astronomy (VISTA) has delivered amazing imagery of nearby stellar nurseries. The views were created by \"pieci...",
      "url": "https://www.youtube.com/watch?v=xzGeFS8spwI",
      "urlToImage": "https://i.ytimg.com/vi/xzGeFS8spwI/maxresdefault.jpg",
      "publishedAt": "2023-05-13T12:30:36Z",
      "content": null
    },
    {
      "source": {
        "id": null,
        "name": "Cgtn.com"
      },
      "author": "CGTN",
      "title": "Science Saturday: COVID-19, moon discovery, SpaceX explosion and more - CGTN",
      "description": "In this week's Science Saturday, we look at science news ranging from the latest about COVID-19 to China's new space technology.",
      "url": "https://news.cgtn.com/news/2023-05-13/Science-Saturday-COVID-19-moon-discovery-SpaceX-explosion-and-more-1jMb7i2W7LO/index.html",
      "urlToImage": "https://video.cgtn.com/news/2023-05-13/Science-Saturday-COVID-19-moon-discovery-SpaceX-explosion-and-more-1jMb7i2W7LO/video/40d1996e6d5d4ef1be4c0b7db8622ea9/40d1996e6d5d4ef1be4c0b7db8622ea9-1280.png",
      "publishedAt": "2023-05-13T12:07:22Z",
      "content": "In this week's Science Saturday, we look at science news ranging from the latest about COVID-19 to China's new space technology.\r\nCOVID-19\r\nThe global emergency status for COVID-19 is officially over… [+2061 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Live Science"
      },
      "author": "Ben Turner",
      "title": "Mysterious, ultra low-frequency noises detected in Earth's atmosphere — and scientists can't explain them - Livescience.com",
      "description": "Solar-powered balloons detected strange rumblings at a height of 70,000 feet above the Earth's surface. Scientists can't identify them.",
      "url": "https://www.livescience.com/space/astronomy/mysterious-ultra-low-frequency-noises-detected-in-earths-atmosphere-and-scientists-cant-explain-them",
      "urlToImage": "https://cdn.mos.cms.futurecdn.net/zDsJLyLQ5MHVfdew29Z23G-1200-80.jpg",
      "publishedAt": "2023-05-13T12:00:00Z",
      "content": "Solar-powered balloons launched into the Earth's stratosphere have recorded a series of mysterious rumblings, and scientists can't pinpoint their origins.\r\nThe noises, detected by specialized instrum… [+3555 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Interesting Engineering"
      },
      "author": "Abdul-Rahman Oladimeji Bello",
      "title": "Gravitational waves from the early universe discovered - Interesting Engineering",
      "description": "Discover how oscillons, formed after the Big Bang, hold the key to unlocking the secrets of our cosmic origins.",
      "url": "https://interestingengineering.com/science/early-universe-gravitational-waves",
      "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/05/12/image/jpeg/1gTqRWLDlsgpFqCfFS4lalOxXzAfhcz4MEreh4zl.jpg",
      "publishedAt": "2023-05-13T12:00:00Z",
      "content": "These findings mark a significant breakthrough, offering a fresh perspective on the study of the universe's earliest moments. They present an alternative method for investigating the early universe d… [+1455 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Tech Times"
      },
      "author": "Jace Dela Cruz",
      "title": "Human-like Camera? This Bio-inspired Device Snaps Images By Copying Human Eyes - Tech Times",
      "description": "The bio-inspired device replicated the red, green, and blue lights that we humans see!",
      "url": "https://www.techtimes.com/articles/291496/20230513/human-camera-bio-inspired-device-snaps-images-human-eyes.htm",
      "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/427617/eyes.jpg",
      "publishedAt": "2023-05-13T11:30:00Z",
      "content": "In a fascinating melding of nature and technology, scientists at Penn State have unveiled an ingenious device that mimics the inner workings of human eyes, enabling it to capture images just like a c… [+3631 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Boing Boing"
      },
      "author": null,
      "title": "Why did early humans have perfectly straight teeth? - Boing Boing",
      "description": "Sure, we may have all of the amazing technology, but early humans had it made. Who needs the internet when you don’t have to worry about a job or taxes? Hate lines at the DMV? May I present t…",
      "url": "https://boingboing.net/2023/05/13/why-did-early-humans-have-perfectly-straight-teeth.html",
      "urlToImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2023/01/oysterteeth.jpg?fit=463%2C284&ssl=1",
      "publishedAt": "2023-05-13T11:20:00Z",
      "content": "Sure, we may have all of the amazing technology, but early humans had it made. Who needs the internet when you don't have to worry about a job or taxes? Hate lines at the DMV? May I present to you th… [+654 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Yahoo Entertainment"
      },
      "author": "Steven Yablonski",
      "title": "Stunning photo of Earth captured by Europe’s new weather satellite - Yahoo News",
      "description": "Europe’s newest weather satellite has provided a photo of Earth, showing conditions from Africa to Europe in stunning detail.",
      "url": "https://news.yahoo.com/stunning-photo-earth-captured-europe-110025314.html",
      "urlToImage": "https://media.zenfs.com/en/fox_weather_articles_483/53ecc49946ca3525afaf81e744f4c750",
      "publishedAt": "2023-05-13T11:00:25Z",
      "content": "Europes newest weather satellite has provided a photo of Earth, showing conditions from Africa to Europe in stunning detail.\r\nThe Meteosat Third Generation Imager-1 (MTG-I1) was launched on an Ariane… [+2528 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Theregister.com"
      },
      "author": "Katyanna Quach",
      "title": "Astronomers say they've seen the largest explosion yet – and we just had to talk to them - The Register",
      "description": "The culprit: A supermassive black hole, a billion times more massive than the Sun, feeding on a giant gas cloud",
      "url": "https://www.theregister.com/2023/05/13/astroboffins_have_witnessed_the_largest/",
      "urlToImage": "https://regmedia.co.uk/2023/05/12/handout_black_hole.jpg",
      "publishedAt": "2023-05-13T10:24:00Z",
      "content": "Astronomers have observed the largest explosion yet in space that we're aware of, a years-long event involving a supermassive black hole estimated to be one billion times more massive than the Sun th… [+3267 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "SciTechDaily"
      },
      "author": null,
      "title": "The Pangenome Breakthrough: A Crystal Clear Image of Human Genomic Diversity - SciTechDaily",
      "description": "In a major advance, scientists have assembled genomic sequences of 47 people from diverse backgrounds to create a pangenome, which offers a more accurate representation of human genetic diversity than the existing reference genome. This new pangenome will hel…",
      "url": "https://scitechdaily.com/?p=277594",
      "urlToImage": "https://scitechdaily.com/images/Human-Genetic-Diversity-Concept-Image.jpg",
      "publishedAt": "2023-05-13T10:20:19Z",
      "content": "ByRockefeller UniversityMay 13, 2023\r\nThe Human Pangenome Reference Consortium has made significant progress in creating a more inclusive human reference genome by assembling genomic sequences of 47 … [+17108 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Nature.com"
      },
      "author": null,
      "title": "Provisioning ecotourism does not increase tiger shark site fidelity | Scientific Reports - Nature.com",
      "description": "Scientific Reports - Provisioning ecotourism does not increase tiger shark site fidelity",
      "url": "https://www.nature.com/articles/s41598-023-34446-8",
      "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-023-34446-8/MediaObjects/41598_2023_34446_Fig1_HTML.png",
      "publishedAt": "2023-05-13T09:27:59Z",
      "content": null
    },
    {
      "source": {
        "id": null,
        "name": "Indulgexpress.com"
      },
      "author": "Sonali Shenoy",
      "title": "Svech, an eco-friendly fitness brand plants a tree every time you buy two yoga mats - indulgexpress",
      "description": "The brand has tied up with the Sankalpa Taru foundation and all the plantation details of your tree, including&nbsp;geo location and name given are sent via mail.\n&nbsp;",
      "url": "https://www.indulgexpress.com/life-style/mind-and-body/2023/may/13/svech-an-eco-friendly-fitness-brand-plants-a-tree-every-time-you-buy-two-yoga-mats-49000.html",
      "urlToImage": "https://images.indulgexpress.com/uploads/user/imagelibrary/2023/5/13/original/IMG_20190806_164532_118-01_revised1.jpg",
      "publishedAt": "2023-05-13T09:20:00Z",
      "content": "Svech, the sustainable yoga mat brand, is now ensuring every purchase you make, has an impact towards helping the environment and promoting social good. In association with the NGO Sankalp Taru, Svec… [+1908 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "BBC News"
      },
      "author": "https://www.facebook.com/bbcnews",
      "title": "Scientist makes alien weather forecast for distant planet - BBC",
      "description": "Dr Michael Roman made the observations about the atmospheric conditions on the planet GJ 1214b.",
      "url": "https://www.bbc.com/news/uk-england-leicestershire-65560562",
      "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/168DB/production/_129697329_planet239.jpg",
      "publishedAt": "2023-05-13T08:30:29Z",
      "content": "A scientist's \"alien weather forecast\" for a distant planet has helped a NASA-coordinated team gain a new understanding of it.\r\nDr Michael Roman, from the University of Leicester, made the observatio… [+2549 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Hindustan Times"
      },
      "author": "MD Ijaj Khan",
      "title": "Beyond our solar system, James Webb Space Telescope snaps 'Mini Neptune' - HT Tech",
      "description": "The James Webb Space Telescope, renowned for its space science observations, has captured images of a peculiar planet known as GJ1214b, aka 'Mini Neptune', located outside our solar system",
      "url": "https://tech.hindustantimes.com/tech/news/beyond-our-solar-system-james-webb-space-telescope-snaps-mini-neptune-71683962873451.html",
      "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/13/cropped/16-9/Beyond_our_solar_system_James_Webb_Space_Telescope_1683963040022_1683963040325.jpg?impolicy=new-ht-20210112&width=1600",
      "publishedAt": "2023-05-13T07:36:06Z",
      "content": "james webb space telescope, james webb telescope, james webb telescope neptune, neptune, mini neptune, GJ1214b, space science, space science observatory, galaxies, stars, water world. Telescope captu… [+2793 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "News9live.com"
      },
      "author": null,
      "title": "Structure of galactic bubbles is more complex than previously believed - News9 LIVE",
      "description": "Extending above and below the disc of the Milky Way are gigantic bubbles of high-energy gas",
      "url": "https://www.news9live.com/science/structure-of-galactic-bubbles-more-complex-than-previously-believed-2137794",
      "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/05/image_10610e-eRosita-Fermi-Bubbles-Cropped.jpg",
      "publishedAt": "2023-05-13T07:16:11Z",
      "content": "Extending above and below the disc of the Milky Way are gigantic bubbles of high-energy gas\r\nWithin the gas that surrounds the Milky Way, known as the circumgalactic medium, are massive bubbles that … [+1573 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "News9live.com"
      },
      "author": null,
      "title": "Astronomers observe photon metamorphosis for first time in X-rays from supernova remnant - News9 LIVE",
      "description": "The observed phenomenon was first theoretically predicted over 20 years ago",
      "url": "https://www.news9live.com/science/astronomers-observe-photon-metamorphosis-for-first-time-in-x-rays-from-supernova-remnant-2137696",
      "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/05/0504_star_0-Cropped.jpg",
      "publishedAt": "2023-05-13T07:11:10Z",
      "content": "The observed phenomenon was first theoretically predicted over 20 years ago\r\nWhen a star runs out of nuclear fuel to keep burning, it sheds its outer layers in a violent explosion, leaving a dense co… [+2009 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Dailyinterlake.com"
      },
      "author": "HAYDEN BLACKFORD",
      "title": "Libby's O'Rourke sets his sights on space - Daily Inter Lake",
      "description": "Isaac O'Rourke, a 2021 Libby High School graduate and current student at Montana State University in Bozeman, attributes much of his success to hands-on classes he took in high school.",
      "url": "https://dailyinterlake.com/news/2023/may/13/libbys-orourke-sets-his-sights-space/",
      "urlToImage": "https://hagadone.media.clients.ellingtoncms.com/img/photos/2023/05/12/0514_DIL_Balloon_r1200x630.jpeg?b7d505e466ff31ef2a911eceee85296b69915698",
      "publishedAt": "2023-05-13T07:03:01Z",
      "content": "Isaac O'Rourke, a 2021 Libby High School graduate and current student at Montana State University in Bozeman, attributes much of his success to hands-on classes he took in high school.\r\nO'Rourke is m… [+3242 chars]"
    },
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "ET HealthWorld",
      "title": "Research: Investigating stem cells can assist develop individualised regenerative medicine - ETHealthWorld",
      "description": "Stem cells can differ in their organelles both across and within different cell types. Researchers can develop better therapies to cure a variety of disorders by better understanding cell function via the study of these distinctions.",
      "url": "https://health.economictimes.indiatimes.com/news/industry/research-investigating-stem-cells-can-assist-develop-individualised-regenerative-medicine/100203562",
      "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-100203562,imgsize-17474,width-1200,height=765,overlay-ethealth/industry/research-investigating-stem-cells-can-assist-develop-individualised-regenerative-medicine.jpg",
      "publishedAt": "2023-05-13T06:45:00Z",
      "content": "Washington: Organelles, which are made up of various protein and RNA fragments inside of a cell, are crucial for maintaining homeostasis, controlling ageing and development, and producing energy. Ste… [+4657 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "News9live.com"
      },
      "author": null,
      "title": "Population of 100 newly discovered blazars allows testing of black hole theories - News9 LIVE",
      "description": "Observations from a number of instruments were used to discover distant blazars",
      "url": "https://www.news9live.com/science/population-of-100-newly-discovered-blazars-allows-testing-of-black-hole-theories-2137560",
      "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/05/jpegpia20912-Cropped.jpg",
      "publishedAt": "2023-05-13T06:16:59Z",
      "content": "Observations from a number of instruments were used to discover distant blazars\r\nSome of the materials falling into supermassive black holes are violently ejected from the region in the form of relat… [+1932 chars]"
    }
  ]
}